podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
 * @} */ /* End group Interrupt_vector_numbers_GROUP 
 */
/**
* @addtogroup Interrupt_handler_prototypes_GROUP Interrupt handler prototypes
* @brief Prototypes for interrupt handlers
* @{
*/
/* -------------------------  Exception Handlers  ------------------------ */
extern void NMI_Handler(void);                       /**< Non maskable Interrupt, cannot be stopped or preempted                           */
extern void HardFault_Handler(void);                 /**< Hard Fault, all classes of Fault                                                 */
extern void MemManage_Handler(void);                 /**< Memory Management, MPU mismatch, including Access Violation and No Match         */
extern void BusFault_Handler(void);                  /**< Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault   */
extern void UsageFault_Handler(void);                /**< Usage Fault, i.e. Undef Instruction, Illegal State Transition                    */
extern void SVC_Handler(void);                       /**< System Service Call via SVC instruction                                          */
extern void DebugMon_Handler(void);                  /**< Debug Monitor                                                                    */
extern void PendSV_Handler(void);                    /**< Pendable request for system service                                              */
extern void SysTick_Handler(void);                   /**< System Tick Timer                                                                */
extern void DMA0_DMA16_IRQHandler(void);             /**< Direct memory access controller                                                  */
extern void DMA1_DMA17_IRQHandler(void);             /**< Direct memory access controller                                                  */
extern void DMA2_DMA18_IRQHandler(void);             /**< Direct memory access controller                                                  */
extern void DMA3_DMA19_IRQHandler(void);             /**< Direct memory access controller                                                  */
extern void DMA4_DMA20_IRQHandler(void);             /**< Direct memory access controller                                                  */
extern void DMA5_DMA21_IRQHandler(void);             /**< Direct memory access controller                                                  */
extern void DMA6_DMA22_IRQHandler(void);             /**< Direct memory access controller                                                  */
extern void DMA7_DMA23_IRQHandler(void);             /**< Direct memory access controller                                                  */
extern void DMA8_DMA24_IRQHandler(void);             /**< Direct memory access controller                                                  */
extern void DMA9_DMA25_IRQHandler(void);             /**< Direct memory access controller                                                  */
extern void DMA10_DMA26_IRQHandler(void);            /**< Direct memory access controller                                                  */
extern void DMA11_DMA27_IRQHandler(void);            /**< Direct memory access controller                                                  */
extern void DMA12_DMA28_IRQHandler(void);            /**< Direct memory access controller                                                  */
extern void DMA13_DMA29_IRQHandler(void);            /**< Direct memory access controller                                                  */
extern void DMA14_DMA30_IRQHandler(void);            /**< Direct memory access controller                                                  */
extern void DMA15_DMA31_IRQHandler(void);            /**< Direct memory access controller                                                  */
extern void DMA_Error_IRQHandler(void);              /**< Direct memory access controller                                                  */
extern void FTF_Command_IRQHandler(void);            /**< Flash Memory Interface                                                           */
extern void FTF_ReadCollision_IRQHandler(void);      /**< Flash Memory Interface                                                           */
extern void PMC_IRQHandler(void);                    /**< Power Management Controller                                                      */
extern void LLWU_IRQHandler(void);                   /**< Low Leakage Wakeup                                                               */
extern void WDOG_IRQHandler(void);                   /**< External Watchdog Monitor                                                        */
extern void RNGA_IRQHandler(void);                   /**< Random Number Generator Accelerator                                              */
extern void I2C0_IRQHandler(void);                   /**< Inter-Integrated Circuit                                                         */
extern void I2C1_IRQHandler(void);                   /**< Inter-Integrated Circuit                                                         */
extern void SPI0_IRQHandler(void);                   /**< Serial Peripheral Interface                                                      */
extern void SPI1_IRQHandler(void);                   /**< Serial Peripheral Interface                                                      */
extern void SPI2_IRQHandler(void);                   /**< Serial Peripheral Interface                                                      */
extern void CAN0_MessageBuffer_IRQHandler(void);     /**< Flex Controller Area Network module                                              */
extern void CAN0_BusOff_IRQHandler(void);            /**< Flex Controller Area Network module                                              */
extern void CAN0_Error_IRQHandler(void);             /**< Flex Controller Area Network module                                              */
extern void CAN0_TxWarning_IRQHandler(void);         /**< Flex Controller Area Network module                                              */
extern void CAN0_RxWarning_IRQHandler(void);         /**< Flex Controller Area Network module                                              */
extern void CAN0_WakeUp_IRQHandler(void);            /**< Flex Controller Area Network module                                              */
extern void I2S0_Tx_IRQHandler(void);                /**< Synchronous Serial Interface                                                     */
extern void I2S0_Rx_IRQHandler(void);                /**< Synchronous Serial Interface                                                     */
extern void CAN1_MessageBuffer_IRQHandler(void);     /**< Flex Controller Area Network module                                              */
extern void CAN1_BusOff_IRQHandler(void);            /**< Flex Controller Area Network module                                              */
extern void CAN1_Error_IRQHandler(void);             /**< Flex Controller Area Network module                                              */
extern void CAN1_TxWarning_IRQHandler(void);         /**< Flex Controller Area Network module                                              */
extern void CAN1_RxWarning_IRQHandler(void);         /**< Flex Controller Area Network module                                              */
extern void CAN1_WakeUp_IRQHandler(void);            /**< Flex Controller Area Network module                                              */
extern void UART0_Lon_IRQHandler(void);              /**< Serial Communication Interface                                                   */
extern void UART0_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART0_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART1_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART1_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART2_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART2_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART3_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART3_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART4_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART4_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART5_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART5_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void ADC0_IRQHandler(void);                   /**< Analogue to Digital Converter                                                    */
extern void ADC1_IRQHandler(void);                   /**< Analogue to Digital Converter                                                    */
extern void CMP0_IRQHandler(void);                   /**< High-Speed Comparator                                                            */
extern void CMP1_IRQHandler(void);                   /**< High-Speed Comparator                                                            */
extern void CMP2_IRQHandler(void);                   /**< High-Speed Comparator                                                            */
extern void FTM0_IRQHandler(void);                   /**< FlexTimer Module                                                                 */
extern void FTM1_IRQHandler(void);                   /**< FlexTimer Module                                                                 */
extern void FTM2_IRQHandler(void);                   /**< FlexTimer Module                                                                 */
extern void CMT_IRQHandler(void);                    /**< Carrier Modulator Transmitter                                                    */
extern void RTC_Alarm_IRQHandler(void);              /**< Real Time Clock                                                                  */
extern void RTC_Seconds_IRQHandler(void);            /**< Real Time Clock                                                                  */
extern void PIT0_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PIT1_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PIT2_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PIT3_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PDB0_IRQHandler(void);                   /**< Programmable Delay Block                                                         */
extern void USB0_IRQHandler(void);                   /**< Universal Serial Bus                                                             */
extern void USBDCD0_IRQHandler(void);                /**< USB Device Charger Detection                                                     */
extern void ENET_1588Timeout_IRQHandler(void);       /**< Ethernet MAC-NET Core                                                            */
extern void ENET_Transmit_IRQHandler(void);          /**< Ethernet MAC-NET Core                                                            */
extern void ENET_Receive_IRQHandler(void);           /**< Ethernet MAC-NET Core                                                            */
extern void ENET_Error_IRQHandler(void);             /**< Ethernet MAC-NET Core                                                            */
extern void SDHC0_IRQHandler(void);                  /**< Secured Digital Host Controller                                                  */
extern void DAC0_IRQHandler(void);                   /**< Digital to Analogue Converter                                                    */
extern void DAC1_IRQHandler(void);                   /**< Digital to Analogue Converter                                                    */
extern void TSI0_IRQHandler(void);                   /**< Touch Sense Interface                                                            */
extern void LPTMR0_IRQHandler(void);                 /**< Low Power Timer                                                                  */
extern void PORTA_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTB_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTC_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTD_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTE_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTF_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void DDR_IRQHandler(void);                    /**< DRAM Controller                                                                  */
extern void NFC_IRQHandler(void);                    /**< NAND flash controller                                                            */
extern void USBHS_IRQHandler(void);                  /**< USB High Speed                                                                   */
extern void LCD_IRQHandler(void);                    /**< Liquid Crystal Display Controller                                                */
extern void CMP3_IRQHandler(void);                   /**< High-Speed Comparator                                                            */
extern void Tamper_IRQHandler(void);                 /**< Tamper Detect and Secure Key Storage                                             */
extern void FTM3_IRQHandler(void);                   /**< FlexTimer Module                                                                 */
extern void ADC2_IRQHandler(void);                   /**< Analogue to Digital Converter                                                    */
extern void ADC3_IRQHandler(void);                   /**< Analogue to Digital Converter                                                    */
extern void I2S1_Tx_IRQHandler(void);                /**< Synchronous Serial Interface                                                     */
extern void I2S1_Rx_IRQHandler(void);                /**< Synchronous Serial Interface                                                     */

/**
 * @} */ /* End group Interrupt_handler_prototypes_GROUP 
 */
/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/**
* @addtogroup Cortex_Core_Configuration_GROUP Cortex Core Configuration
* @brief Configuration of the cm4 Processor and Core Peripherals
* @{
*/
#define __CM4_REV                 0x0100     /**< CPU Revision                                        */
#define __MPU_PRESENT             0          /**< Whether MPU is present                              */
#define __NVIC_PRIO_BITS          4          /**< Number of implemented bits in NVIC PRIO register    */
#define __Vendor_SysTickConfig    0          /**< Whether Vendor implemented SYSTICK timer is present */
#define __FPU_PRESENT             1          /**< Whether FPU is present                              */
#define __VTOR_PRESENT            1          /**< Whether VTOR register is present                    */

/**
 * @} */ /* End group Cortex_Core_Configuration_GROUP 
 */
#include "core_cm4.h"           /* Processor and core peripherals     */
#include "system.h"             /* Device specific configuration file */

#ifndef __IO
#define __IO volatile 
#endif

#ifndef __I
#define __I volatile const
#endif

