podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/* CAN0 - Peripheral instance base addresses */
#define CAN0_BasePtr                   0x40024000UL //!< Peripheral base address
#define CAN0                           ((CAN_Type *) CAN0_BasePtr) //!< Freescale base pointer
#define CAN0_BASE_PTR                  (CAN0) //!< Freescale style base pointer
#define CAN0_IRQS { CAN0_MessageBuffer_IRQn, CAN0_BusOff_IRQn, CAN0_Error_IRQn, CAN0_TxWarning_IRQn, CAN0_RxWarning_IRQn, CAN0_WakeUp_IRQn,  }

/**
 * @} */ /* End group CAN_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CAN_Peripheral_access_layer_GROUP CAN Peripheral Access Layer
* @brief C Struct for CAN
* @{
*/

/* ================================================================================ */
/* ================           CAN1 (derived from CAN0)             ================ */
/* ================================================================================ */

/**
 * @brief Flex Controller Area Network module
 */

/* CAN1 - Peripheral instance base addresses */
#define CAN1_BasePtr                   0x400A4000UL //!< Peripheral base address
#define CAN1                           ((CAN_Type *) CAN1_BasePtr) //!< Freescale base pointer
#define CAN1_BASE_PTR                  (CAN1) //!< Freescale style base pointer
#define CAN1_IRQS { CAN1_MessageBuffer_IRQn, CAN1_BusOff_IRQn, CAN1_Error_IRQn, CAN1_TxWarning_IRQn, CAN1_RxWarning_IRQn, CAN1_WakeUp_IRQn,  }

/**
 * @} */ /* End group CAN_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CAU_Peripheral_access_layer_GROUP CAU Peripheral Access Layer
* @brief C Struct for CAU
* @{
*/

/* ================================================================================ */
/* ================           CAU (file:CAU_0)                     ================ */
/* ================================================================================ */

/**
 * @brief Memory Mapped Cryptographic Acceleration Unit
 */
/**
* @addtogroup CAU_structs_GROUP CAU struct
* @brief Struct for CAU
* @{
*/
typedef struct CAU_Type {
   __O  uint32_t  DIRECT[16];                   /**< 0000: Direct access register                                       */
        uint8_t   RESERVED_0[2048];             /**< 0040: 0x800 bytes                                                  */
   __O  uint32_t  LDR_CASR;                     /**< 0840: Status register - Load Register command                      */
   __O  uint32_t  LDR_CAA;                      /**< 0844: Accumulator register - Load Register command                 */
   __O  uint32_t  LDR_CA[9];                    /**< 0848: General Purpose Register  - Load Register command            */
        uint8_t   RESERVED_1[20];               /**< 086C: 0x14 bytes                                                   */
   __I  uint32_t  STR_CASR;                     /**< 0880: Status register  - Store Register command                    */
   __I  uint32_t  STR_CAA;                      /**< 0884: Accumulator register - Store Register command                */
   __I  uint32_t  STR_CA[9];                    /**< 0888: General Purpose Register  - Store Register command           */
        uint8_t   RESERVED_2[20];               /**< 08AC: 0x14 bytes                                                   */
   __O  uint32_t  ADR_CASR;                     /**< 08C0: Status register  - Add Register command                      */
   __O  uint32_t  ADR_CAA;                      /**< 08C4: Accumulator register - Add to register command               */
   __O  uint32_t  ADR_CA[9];                    /**< 08C8: General Purpose Register  - Add to register command          */
        uint8_t   RESERVED_3[20];               /**< 08EC: 0x14 bytes                                                   */
   __O  uint32_t  RADR_CASR;                    /**< 0900: Status register  - Reverse and Add to Register command       */
   __O  uint32_t  RADR_CAA;                     /**< 0904: Accumulator register - Reverse and Add to Register command   */
   __O  uint32_t  RADR_CA[9];                   /**< 0908: General Purpose Register  - Reverse and Add to Register command */
        uint8_t   RESERVED_4[84];               /**< 092C: 0x54 bytes                                                   */
   __O  uint32_t  XOR_CASR;                     /**< 0980: Status register  - Exclusive Or command                      */
   __O  uint32_t  XOR_CAA;                      /**< 0984: Accumulator register - Exclusive Or command                  */
   __O  uint32_t  XOR_CA[9];                    /**< 0988: General Purpose Register  - Exclusive Or command             */
        uint8_t   RESERVED_5[20];               /**< 09AC: 0x14 bytes                                                   */
   __O  uint32_t  ROTL_CASR;                    /**< 09C0: Status register  - Rotate Left command                       */
   __O  uint32_t  ROTL_CAA;                     /**< 09C4: Accumulator register - Rotate Left command                   */
   __O  uint32_t  ROTL_CA[9];                   /**< 09C8: General Purpose Register  - Rotate Left command              */
        uint8_t   RESERVED_6[276];              /**< 09EC: 0x114 bytes                                                  */
   __O  uint32_t  AESC_CASR;                    /**< 0B00: Status register  - AES Column Operation command              */
   __O  uint32_t  AESC_CAA;                     /**< 0B04: Accumulator register - AES Column Operation command          */
   __O  uint32_t  AESC_CA[9];                   /**< 0B08: General Purpose Register  - AES Column Operation command     */
        uint8_t   RESERVED_7[20];               /**< 0B2C: 0x14 bytes                                                   */
   __O  uint32_t  AESIC_CASR;                   /**< 0B40: Status register  - AES Inverse Column Operation command      */
   __O  uint32_t  AESIC_CAA;                    /**< 0B44: Accumulator register - AES Inverse Column Operation command  */
   __O  uint32_t  AESIC_CA[9];                  /**< 0B48: General Purpose Register  - AES Inverse Column Operation command */
} CAU_Type;

/**
 * @} */ /* End group CAU_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'CAU' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup CAU_Register_Masks_GROUP CAU Register Masks
* @brief Register Masks for CAU
* @{
*/
/* ------- DIRECT Bit Fields                        ------ */
/* ------- LDR_CASR Bit Fields                      ------ */
#define CAU_LDR_CASR_IC_MASK                     (0x1U)                                              /*!< CAU_LDR_CASR.IC Mask                    */
#define CAU_LDR_CASR_IC_SHIFT                    (0U)                                                /*!< CAU_LDR_CASR.IC Position                */
#define CAU_LDR_CASR_IC(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< CAU_LDR_CASR.IC Field                   */
#define CAU_LDR_CASR_DPE_MASK                    (0x2U)                                              /*!< CAU_LDR_CASR.DPE Mask                   */
#define CAU_LDR_CASR_DPE_SHIFT                   (1U)                                                /*!< CAU_LDR_CASR.DPE Position               */
#define CAU_LDR_CASR_DPE(x)                      (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< CAU_LDR_CASR.DPE Field                  */
#define CAU_LDR_CASR_VER_MASK                    (0xF0000000U)                                       /*!< CAU_LDR_CASR.VER Mask                   */
#define CAU_LDR_CASR_VER_SHIFT                   (28U)                                               /*!< CAU_LDR_CASR.VER Position               */
#define CAU_LDR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< CAU_LDR_CASR.VER Field                  */
/* ------- LDR_CAA Bit Fields                       ------ */
/* ------- LDR_CA Bit Fields                        ------ */
/* ------- STR_CASR Bit Fields                      ------ */
#define CAU_STR_CASR_IC_MASK                     (0x1U)                                              /*!< CAU_STR_CASR.IC Mask                    */
#define CAU_STR_CASR_IC_SHIFT                    (0U)                                                /*!< CAU_STR_CASR.IC Position                */
#define CAU_STR_CASR_IC(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< CAU_STR_CASR.IC Field                   */
#define CAU_STR_CASR_DPE_MASK                    (0x2U)                                              /*!< CAU_STR_CASR.DPE Mask                   */
#define CAU_STR_CASR_DPE_SHIFT                   (1U)                                                /*!< CAU_STR_CASR.DPE Position               */
#define CAU_STR_CASR_DPE(x)                      (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< CAU_STR_CASR.DPE Field                  */
#define CAU_STR_CASR_VER_MASK                    (0xF0000000U)                                       /*!< CAU_STR_CASR.VER Mask                   */
#define CAU_STR_CASR_VER_SHIFT                   (28U)                                               /*!< CAU_STR_CASR.VER Position               */
#define CAU_STR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< CAU_STR_CASR.VER Field                  */
/* ------- STR_CAA Bit Fields                       ------ */
/* ------- STR_CA Bit Fields                        ------ */
/* ------- ADR_CASR Bit Fields                      ------ */
#define CAU_ADR_CASR_IC_MASK                     (0x1U)                                              /*!< CAU_ADR_CASR.IC Mask                    */
#define CAU_ADR_CASR_IC_SHIFT                    (0U)                                                /*!< CAU_ADR_CASR.IC Position                */
#define CAU_ADR_CASR_IC(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< CAU_ADR_CASR.IC Field                   */
#define CAU_ADR_CASR_DPE_MASK                    (0x2U)                                              /*!< CAU_ADR_CASR.DPE Mask                   */
#define CAU_ADR_CASR_DPE_SHIFT                   (1U)                                                /*!< CAU_ADR_CASR.DPE Position               */
#define CAU_ADR_CASR_DPE(x)                      (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< CAU_ADR_CASR.DPE Field                  */
#define CAU_ADR_CASR_VER_MASK                    (0xF0000000U)                                       /*!< CAU_ADR_CASR.VER Mask                   */
#define CAU_ADR_CASR_VER_SHIFT                   (28U)                                               /*!< CAU_ADR_CASR.VER Position               */
#define CAU_ADR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< CAU_ADR_CASR.VER Field                  */
/* ------- ADR_CAA Bit Fields                       ------ */
/* ------- ADR_CA Bit Fields                        ------ */
/* ------- RADR_CASR Bit Fields                     ------ */
#define CAU_RADR_CASR_IC_MASK                    (0x1U)                                              /*!< CAU_RADR_CASR.IC Mask                   */
#define CAU_RADR_CASR_IC_SHIFT                   (0U)                                                /*!< CAU_RADR_CASR.IC Position               */
#define CAU_RADR_CASR_IC(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< CAU_RADR_CASR.IC Field                  */
#define CAU_RADR_CASR_DPE_MASK                   (0x2U)                                              /*!< CAU_RADR_CASR.DPE Mask                  */
#define CAU_RADR_CASR_DPE_SHIFT                  (1U)                                                /*!< CAU_RADR_CASR.DPE Position              */
#define CAU_RADR_CASR_DPE(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< CAU_RADR_CASR.DPE Field                 */
#define CAU_RADR_CASR_VER_MASK                   (0xF0000000U)                                       /*!< CAU_RADR_CASR.VER Mask                  */
#define CAU_RADR_CASR_VER_SHIFT                  (28U)                                               /*!< CAU_RADR_CASR.VER Position              */
#define CAU_RADR_CASR_VER(x)                     (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< CAU_RADR_CASR.VER Field                 */
/* ------- RADR_CAA Bit Fields                      ------ */
/* ------- RADR_CA Bit Fields                       ------ */
/* ------- XOR_CASR Bit Fields                      ------ */
#define CAU_XOR_CASR_IC_MASK                     (0x1U)                                              /*!< CAU_XOR_CASR.IC Mask                    */
#define CAU_XOR_CASR_IC_SHIFT                    (0U)                                                /*!< CAU_XOR_CASR.IC Position                */
#define CAU_XOR_CASR_IC(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< CAU_XOR_CASR.IC Field                   */
#define CAU_XOR_CASR_DPE_MASK                    (0x2U)                                              /*!< CAU_XOR_CASR.DPE Mask                   */
#define CAU_XOR_CASR_DPE_SHIFT                   (1U)                                                /*!< CAU_XOR_CASR.DPE Position               */
#define CAU_XOR_CASR_DPE(x)                      (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< CAU_XOR_CASR.DPE Field                  */
#define CAU_XOR_CASR_VER_MASK                    (0xF0000000U)                                       /*!< CAU_XOR_CASR.VER Mask                   */
#define CAU_XOR_CASR_VER_SHIFT                   (28U)                                               /*!< CAU_XOR_CASR.VER Position               */
#define CAU_XOR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< CAU_XOR_CASR.VER Field                  */
/* ------- XOR_CAA Bit Fields                       ------ */
/* ------- XOR_CA Bit Fields                        ------ */
/* ------- ROTL_CASR Bit Fields                     ------ */
#define CAU_ROTL_CASR_IC_MASK                    (0x1U)                                              /*!< CAU_ROTL_CASR.IC Mask                   */
#define CAU_ROTL_CASR_IC_SHIFT                   (0U)                                                /*!< CAU_ROTL_CASR.IC Position               */
#define CAU_ROTL_CASR_IC(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< CAU_ROTL_CASR.IC Field                  */
#define CAU_ROTL_CASR_DPE_MASK                   (0x2U)                                              /*!< CAU_ROTL_CASR.DPE Mask                  */
#define CAU_ROTL_CASR_DPE_SHIFT                  (1U)                                                /*!< CAU_ROTL_CASR.DPE Position              */
#define CAU_ROTL_CASR_DPE(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< CAU_ROTL_CASR.DPE Field                 */
#define CAU_ROTL_CASR_VER_MASK                   (0xF0000000U)                                       /*!< CAU_ROTL_CASR.VER Mask                  */
#define CAU_ROTL_CASR_VER_SHIFT                  (28U)                                               /*!< CAU_ROTL_CASR.VER Position              */
#define CAU_ROTL_CASR_VER(x)                     (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< CAU_ROTL_CASR.VER Field                 */
/* ------- ROTL_CAA Bit Fields                      ------ */
/* ------- ROTL_CA Bit Fields                       ------ */
/* ------- AESC_CASR Bit Fields                     ------ */
#define CAU_AESC_CASR_IC_MASK                    (0x1U)                                              /*!< CAU_AESC_CASR.IC Mask                   */
#define CAU_AESC_CASR_IC_SHIFT                   (0U)                                                /*!< CAU_AESC_CASR.IC Position               */
#define CAU_AESC_CASR_IC(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< CAU_AESC_CASR.IC Field                  */
#define CAU_AESC_CASR_DPE_MASK                   (0x2U)                                              /*!< CAU_AESC_CASR.DPE Mask                  */
#define CAU_AESC_CASR_DPE_SHIFT                  (1U)                                                /*!< CAU_AESC_CASR.DPE Position              */
#define CAU_AESC_CASR_DPE(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< CAU_AESC_CASR.DPE Field                 */
#define CAU_AESC_CASR_VER_MASK                   (0xF0000000U)                                       /*!< CAU_AESC_CASR.VER Mask                  */
#define CAU_AESC_CASR_VER_SHIFT                  (28U)                                               /*!< CAU_AESC_CASR.VER Position              */
#define CAU_AESC_CASR_VER(x)                     (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< CAU_AESC_CASR.VER Field                 */
/* ------- AESC_CAA Bit Fields                      ------ */
/* ------- AESC_CA Bit Fields                       ------ */
/* ------- AESIC_CASR Bit Fields                    ------ */
#define CAU_AESIC_CASR_IC_MASK                   (0x1U)                                              /*!< CAU_AESIC_CASR.IC Mask                  */
#define CAU_AESIC_CASR_IC_SHIFT                  (0U)                                                /*!< CAU_AESIC_CASR.IC Position              */
#define CAU_AESIC_CASR_IC(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< CAU_AESIC_CASR.IC Field                 */
#define CAU_AESIC_CASR_DPE_MASK                  (0x2U)                                              /*!< CAU_AESIC_CASR.DPE Mask                 */
#define CAU_AESIC_CASR_DPE_SHIFT                 (1U)                                                /*!< CAU_AESIC_CASR.DPE Position             */
#define CAU_AESIC_CASR_DPE(x)                    (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< CAU_AESIC_CASR.DPE Field                */
#define CAU_AESIC_CASR_VER_MASK                  (0xF0000000U)                                       /*!< CAU_AESIC_CASR.VER Mask                 */
#define CAU_AESIC_CASR_VER_SHIFT                 (28U)                                               /*!< CAU_AESIC_CASR.VER Position             */
#define CAU_AESIC_CASR_VER(x)                    (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< CAU_AESIC_CASR.VER Field                */
/* ------- AESIC_CAA Bit Fields                     ------ */
/* ------- AESIC_CA Bit Fields                      ------ */
/**
 * @} */ /* End group CAU_Register_Masks_GROUP 
 */

