podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
* @addtogroup DDR_Register_Masks_GROUP DDR Register Masks
* @brief Register Masks for DDR
* @{
*/
/* ------- CR00 Bit Fields                          ------ */
#define DDR_CR00_START_MASK                      (0x1U)                                              /*!< DDR_CR00.START Mask                     */
#define DDR_CR00_START_SHIFT                     (0U)                                                /*!< DDR_CR00.START Position                 */
#define DDR_CR00_START(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DDR_CR00.START Field                    */
#define DDR_CR00_DDRCLS_MASK                     (0xF00U)                                            /*!< DDR_CR00.DDRCLS Mask                    */
#define DDR_CR00_DDRCLS_SHIFT                    (8U)                                                /*!< DDR_CR00.DDRCLS Position                */
#define DDR_CR00_DDRCLS(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< DDR_CR00.DDRCLS Field                   */
#define DDR_CR00_VERSION_MASK                    (0xFFFF0000U)                                       /*!< DDR_CR00.VERSION Mask                   */
#define DDR_CR00_VERSION_SHIFT                   (16U)                                               /*!< DDR_CR00.VERSION Position               */
#define DDR_CR00_VERSION(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< DDR_CR00.VERSION Field                  */
/* ------- CR01 Bit Fields                          ------ */
#define DDR_CR01_MAXROW_MASK                     (0x1FU)                                             /*!< DDR_CR01.MAXROW Mask                    */
#define DDR_CR01_MAXROW_SHIFT                    (0U)                                                /*!< DDR_CR01.MAXROW Position                */
#define DDR_CR01_MAXROW(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1FUL)          /*!< DDR_CR01.MAXROW Field                   */
#define DDR_CR01_MAXCOL_MASK                     (0xF00U)                                            /*!< DDR_CR01.MAXCOL Mask                    */
#define DDR_CR01_MAXCOL_SHIFT                    (8U)                                                /*!< DDR_CR01.MAXCOL Position                */
#define DDR_CR01_MAXCOL(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< DDR_CR01.MAXCOL Field                   */
#define DDR_CR01_CSMAX_MASK                      (0x30000U)                                          /*!< DDR_CR01.CSMAX Mask                     */
#define DDR_CR01_CSMAX_SHIFT                     (16U)                                               /*!< DDR_CR01.CSMAX Position                 */
#define DDR_CR01_CSMAX(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< DDR_CR01.CSMAX Field                    */
/* ------- CR02 Bit Fields                          ------ */
#define DDR_CR02_TINIT_MASK                      (0xFFFFFFU)                                         /*!< DDR_CR02.TINIT Mask                     */
#define DDR_CR02_TINIT_SHIFT                     (0U)                                                /*!< DDR_CR02.TINIT Position                 */
#define DDR_CR02_TINIT(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFUL)      /*!< DDR_CR02.TINIT Field                    */
#define DDR_CR02_INITAREF_MASK                   (0xF000000U)                                        /*!< DDR_CR02.INITAREF Mask                  */
#define DDR_CR02_INITAREF_SHIFT                  (24U)                                               /*!< DDR_CR02.INITAREF Position              */
#define DDR_CR02_INITAREF(x)                     (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< DDR_CR02.INITAREF Field                 */
/* ------- CR03 Bit Fields                          ------ */
#define DDR_CR03_LATLIN_MASK                     (0xFU)                                              /*!< DDR_CR03.LATLIN Mask                    */
#define DDR_CR03_LATLIN_SHIFT                    (0U)                                                /*!< DDR_CR03.LATLIN Position                */
#define DDR_CR03_LATLIN(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< DDR_CR03.LATLIN Field                   */
#define DDR_CR03_LATGATE_MASK                    (0xF00U)                                            /*!< DDR_CR03.LATGATE Mask                   */
#define DDR_CR03_LATGATE_SHIFT                   (8U)                                                /*!< DDR_CR03.LATGATE Position               */
#define DDR_CR03_LATGATE(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< DDR_CR03.LATGATE Field                  */
#define DDR_CR03_WRLAT_MASK                      (0xF0000U)                                          /*!< DDR_CR03.WRLAT Mask                     */
#define DDR_CR03_WRLAT_SHIFT                     (16U)                                               /*!< DDR_CR03.WRLAT Position                 */
#define DDR_CR03_WRLAT(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< DDR_CR03.WRLAT Field                    */
#define DDR_CR03_TCCD_MASK                       (0x1F000000U)                                       /*!< DDR_CR03.TCCD Mask                      */
#define DDR_CR03_TCCD_SHIFT                      (24U)                                               /*!< DDR_CR03.TCCD Position                  */
#define DDR_CR03_TCCD(x)                         (((uint32_t)(((uint32_t)(x))<<24U))&0x1F000000UL)   /*!< DDR_CR03.TCCD Field                     */
/* ------- CR04 Bit Fields                          ------ */
#define DDR_CR04_TBINT_MASK                      (0x7U)                                              /*!< DDR_CR04.TBINT Mask                     */
#define DDR_CR04_TBINT_SHIFT                     (0U)                                                /*!< DDR_CR04.TBINT Position                 */
#define DDR_CR04_TBINT(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< DDR_CR04.TBINT Field                    */
#define DDR_CR04_TRRD_MASK                       (0x700U)                                            /*!< DDR_CR04.TRRD Mask                      */
#define DDR_CR04_TRRD_SHIFT                      (8U)                                                /*!< DDR_CR04.TRRD Position                  */
#define DDR_CR04_TRRD(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0x700UL)         /*!< DDR_CR04.TRRD Field                     */
#define DDR_CR04_TRC_MASK                        (0x3F0000U)                                         /*!< DDR_CR04.TRC Mask                       */
#define DDR_CR04_TRC_SHIFT                       (16U)                                               /*!< DDR_CR04.TRC Position                   */
#define DDR_CR04_TRC(x)                          (((uint32_t)(((uint32_t)(x))<<16U))&0x3F0000UL)     /*!< DDR_CR04.TRC Field                      */
#define DDR_CR04_TRASMIN_MASK                    (0xFF000000U)                                       /*!< DDR_CR04.TRASMIN Mask                   */
#define DDR_CR04_TRASMIN_SHIFT                   (24U)                                               /*!< DDR_CR04.TRASMIN Position               */
#define DDR_CR04_TRASMIN(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< DDR_CR04.TRASMIN Field                  */
/* ------- CR05 Bit Fields                          ------ */
#define DDR_CR05_TWTR_MASK                       (0xFU)                                              /*!< DDR_CR05.TWTR Mask                      */
#define DDR_CR05_TWTR_SHIFT                      (0U)                                                /*!< DDR_CR05.TWTR Position                  */
#define DDR_CR05_TWTR(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< DDR_CR05.TWTR Field                     */
#define DDR_CR05_TRP_MASK                        (0xF00U)                                            /*!< DDR_CR05.TRP Mask                       */
#define DDR_CR05_TRP_SHIFT                       (8U)                                                /*!< DDR_CR05.TRP Position                   */
#define DDR_CR05_TRP(x)                          (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< DDR_CR05.TRP Field                      */
#define DDR_CR05_TRTP_MASK                       (0x70000U)                                          /*!< DDR_CR05.TRTP Mask                      */
#define DDR_CR05_TRTP_SHIFT                      (16U)                                               /*!< DDR_CR05.TRTP Position                  */
#define DDR_CR05_TRTP(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0x70000UL)      /*!< DDR_CR05.TRTP Field                     */
#define DDR_CR05_TMRD_MASK                       (0x1F000000U)                                       /*!< DDR_CR05.TMRD Mask                      */
#define DDR_CR05_TMRD_SHIFT                      (24U)                                               /*!< DDR_CR05.TMRD Position                  */
#define DDR_CR05_TMRD(x)                         (((uint32_t)(((uint32_t)(x))<<24U))&0x1F000000UL)   /*!< DDR_CR05.TMRD Field                     */
/* ------- CR06 Bit Fields                          ------ */
#define DDR_CR06_TMOD_MASK                       (0xFFU)                                             /*!< DDR_CR06.TMOD Mask                      */
#define DDR_CR06_TMOD_SHIFT                      (0U)                                                /*!< DDR_CR06.TMOD Position                  */
#define DDR_CR06_TMOD(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< DDR_CR06.TMOD Field                     */
#define DDR_CR06_TRASMAX_MASK                    (0xFFFF00U)                                         /*!< DDR_CR06.TRASMAX Mask                   */
#define DDR_CR06_TRASMAX_SHIFT                   (8U)                                                /*!< DDR_CR06.TRASMAX Position               */
#define DDR_CR06_TRASMAX(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0xFFFF00UL)      /*!< DDR_CR06.TRASMAX Field                  */
#define DDR_CR06_INTWBR_MASK                     (0x1000000U)                                        /*!< DDR_CR06.INTWBR Mask                    */
#define DDR_CR06_INTWBR_SHIFT                    (24U)                                               /*!< DDR_CR06.INTWBR Position                */
#define DDR_CR06_INTWBR(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DDR_CR06.INTWBR Field                   */
/* ------- CR07 Bit Fields                          ------ */
#define DDR_CR07_CLKPW_MASK                      (0x7U)                                              /*!< DDR_CR07.CLKPW Mask                     */
#define DDR_CR07_CLKPW_SHIFT                     (0U)                                                /*!< DDR_CR07.CLKPW Position                 */
#define DDR_CR07_CLKPW(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< DDR_CR07.CLKPW Field                    */
#define DDR_CR07_TCKESR_MASK                     (0x1F00U)                                           /*!< DDR_CR07.TCKESR Mask                    */
#define DDR_CR07_TCKESR_SHIFT                    (8U)                                                /*!< DDR_CR07.TCKESR Position                */
#define DDR_CR07_TCKESR(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0x1F00UL)        /*!< DDR_CR07.TCKESR Field                   */
#define DDR_CR07_AP_MASK                         (0x10000U)                                          /*!< DDR_CR07.AP Mask                        */
#define DDR_CR07_AP_SHIFT                        (16U)                                               /*!< DDR_CR07.AP Position                    */
#define DDR_CR07_AP(x)                           (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DDR_CR07.AP Field                       */
#define DDR_CR07_CCAPEN_MASK                     (0x1000000U)                                        /*!< DDR_CR07.CCAPEN Mask                    */
#define DDR_CR07_CCAPEN_SHIFT                    (24U)                                               /*!< DDR_CR07.CCAPEN Position                */
#define DDR_CR07_CCAPEN(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DDR_CR07.CCAPEN Field                   */
/* ------- CR08 Bit Fields                          ------ */
#define DDR_CR08_TRAS_MASK                       (0x1U)                                              /*!< DDR_CR08.TRAS Mask                      */
#define DDR_CR08_TRAS_SHIFT                      (0U)                                                /*!< DDR_CR08.TRAS Position                  */
#define DDR_CR08_TRAS(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DDR_CR08.TRAS Field                     */
#define DDR_CR08_TRASDI_MASK                     (0xFF00U)                                           /*!< DDR_CR08.TRASDI Mask                    */
#define DDR_CR08_TRASDI_SHIFT                    (8U)                                                /*!< DDR_CR08.TRASDI Position                */
#define DDR_CR08_TRASDI(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< DDR_CR08.TRASDI Field                   */
#define DDR_CR08_TWR_MASK                        (0x1F0000U)                                         /*!< DDR_CR08.TWR Mask                       */
#define DDR_CR08_TWR_SHIFT                       (16U)                                               /*!< DDR_CR08.TWR Position                   */
#define DDR_CR08_TWR(x)                          (((uint32_t)(((uint32_t)(x))<<16U))&0x1F0000UL)     /*!< DDR_CR08.TWR Field                      */
#define DDR_CR08_TDAL_MASK                       (0x1F000000U)                                       /*!< DDR_CR08.TDAL Mask                      */
#define DDR_CR08_TDAL_SHIFT                      (24U)                                               /*!< DDR_CR08.TDAL Position                  */
#define DDR_CR08_TDAL(x)                         (((uint32_t)(((uint32_t)(x))<<24U))&0x1F000000UL)   /*!< DDR_CR08.TDAL Field                     */
/* ------- CR09 Bit Fields                          ------ */
#define DDR_CR09_TDLL_MASK                       (0xFFFFU)                                           /*!< DDR_CR09.TDLL Mask                      */
#define DDR_CR09_TDLL_SHIFT                      (0U)                                                /*!< DDR_CR09.TDLL Position                  */
#define DDR_CR09_TDLL(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR09.TDLL Field                     */
#define DDR_CR09_NOCMD_MASK                      (0x10000U)                                          /*!< DDR_CR09.NOCMD Mask                     */
#define DDR_CR09_NOCMD_SHIFT                     (16U)                                               /*!< DDR_CR09.NOCMD Position                 */
#define DDR_CR09_NOCMD(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DDR_CR09.NOCMD Field                    */
#define DDR_CR09_BSTLEN_MASK                     (0x7000000U)                                        /*!< DDR_CR09.BSTLEN Mask                    */
#define DDR_CR09_BSTLEN_SHIFT                    (24U)                                               /*!< DDR_CR09.BSTLEN Position                */
#define DDR_CR09_BSTLEN(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0x7000000UL)    /*!< DDR_CR09.BSTLEN Field                   */
/* ------- CR10 Bit Fields                          ------ */
#define DDR_CR10_TFAW_MASK                       (0x3FU)                                             /*!< DDR_CR10.TFAW Mask                      */
#define DDR_CR10_TFAW_SHIFT                      (0U)                                                /*!< DDR_CR10.TFAW Position                  */
#define DDR_CR10_TFAW(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x3FUL)          /*!< DDR_CR10.TFAW Field                     */
#define DDR_CR10_TCPD_MASK                       (0xFFFF00U)                                         /*!< DDR_CR10.TCPD Mask                      */
#define DDR_CR10_TCPD_SHIFT                      (8U)                                                /*!< DDR_CR10.TCPD Position                  */
#define DDR_CR10_TCPD(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0xFFFF00UL)      /*!< DDR_CR10.TCPD Field                     */
#define DDR_CR10_TRPAB_MASK                      (0xF000000U)                                        /*!< DDR_CR10.TRPAB Mask                     */
#define DDR_CR10_TRPAB_SHIFT                     (24U)                                               /*!< DDR_CR10.TRPAB Position                 */
#define DDR_CR10_TRPAB(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< DDR_CR10.TRPAB Field                    */
/* ------- CR11 Bit Fields                          ------ */
#define DDR_CR11_REGDIMM_MASK                    (0x1U)                                              /*!< DDR_CR11.REGDIMM Mask                   */
#define DDR_CR11_REGDIMM_SHIFT                   (0U)                                                /*!< DDR_CR11.REGDIMM Position               */
#define DDR_CR11_REGDIMM(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DDR_CR11.REGDIMM Field                  */
#define DDR_CR11_AREF_MASK                       (0x100U)                                            /*!< DDR_CR11.AREF Mask                      */
#define DDR_CR11_AREF_SHIFT                      (8U)                                                /*!< DDR_CR11.AREF Position                  */
#define DDR_CR11_AREF(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< DDR_CR11.AREF Field                     */
#define DDR_CR11_AREFMODE_MASK                   (0x10000U)                                          /*!< DDR_CR11.AREFMODE Mask                  */
#define DDR_CR11_AREFMODE_SHIFT                  (16U)                                               /*!< DDR_CR11.AREFMODE Position              */
#define DDR_CR11_AREFMODE(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DDR_CR11.AREFMODE Field                 */
#define DDR_CR11_TREFEN_MASK                     (0x1000000U)                                        /*!< DDR_CR11.TREFEN Mask                    */
#define DDR_CR11_TREFEN_SHIFT                    (24U)                                               /*!< DDR_CR11.TREFEN Position                */
#define DDR_CR11_TREFEN(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DDR_CR11.TREFEN Field                   */
/* ------- CR12 Bit Fields                          ------ */
#define DDR_CR12_TRFC_MASK                       (0x3FFU)                                            /*!< DDR_CR12.TRFC Mask                      */
#define DDR_CR12_TRFC_SHIFT                      (0U)                                                /*!< DDR_CR12.TRFC Position                  */
#define DDR_CR12_TRFC(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFUL)         /*!< DDR_CR12.TRFC Field                     */
#define DDR_CR12_TREF_MASK                       (0x3FFF0000U)                                       /*!< DDR_CR12.TREF Mask                      */
#define DDR_CR12_TREF_SHIFT                      (16U)                                               /*!< DDR_CR12.TREF Position                  */
#define DDR_CR12_TREF(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0x3FFF0000UL)   /*!< DDR_CR12.TREF Field                     */
/* ------- CR13 Bit Fields                          ------ */
#define DDR_CR13_TREFINT_MASK                    (0x3FFFU)                                           /*!< DDR_CR13.TREFINT Mask                   */
#define DDR_CR13_TREFINT_SHIFT                   (0U)                                                /*!< DDR_CR13.TREFINT Position               */
#define DDR_CR13_TREFINT(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFFUL)        /*!< DDR_CR13.TREFINT Field                  */
#define DDR_CR13_PD_MASK                         (0x10000U)                                          /*!< DDR_CR13.PD Mask                        */
#define DDR_CR13_PD_SHIFT                        (16U)                                               /*!< DDR_CR13.PD Position                    */
#define DDR_CR13_PD(x)                           (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DDR_CR13.PD Field                       */
/* ------- CR14 Bit Fields                          ------ */
#define DDR_CR14_TPDEX_MASK                      (0xFFFFU)                                           /*!< DDR_CR14.TPDEX Mask                     */
#define DDR_CR14_TPDEX_SHIFT                     (0U)                                                /*!< DDR_CR14.TPDEX Position                 */
#define DDR_CR14_TPDEX(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR14.TPDEX Field                    */
#define DDR_CR14_TXSR_MASK                       (0xFFFF0000U)                                       /*!< DDR_CR14.TXSR Mask                      */
#define DDR_CR14_TXSR_SHIFT                      (16U)                                               /*!< DDR_CR14.TXSR Position                  */
#define DDR_CR14_TXSR(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< DDR_CR14.TXSR Field                     */
/* ------- CR15 Bit Fields                          ------ */
#define DDR_CR15_TXSNR_MASK                      (0xFFFFU)                                           /*!< DDR_CR15.TXSNR Mask                     */
#define DDR_CR15_TXSNR_SHIFT                     (0U)                                                /*!< DDR_CR15.TXSNR Position                 */
#define DDR_CR15_TXSNR(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR15.TXSNR Field                    */
#define DDR_CR15_SREF_MASK                       (0x10000U)                                          /*!< DDR_CR15.SREF Mask                      */
#define DDR_CR15_SREF_SHIFT                      (16U)                                               /*!< DDR_CR15.SREF Position                  */
#define DDR_CR15_SREF(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DDR_CR15.SREF Field                     */
#define DDR_CR15_PUREF_MASK                      (0x1000000U)                                        /*!< DDR_CR15.PUREF Mask                     */
#define DDR_CR15_PUREF_SHIFT                     (24U)                                               /*!< DDR_CR15.PUREF Position                 */
#define DDR_CR15_PUREF(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DDR_CR15.PUREF Field                    */
/* ------- CR16 Bit Fields                          ------ */
#define DDR_CR16_QKREF_MASK                      (0x1U)                                              /*!< DDR_CR16.QKREF Mask                     */
#define DDR_CR16_QKREF_SHIFT                     (0U)                                                /*!< DDR_CR16.QKREF Position                 */
#define DDR_CR16_QKREF(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DDR_CR16.QKREF Field                    */
