podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define DDR_CR16_CLKDLY_MASK                     (0x700U)                                            /*!< DDR_CR16.CLKDLY Mask                    */
#define DDR_CR16_CLKDLY_SHIFT                    (8U)                                                /*!< DDR_CR16.CLKDLY Position                */
#define DDR_CR16_CLKDLY(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0x700UL)         /*!< DDR_CR16.CLKDLY Field                   */
#define DDR_CR16_LPCTRL_MASK                     (0x1F0000U)                                         /*!< DDR_CR16.LPCTRL Mask                    */
#define DDR_CR16_LPCTRL_SHIFT                    (16U)                                               /*!< DDR_CR16.LPCTRL Position                */
#define DDR_CR16_LPCTRL(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x1F0000UL)     /*!< DDR_CR16.LPCTRL Field                   */
/* ------- CR17 Bit Fields                          ------ */
#define DDR_CR17_LPPDCNT_MASK                    (0xFFFFU)                                           /*!< DDR_CR17.LPPDCNT Mask                   */
#define DDR_CR17_LPPDCNT_SHIFT                   (0U)                                                /*!< DDR_CR17.LPPDCNT Position               */
#define DDR_CR17_LPPDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR17.LPPDCNT Field                  */
#define DDR_CR17_LPRFCNT_MASK                    (0xFFFF0000U)                                       /*!< DDR_CR17.LPRFCNT Mask                   */
#define DDR_CR17_LPRFCNT_SHIFT                   (16U)                                               /*!< DDR_CR17.LPRFCNT Position               */
#define DDR_CR17_LPRFCNT(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< DDR_CR17.LPRFCNT Field                  */
/* ------- CR18 Bit Fields                          ------ */
#define DDR_CR18_LPEXTCNT_MASK                   (0xFFFFU)                                           /*!< DDR_CR18.LPEXTCNT Mask                  */
#define DDR_CR18_LPEXTCNT_SHIFT                  (0U)                                                /*!< DDR_CR18.LPEXTCNT Position              */
#define DDR_CR18_LPEXTCNT(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR18.LPEXTCNT Field                 */
#define DDR_CR18_LPAUTO_MASK                     (0x1F0000U)                                         /*!< DDR_CR18.LPAUTO Mask                    */
#define DDR_CR18_LPAUTO_SHIFT                    (16U)                                               /*!< DDR_CR18.LPAUTO Position                */
#define DDR_CR18_LPAUTO(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x1F0000UL)     /*!< DDR_CR18.LPAUTO Field                   */
/* ------- CR19 Bit Fields                          ------ */
#define DDR_CR19_LPINTCNT_MASK                   (0xFFFFU)                                           /*!< DDR_CR19.LPINTCNT Mask                  */
#define DDR_CR19_LPINTCNT_SHIFT                  (0U)                                                /*!< DDR_CR19.LPINTCNT Position              */
#define DDR_CR19_LPINTCNT(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR19.LPINTCNT Field                 */
#define DDR_CR19_LPRFHOLD_MASK                   (0xFFFF0000U)                                       /*!< DDR_CR19.LPRFHOLD Mask                  */
#define DDR_CR19_LPRFHOLD_SHIFT                  (16U)                                               /*!< DDR_CR19.LPRFHOLD Position              */
#define DDR_CR19_LPRFHOLD(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< DDR_CR19.LPRFHOLD Field                 */
/* ------- CR20 Bit Fields                          ------ */
#define DDR_CR20_LPRE_MASK                       (0x3U)                                              /*!< DDR_CR20.LPRE Mask                      */
#define DDR_CR20_LPRE_SHIFT                      (0U)                                                /*!< DDR_CR20.LPRE Position                  */
#define DDR_CR20_LPRE(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< DDR_CR20.LPRE Field                     */
#define DDR_CR20_CKSRE_MASK                      (0xF00U)                                            /*!< DDR_CR20.CKSRE Mask                     */
#define DDR_CR20_CKSRE_SHIFT                     (8U)                                                /*!< DDR_CR20.CKSRE Position                 */
#define DDR_CR20_CKSRE(x)                        (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< DDR_CR20.CKSRE Field                    */
#define DDR_CR20_CKSRX_MASK                      (0xF0000U)                                          /*!< DDR_CR20.CKSRX Mask                     */
#define DDR_CR20_CKSRX_SHIFT                     (16U)                                               /*!< DDR_CR20.CKSRX Position                 */
#define DDR_CR20_CKSRX(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< DDR_CR20.CKSRX Field                    */
#define DDR_CR20_WRMD_MASK                       (0x1000000U)                                        /*!< DDR_CR20.WRMD Mask                      */
#define DDR_CR20_WRMD_SHIFT                      (24U)                                               /*!< DDR_CR20.WRMD Position                  */
#define DDR_CR20_WRMD(x)                         (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DDR_CR20.WRMD Field                     */
/* ------- CR21 Bit Fields                          ------ */
#define DDR_CR21_MR0DAT0_MASK                    (0xFFFFU)                                           /*!< DDR_CR21.MR0DAT0 Mask                   */
#define DDR_CR21_MR0DAT0_SHIFT                   (0U)                                                /*!< DDR_CR21.MR0DAT0 Position               */
#define DDR_CR21_MR0DAT0(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR21.MR0DAT0 Field                  */
#define DDR_CR21_MR1DAT0_MASK                    (0xFFFF0000U)                                       /*!< DDR_CR21.MR1DAT0 Mask                   */
#define DDR_CR21_MR1DAT0_SHIFT                   (16U)                                               /*!< DDR_CR21.MR1DAT0 Position               */
#define DDR_CR21_MR1DAT0(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< DDR_CR21.MR1DAT0 Field                  */
/* ------- CR22 Bit Fields                          ------ */
#define DDR_CR22_MR2DATA0_MASK                   (0xFFFFU)                                           /*!< DDR_CR22.MR2DATA0 Mask                  */
#define DDR_CR22_MR2DATA0_SHIFT                  (0U)                                                /*!< DDR_CR22.MR2DATA0 Position              */
#define DDR_CR22_MR2DATA0(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR22.MR2DATA0 Field                 */
#define DDR_CR22_MR3DAT0_MASK                    (0xFFFF0000U)                                       /*!< DDR_CR22.MR3DAT0 Mask                   */
#define DDR_CR22_MR3DAT0_SHIFT                   (16U)                                               /*!< DDR_CR22.MR3DAT0 Position               */
#define DDR_CR22_MR3DAT0(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< DDR_CR22.MR3DAT0 Field                  */
/* ------- CR23 Bit Fields                          ------ */
#define DDR_CR23_Not_Used_MASK                   (0xFFFFU)                                           /*!< DDR_CR23.Not_Used Mask                  */
#define DDR_CR23_Not_Used_SHIFT                  (0U)                                                /*!< DDR_CR23.Not_Used Position              */
#define DDR_CR23_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR23.Not_Used Field                 */
#define DDR_CR23_NOT_USED_MASK                   (0xFFFF0000U)                                       /*!< DDR_CR23.NOT_USED Mask                  */
#define DDR_CR23_NOT_USED_SHIFT                  (16U)                                               /*!< DDR_CR23.NOT_USED Position              */
#define DDR_CR23_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< DDR_CR23.NOT_USED Field                 */
/* ------- CR24 Bit Fields                          ------ */
/* ------- CR25 Bit Fields                          ------ */
#define DDR_CR25_BNK8_MASK                       (0x1U)                                              /*!< DDR_CR25.BNK8 Mask                      */
#define DDR_CR25_BNK8_SHIFT                      (0U)                                                /*!< DDR_CR25.BNK8 Position                  */
#define DDR_CR25_BNK8(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DDR_CR25.BNK8 Field                     */
#define DDR_CR25_ADDPINS_MASK                    (0x700U)                                            /*!< DDR_CR25.ADDPINS Mask                   */
#define DDR_CR25_ADDPINS_SHIFT                   (8U)                                                /*!< DDR_CR25.ADDPINS Position               */
#define DDR_CR25_ADDPINS(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x700UL)         /*!< DDR_CR25.ADDPINS Field                  */
#define DDR_CR25_COLSIZ_MASK                     (0x70000U)                                          /*!< DDR_CR25.COLSIZ Mask                    */
#define DDR_CR25_COLSIZ_SHIFT                    (16U)                                               /*!< DDR_CR25.COLSIZ Position                */
#define DDR_CR25_COLSIZ(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x70000UL)      /*!< DDR_CR25.COLSIZ Field                   */
#define DDR_CR25_APREBIT_MASK                    (0xF000000U)                                        /*!< DDR_CR25.APREBIT Mask                   */
#define DDR_CR25_APREBIT_SHIFT                   (24U)                                               /*!< DDR_CR25.APREBIT Position               */
#define DDR_CR25_APREBIT(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< DDR_CR25.APREBIT Field                  */
/* ------- CR26 Bit Fields                          ------ */
#define DDR_CR26_AGECNT_MASK                     (0xFFU)                                             /*!< DDR_CR26.AGECNT Mask                    */
#define DDR_CR26_AGECNT_SHIFT                    (0U)                                                /*!< DDR_CR26.AGECNT Position                */
#define DDR_CR26_AGECNT(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< DDR_CR26.AGECNT Field                   */
#define DDR_CR26_CMDAGE_MASK                     (0xFF00U)                                           /*!< DDR_CR26.CMDAGE Mask                    */
#define DDR_CR26_CMDAGE_SHIFT                    (8U)                                                /*!< DDR_CR26.CMDAGE Position                */
#define DDR_CR26_CMDAGE(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< DDR_CR26.CMDAGE Field                   */
#define DDR_CR26_ADDCOL_MASK                     (0x10000U)                                          /*!< DDR_CR26.ADDCOL Mask                    */
#define DDR_CR26_ADDCOL_SHIFT                    (16U)                                               /*!< DDR_CR26.ADDCOL Position                */
#define DDR_CR26_ADDCOL(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DDR_CR26.ADDCOL Field                   */
#define DDR_CR26_BNKSPT_MASK                     (0x1000000U)                                        /*!< DDR_CR26.BNKSPT Mask                    */
#define DDR_CR26_BNKSPT_SHIFT                    (24U)                                               /*!< DDR_CR26.BNKSPT Position                */
#define DDR_CR26_BNKSPT(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DDR_CR26.BNKSPT Field                   */
/* ------- CR27 Bit Fields                          ------ */
#define DDR_CR27_PLEN_MASK                       (0x1U)                                              /*!< DDR_CR27.PLEN Mask                      */
#define DDR_CR27_PLEN_SHIFT                      (0U)                                                /*!< DDR_CR27.PLEN Position                  */
#define DDR_CR27_PLEN(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DDR_CR27.PLEN Field                     */
#define DDR_CR27_PRIEN_MASK                      (0x100U)                                            /*!< DDR_CR27.PRIEN Mask                     */
#define DDR_CR27_PRIEN_SHIFT                     (8U)                                                /*!< DDR_CR27.PRIEN Position                 */
#define DDR_CR27_PRIEN(x)                        (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< DDR_CR27.PRIEN Field                    */
#define DDR_CR27_RWEN_MASK                       (0x10000U)                                          /*!< DDR_CR27.RWEN Mask                      */
#define DDR_CR27_RWEN_SHIFT                      (16U)                                               /*!< DDR_CR27.RWEN Position                  */
#define DDR_CR27_RWEN(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DDR_CR27.RWEN Field                     */
#define DDR_CR27_SWPEN_MASK                      (0x1000000U)                                        /*!< DDR_CR27.SWPEN Mask                     */
#define DDR_CR27_SWPEN_SHIFT                     (24U)                                               /*!< DDR_CR27.SWPEN Position                 */
#define DDR_CR27_SWPEN(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DDR_CR27.SWPEN Field                    */
/* ------- CR28 Bit Fields                          ------ */
#define DDR_CR28_CSMAP_MASK                      (0x1U)                                              /*!< DDR_CR28.CSMAP Mask                     */
#define DDR_CR28_CSMAP_SHIFT                     (0U)                                                /*!< DDR_CR28.CSMAP Position                 */
#define DDR_CR28_CSMAP(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DDR_CR28.CSMAP Field                    */
#define DDR_CR28_REDUC_MASK                      (0x100U)                                            /*!< DDR_CR28.REDUC Mask                     */
#define DDR_CR28_REDUC_SHIFT                     (8U)                                                /*!< DDR_CR28.REDUC Position                 */
#define DDR_CR28_REDUC(x)                        (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< DDR_CR28.REDUC Field                    */
#define DDR_CR28_BIGEND_MASK                     (0x10000U)                                          /*!< DDR_CR28.BIGEND Mask                    */
#define DDR_CR28_BIGEND_SHIFT                    (16U)                                               /*!< DDR_CR28.BIGEND Position                */
#define DDR_CR28_BIGEND(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DDR_CR28.BIGEND Field                   */
#define DDR_CR28_CMDLATR_MASK                    (0x1000000U)                                        /*!< DDR_CR28.CMDLATR Mask                   */
#define DDR_CR28_CMDLATR_SHIFT                   (24U)                                               /*!< DDR_CR28.CMDLATR Position               */
#define DDR_CR28_CMDLATR(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DDR_CR28.CMDLATR Field                  */
/* ------- CR29 Bit Fields                          ------ */
#define DDR_CR29_WRLATR_MASK                     (0x1U)                                              /*!< DDR_CR29.WRLATR Mask                    */
#define DDR_CR29_WRLATR_SHIFT                    (0U)                                                /*!< DDR_CR29.WRLATR Position                */
#define DDR_CR29_WRLATR(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DDR_CR29.WRLATR Field                   */
#define DDR_CR29_FSTWR_MASK                      (0x100U)                                            /*!< DDR_CR29.FSTWR Mask                     */
#define DDR_CR29_FSTWR_SHIFT                     (8U)                                                /*!< DDR_CR29.FSTWR Position                 */
#define DDR_CR29_FSTWR(x)                        (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< DDR_CR29.FSTWR Field                    */
#define DDR_CR29_QFULL_MASK                      (0x30000U)                                          /*!< DDR_CR29.QFULL Mask                     */
#define DDR_CR29_QFULL_SHIFT                     (16U)                                               /*!< DDR_CR29.QFULL Position                 */
#define DDR_CR29_QFULL(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< DDR_CR29.QFULL Field                    */
#define DDR_CR29_RESYNC_MASK                     (0x1000000U)                                        /*!< DDR_CR29.RESYNC Mask                    */
#define DDR_CR29_RESYNC_SHIFT                    (24U)                                               /*!< DDR_CR29.RESYNC Position                */
#define DDR_CR29_RESYNC(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DDR_CR29.RESYNC Field                   */
/* ------- CR30 Bit Fields                          ------ */
#define DDR_CR30_RSYNCRF_MASK                    (0x1U)                                              /*!< DDR_CR30.RSYNCRF Mask                   */
#define DDR_CR30_RSYNCRF_SHIFT                   (0U)                                                /*!< DDR_CR30.RSYNCRF Position               */
#define DDR_CR30_RSYNCRF(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DDR_CR30.RSYNCRF Field                  */
#define DDR_CR30_INTSTAT_MASK                    (0x1FF00U)                                          /*!< DDR_CR30.INTSTAT Mask                   */
#define DDR_CR30_INTSTAT_SHIFT                   (8U)                                                /*!< DDR_CR30.INTSTAT Position               */
#define DDR_CR30_INTSTAT(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x1FF00UL)       /*!< DDR_CR30.INTSTAT Field                  */
#define DDR_CR30_INTACK_MASK                     (0xFF000000U)                                       /*!< DDR_CR30.INTACK Mask                    */
#define DDR_CR30_INTACK_SHIFT                    (24U)                                               /*!< DDR_CR30.INTACK Position                */
#define DDR_CR30_INTACK(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< DDR_CR30.INTACK Field                   */
/* ------- CR31 Bit Fields                          ------ */
#define DDR_CR31_INTMASK_MASK                    (0x1FFU)                                            /*!< DDR_CR31.INTMASK Mask                   */
#define DDR_CR31_INTMASK_SHIFT                   (0U)                                                /*!< DDR_CR31.INTMASK Position               */
#define DDR_CR31_INTMASK(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1FFUL)         /*!< DDR_CR31.INTMASK Field                  */
/* ------- CR32 Bit Fields                          ------ */
#define DDR_CR32_OORAD_MASK                      (0xFFFFFFFFU)                                       /*!< DDR_CR32.OORAD Mask                     */
#define DDR_CR32_OORAD_SHIFT                     (0U)                                                /*!< DDR_CR32.OORAD Position                 */
#define DDR_CR32_OORAD(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< DDR_CR32.OORAD Field                    */
/* ------- CR33 Bit Fields                          ------ */
#define DDR_CR33_OORLEN_MASK                     (0x3FFU)                                            /*!< DDR_CR33.OORLEN Mask                    */
#define DDR_CR33_OORLEN_SHIFT                    (0U)                                                /*!< DDR_CR33.OORLEN Position                */
#define DDR_CR33_OORLEN(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFUL)         /*!< DDR_CR33.OORLEN Field                   */
#define DDR_CR33_OORTYP_MASK                     (0x3F0000U)                                         /*!< DDR_CR33.OORTYP Mask                    */
#define DDR_CR33_OORTYP_SHIFT                    (16U)                                               /*!< DDR_CR33.OORTYP Position                */
#define DDR_CR33_OORTYP(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x3F0000UL)     /*!< DDR_CR33.OORTYP Field                   */
#define DDR_CR33_OORID_MASK                      (0x3000000U)                                        /*!< DDR_CR33.OORID Mask                     */
#define DDR_CR33_OORID_SHIFT                     (24U)                                               /*!< DDR_CR33.OORID Position                 */
#define DDR_CR33_OORID(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< DDR_CR33.OORID Field                    */
/* ------- CR34 Bit Fields                          ------ */
#define DDR_CR34_ODTRDC_MASK                     (0x1U)                                              /*!< DDR_CR34.ODTRDC Mask                    */
#define DDR_CR34_ODTRDC_SHIFT                    (0U)                                                /*!< DDR_CR34.ODTRDC Position                */
#define DDR_CR34_ODTRDC(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DDR_CR34.ODTRDC Field                   */
#define DDR_CR34_ODTWRCS_MASK                    (0x100U)                                            /*!< DDR_CR34.ODTWRCS Mask                   */
#define DDR_CR34_ODTWRCS_SHIFT                   (8U)                                                /*!< DDR_CR34.ODTWRCS Position               */
#define DDR_CR34_ODTWRCS(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< DDR_CR34.ODTWRCS Field                  */
/* ------- CR35 Bit Fields                          ------ */
#define DDR_CR35_R2WSMCS_MASK                    (0xFU)                                              /*!< DDR_CR35.R2WSMCS Mask                   */
#define DDR_CR35_R2WSMCS_SHIFT                   (0U)                                                /*!< DDR_CR35.R2WSMCS Position               */
#define DDR_CR35_R2WSMCS(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< DDR_CR35.R2WSMCS Field                  */
#define DDR_CR35_W2RSMCS_MASK                    (0xF00U)                                            /*!< DDR_CR35.W2RSMCS Mask                   */
#define DDR_CR35_W2RSMCS_SHIFT                   (8U)                                                /*!< DDR_CR35.W2RSMCS Position               */
#define DDR_CR35_W2RSMCS(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< DDR_CR35.W2RSMCS Field                  */
/* ------- CR36 Bit Fields                          ------ */
#define DDR_CR36_Not_Used_MASK                   (0xFFFFU)                                           /*!< DDR_CR36.Not_Used Mask                  */
#define DDR_CR36_Not_Used_SHIFT                  (0U)                                                /*!< DDR_CR36.Not_Used Position              */
