podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define DDR_CR36_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR36.Not_Used Field                 */
#define DDR_CR36_NOT_USED_MASK                   (0xFFFF0000U)                                       /*!< DDR_CR36.NOT_USED Mask                  */
#define DDR_CR36_NOT_USED_SHIFT                  (16U)                                               /*!< DDR_CR36.NOT_USED Position              */
#define DDR_CR36_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< DDR_CR36.NOT_USED Field                 */
/* ------- CR37 Bit Fields                          ------ */
#define DDR_CR37_R2RSAME_MASK                    (0x7U)                                              /*!< DDR_CR37.R2RSAME Mask                   */
#define DDR_CR37_R2RSAME_SHIFT                   (0U)                                                /*!< DDR_CR37.R2RSAME Position               */
#define DDR_CR37_R2RSAME(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< DDR_CR37.R2RSAME Field                  */
#define DDR_CR37_R2WSAME_MASK                    (0x700U)                                            /*!< DDR_CR37.R2WSAME Mask                   */
#define DDR_CR37_R2WSAME_SHIFT                   (8U)                                                /*!< DDR_CR37.R2WSAME Position               */
#define DDR_CR37_R2WSAME(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x700UL)         /*!< DDR_CR37.R2WSAME Field                  */
#define DDR_CR37_W2RSAME_MASK                    (0x70000U)                                          /*!< DDR_CR37.W2RSAME Mask                   */
#define DDR_CR37_W2RSAME_SHIFT                   (16U)                                               /*!< DDR_CR37.W2RSAME Position               */
#define DDR_CR37_W2RSAME(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0x70000UL)      /*!< DDR_CR37.W2RSAME Field                  */
#define DDR_CR37_W2WSAME_MASK                    (0x7000000U)                                        /*!< DDR_CR37.W2WSAME Mask                   */
#define DDR_CR37_W2WSAME_SHIFT                   (24U)                                               /*!< DDR_CR37.W2WSAME Position               */
#define DDR_CR37_W2WSAME(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0x7000000UL)    /*!< DDR_CR37.W2WSAME Field                  */
/* ------- CR38 Bit Fields                          ------ */
#define DDR_CR38_PDNCS_MASK                      (0x1FU)                                             /*!< DDR_CR38.PDNCS Mask                     */
#define DDR_CR38_PDNCS_SHIFT                     (0U)                                                /*!< DDR_CR38.PDNCS Position                 */
#define DDR_CR38_PDNCS(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x1FUL)          /*!< DDR_CR38.PDNCS Field                    */
#define DDR_CR38_PUPCS_MASK                      (0x1F00U)                                           /*!< DDR_CR38.PUPCS Mask                     */
#define DDR_CR38_PUPCS_SHIFT                     (8U)                                                /*!< DDR_CR38.PUPCS Position                 */
#define DDR_CR38_PUPCS(x)                        (((uint32_t)(((uint32_t)(x))<<8U))&0x1F00UL)        /*!< DDR_CR38.PUPCS Field                    */
#define DDR_CR38_PWRCNT_MASK                     (0x7FF0000U)                                        /*!< DDR_CR38.PWRCNT Mask                    */
#define DDR_CR38_PWRCNT_SHIFT                    (16U)                                               /*!< DDR_CR38.PWRCNT Position                */
#define DDR_CR38_PWRCNT(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x7FF0000UL)    /*!< DDR_CR38.PWRCNT Field                   */
/* ------- CR39 Bit Fields                          ------ */
#define DDR_CR39_P0RDCNT_MASK                    (0x7FFU)                                            /*!< DDR_CR39.P0RDCNT Mask                   */
#define DDR_CR39_P0RDCNT_SHIFT                   (0U)                                                /*!< DDR_CR39.P0RDCNT Position               */
#define DDR_CR39_P0RDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x7FFUL)         /*!< DDR_CR39.P0RDCNT Field                  */
#define DDR_CR39_RP0_MASK                        (0x30000U)                                          /*!< DDR_CR39.RP0 Mask                       */
#define DDR_CR39_RP0_SHIFT                       (16U)                                               /*!< DDR_CR39.RP0 Position                   */
#define DDR_CR39_RP0(x)                          (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< DDR_CR39.RP0 Field                      */
#define DDR_CR39_WP0_MASK                        (0x3000000U)                                        /*!< DDR_CR39.WP0 Mask                       */
#define DDR_CR39_WP0_SHIFT                       (24U)                                               /*!< DDR_CR39.WP0 Position                   */
#define DDR_CR39_WP0(x)                          (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< DDR_CR39.WP0 Field                      */
/* ------- CR40 Bit Fields                          ------ */
#define DDR_CR40_P0TYP_MASK                      (0x3U)                                              /*!< DDR_CR40.P0TYP Mask                     */
#define DDR_CR40_P0TYP_SHIFT                     (0U)                                                /*!< DDR_CR40.P0TYP Position                 */
#define DDR_CR40_P0TYP(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< DDR_CR40.P0TYP Field                    */
#define DDR_CR40_P1WRCNT_MASK                    (0x7FF00U)                                          /*!< DDR_CR40.P1WRCNT Mask                   */
#define DDR_CR40_P1WRCNT_SHIFT                   (8U)                                                /*!< DDR_CR40.P1WRCNT Position               */
#define DDR_CR40_P1WRCNT(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x7FF00UL)       /*!< DDR_CR40.P1WRCNT Field                  */
/* ------- CR41 Bit Fields                          ------ */
#define DDR_CR41_P1RDCNT_MASK                    (0x7FFU)                                            /*!< DDR_CR41.P1RDCNT Mask                   */
#define DDR_CR41_P1RDCNT_SHIFT                   (0U)                                                /*!< DDR_CR41.P1RDCNT Position               */
#define DDR_CR41_P1RDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x7FFUL)         /*!< DDR_CR41.P1RDCNT Field                  */
#define DDR_CR41_RP1_MASK                        (0x30000U)                                          /*!< DDR_CR41.RP1 Mask                       */
#define DDR_CR41_RP1_SHIFT                       (16U)                                               /*!< DDR_CR41.RP1 Position                   */
#define DDR_CR41_RP1(x)                          (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< DDR_CR41.RP1 Field                      */
#define DDR_CR41_WP1_MASK                        (0x3000000U)                                        /*!< DDR_CR41.WP1 Mask                       */
#define DDR_CR41_WP1_SHIFT                       (24U)                                               /*!< DDR_CR41.WP1 Position                   */
#define DDR_CR41_WP1(x)                          (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< DDR_CR41.WP1 Field                      */
/* ------- CR42 Bit Fields                          ------ */
#define DDR_CR42_P1TYP_MASK                      (0x3U)                                              /*!< DDR_CR42.P1TYP Mask                     */
#define DDR_CR42_P1TYP_SHIFT                     (0U)                                                /*!< DDR_CR42.P1TYP Position                 */
#define DDR_CR42_P1TYP(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< DDR_CR42.P1TYP Field                    */
#define DDR_CR42_P2WRCNT_MASK                    (0x7FF00U)                                          /*!< DDR_CR42.P2WRCNT Mask                   */
#define DDR_CR42_P2WRCNT_SHIFT                   (8U)                                                /*!< DDR_CR42.P2WRCNT Position               */
#define DDR_CR42_P2WRCNT(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x7FF00UL)       /*!< DDR_CR42.P2WRCNT Field                  */
/* ------- CR43 Bit Fields                          ------ */
#define DDR_CR43_P2RDCNT_MASK                    (0x7FFU)                                            /*!< DDR_CR43.P2RDCNT Mask                   */
#define DDR_CR43_P2RDCNT_SHIFT                   (0U)                                                /*!< DDR_CR43.P2RDCNT Position               */
#define DDR_CR43_P2RDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x7FFUL)         /*!< DDR_CR43.P2RDCNT Field                  */
#define DDR_CR43_RP2_MASK                        (0x30000U)                                          /*!< DDR_CR43.RP2 Mask                       */
#define DDR_CR43_RP2_SHIFT                       (16U)                                               /*!< DDR_CR43.RP2 Position                   */
#define DDR_CR43_RP2(x)                          (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< DDR_CR43.RP2 Field                      */
#define DDR_CR43_WP2_MASK                        (0x3000000U)                                        /*!< DDR_CR43.WP2 Mask                       */
#define DDR_CR43_WP2_SHIFT                       (24U)                                               /*!< DDR_CR43.WP2 Position                   */
#define DDR_CR43_WP2(x)                          (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< DDR_CR43.WP2 Field                      */
/* ------- CR44 Bit Fields                          ------ */
#define DDR_CR44_P2TYP_MASK                      (0x3U)                                              /*!< DDR_CR44.P2TYP Mask                     */
#define DDR_CR44_P2TYP_SHIFT                     (0U)                                                /*!< DDR_CR44.P2TYP Position                 */
#define DDR_CR44_P2TYP(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< DDR_CR44.P2TYP Field                    */
#define DDR_CR44_WRRLAT_MASK                     (0x100U)                                            /*!< DDR_CR44.WRRLAT Mask                    */
#define DDR_CR44_WRRLAT_SHIFT                    (8U)                                                /*!< DDR_CR44.WRRLAT Position                */
#define DDR_CR44_WRRLAT(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< DDR_CR44.WRRLAT Field                   */
#define DDR_CR44_WRRSHARE_MASK                   (0x10000U)                                          /*!< DDR_CR44.WRRSHARE Mask                  */
#define DDR_CR44_WRRSHARE_SHIFT                  (16U)                                               /*!< DDR_CR44.WRRSHARE Position              */
#define DDR_CR44_WRRSHARE(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DDR_CR44.WRRSHARE Field                 */
#define DDR_CR44_WRRERR_MASK                     (0xF000000U)                                        /*!< DDR_CR44.WRRERR Mask                    */
#define DDR_CR44_WRRERR_SHIFT                    (24U)                                               /*!< DDR_CR44.WRRERR Position                */
#define DDR_CR44_WRRERR(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< DDR_CR44.WRRERR Field                   */
/* ------- CR45 Bit Fields                          ------ */
#define DDR_CR45_P0PRI0_MASK                     (0xFU)                                              /*!< DDR_CR45.P0PRI0 Mask                    */
#define DDR_CR45_P0PRI0_SHIFT                    (0U)                                                /*!< DDR_CR45.P0PRI0 Position                */
#define DDR_CR45_P0PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< DDR_CR45.P0PRI0 Field                   */
#define DDR_CR45_P0PRI1_MASK                     (0xF00U)                                            /*!< DDR_CR45.P0PRI1 Mask                    */
#define DDR_CR45_P0PRI1_SHIFT                    (8U)                                                /*!< DDR_CR45.P0PRI1 Position                */
#define DDR_CR45_P0PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< DDR_CR45.P0PRI1 Field                   */
#define DDR_CR45_P0PRI2_MASK                     (0xF0000U)                                          /*!< DDR_CR45.P0PRI2 Mask                    */
#define DDR_CR45_P0PRI2_SHIFT                    (16U)                                               /*!< DDR_CR45.P0PRI2 Position                */
#define DDR_CR45_P0PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< DDR_CR45.P0PRI2 Field                   */
#define DDR_CR45_P0PRI3_MASK                     (0xF000000U)                                        /*!< DDR_CR45.P0PRI3 Mask                    */
#define DDR_CR45_P0PRI3_SHIFT                    (24U)                                               /*!< DDR_CR45.P0PRI3 Position                */
#define DDR_CR45_P0PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< DDR_CR45.P0PRI3 Field                   */
/* ------- CR46 Bit Fields                          ------ */
#define DDR_CR46_P0ORD_MASK                      (0x3U)                                              /*!< DDR_CR46.P0ORD Mask                     */
#define DDR_CR46_P0ORD_SHIFT                     (0U)                                                /*!< DDR_CR46.P0ORD Position                 */
#define DDR_CR46_P0ORD(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< DDR_CR46.P0ORD Field                    */
#define DDR_CR46_P0PRIRLX_MASK                   (0x3FF00U)                                          /*!< DDR_CR46.P0PRIRLX Mask                  */
#define DDR_CR46_P0PRIRLX_SHIFT                  (8U)                                                /*!< DDR_CR46.P0PRIRLX Position              */
#define DDR_CR46_P0PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<8U))&0x3FF00UL)       /*!< DDR_CR46.P0PRIRLX Field                 */
#define DDR_CR46_P1PRI0_MASK                     (0xF000000U)                                        /*!< DDR_CR46.P1PRI0 Mask                    */
#define DDR_CR46_P1PRI0_SHIFT                    (24U)                                               /*!< DDR_CR46.P1PRI0 Position                */
#define DDR_CR46_P1PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< DDR_CR46.P1PRI0 Field                   */
/* ------- CR47 Bit Fields                          ------ */
#define DDR_CR47_P1PRI1_MASK                     (0xFU)                                              /*!< DDR_CR47.P1PRI1 Mask                    */
#define DDR_CR47_P1PRI1_SHIFT                    (0U)                                                /*!< DDR_CR47.P1PRI1 Position                */
#define DDR_CR47_P1PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< DDR_CR47.P1PRI1 Field                   */
#define DDR_CR47_P1PRI2_MASK                     (0xF00U)                                            /*!< DDR_CR47.P1PRI2 Mask                    */
#define DDR_CR47_P1PRI2_SHIFT                    (8U)                                                /*!< DDR_CR47.P1PRI2 Position                */
#define DDR_CR47_P1PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< DDR_CR47.P1PRI2 Field                   */
#define DDR_CR47_P1PRI3_MASK                     (0xF0000U)                                          /*!< DDR_CR47.P1PRI3 Mask                    */
#define DDR_CR47_P1PRI3_SHIFT                    (16U)                                               /*!< DDR_CR47.P1PRI3 Position                */
#define DDR_CR47_P1PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< DDR_CR47.P1PRI3 Field                   */
#define DDR_CR47_P1ORD_MASK                      (0x3000000U)                                        /*!< DDR_CR47.P1ORD Mask                     */
#define DDR_CR47_P1ORD_SHIFT                     (24U)                                               /*!< DDR_CR47.P1ORD Position                 */
#define DDR_CR47_P1ORD(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< DDR_CR47.P1ORD Field                    */
/* ------- CR48 Bit Fields                          ------ */
#define DDR_CR48_P1PRIRLX_MASK                   (0x3FFU)                                            /*!< DDR_CR48.P1PRIRLX Mask                  */
#define DDR_CR48_P1PRIRLX_SHIFT                  (0U)                                                /*!< DDR_CR48.P1PRIRLX Position              */
#define DDR_CR48_P1PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFUL)         /*!< DDR_CR48.P1PRIRLX Field                 */
#define DDR_CR48_P2PRI0_MASK                     (0xF0000U)                                          /*!< DDR_CR48.P2PRI0 Mask                    */
#define DDR_CR48_P2PRI0_SHIFT                    (16U)                                               /*!< DDR_CR48.P2PRI0 Position                */
#define DDR_CR48_P2PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< DDR_CR48.P2PRI0 Field                   */
#define DDR_CR48_P2PRI1_MASK                     (0xF000000U)                                        /*!< DDR_CR48.P2PRI1 Mask                    */
#define DDR_CR48_P2PRI1_SHIFT                    (24U)                                               /*!< DDR_CR48.P2PRI1 Position                */
#define DDR_CR48_P2PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< DDR_CR48.P2PRI1 Field                   */
/* ------- CR49 Bit Fields                          ------ */
#define DDR_CR49_P2PRI2_MASK                     (0xFU)                                              /*!< DDR_CR49.P2PRI2 Mask                    */
#define DDR_CR49_P2PRI2_SHIFT                    (0U)                                                /*!< DDR_CR49.P2PRI2 Position                */
#define DDR_CR49_P2PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< DDR_CR49.P2PRI2 Field                   */
#define DDR_CR49_P2PRI3_MASK                     (0xF00U)                                            /*!< DDR_CR49.P2PRI3 Mask                    */
#define DDR_CR49_P2PRI3_SHIFT                    (8U)                                                /*!< DDR_CR49.P2PRI3 Position                */
#define DDR_CR49_P2PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< DDR_CR49.P2PRI3 Field                   */
#define DDR_CR49_P2ORD_MASK                      (0x30000U)                                          /*!< DDR_CR49.P2ORD Mask                     */
#define DDR_CR49_P2ORD_SHIFT                     (16U)                                               /*!< DDR_CR49.P2ORD Position                 */
#define DDR_CR49_P2ORD(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< DDR_CR49.P2ORD Field                    */
/* ------- CR50 Bit Fields                          ------ */
#define DDR_CR50_P2PRIRLX_MASK                   (0x3FFU)                                            /*!< DDR_CR50.P2PRIRLX Mask                  */
#define DDR_CR50_P2PRIRLX_SHIFT                  (0U)                                                /*!< DDR_CR50.P2PRIRLX Position              */
#define DDR_CR50_P2PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFUL)         /*!< DDR_CR50.P2PRIRLX Field                 */
#define DDR_CR50_CLKSTATUS_MASK                  (0x10000U)                                          /*!< DDR_CR50.CLKSTATUS Mask                 */
#define DDR_CR50_CLKSTATUS_SHIFT                 (16U)                                               /*!< DDR_CR50.CLKSTATUS Position             */
#define DDR_CR50_CLKSTATUS(x)                    (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DDR_CR50.CLKSTATUS Field                */
/* ------- CR51 Bit Fields                          ------ */
#define DDR_CR51_DLLRSTDLY_MASK                  (0xFFFFU)                                           /*!< DDR_CR51.DLLRSTDLY Mask                 */
#define DDR_CR51_DLLRSTDLY_SHIFT                 (0U)                                                /*!< DDR_CR51.DLLRSTDLY Position             */
#define DDR_CR51_DLLRSTDLY(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR51.DLLRSTDLY Field                */
#define DDR_CR51_DLLRADLY_MASK                   (0xFF0000U)                                         /*!< DDR_CR51.DLLRADLY Mask                  */
#define DDR_CR51_DLLRADLY_SHIFT                  (16U)                                               /*!< DDR_CR51.DLLRADLY Position              */
#define DDR_CR51_DLLRADLY(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< DDR_CR51.DLLRADLY Field                 */
#define DDR_CR51_PHYWRLAT_MASK                   (0xF000000U)                                        /*!< DDR_CR51.PHYWRLAT Mask                  */
#define DDR_CR51_PHYWRLAT_SHIFT                  (24U)                                               /*!< DDR_CR51.PHYWRLAT Position              */
#define DDR_CR51_PHYWRLAT(x)                     (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< DDR_CR51.PHYWRLAT Field                 */
/* ------- CR52 Bit Fields                          ------ */
#define DDR_CR52_PYWRLTBS_MASK                   (0xFU)                                              /*!< DDR_CR52.PYWRLTBS Mask                  */
#define DDR_CR52_PYWRLTBS_SHIFT                  (0U)                                                /*!< DDR_CR52.PYWRLTBS Position              */
#define DDR_CR52_PYWRLTBS(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< DDR_CR52.PYWRLTBS Field                 */
#define DDR_CR52_PHYRDLAT_MASK                   (0xF00U)                                            /*!< DDR_CR52.PHYRDLAT Mask                  */
#define DDR_CR52_PHYRDLAT_SHIFT                  (8U)                                                /*!< DDR_CR52.PHYRDLAT Position              */
#define DDR_CR52_PHYRDLAT(x)                     (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< DDR_CR52.PHYRDLAT Field                 */
#define DDR_CR52_RDDATAEN_MASK                   (0xF0000U)                                          /*!< DDR_CR52.RDDATAEN Mask                  */
#define DDR_CR52_RDDATAEN_SHIFT                  (16U)                                               /*!< DDR_CR52.RDDATAEN Position              */
#define DDR_CR52_RDDATAEN(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< DDR_CR52.RDDATAEN Field                 */
#define DDR_CR52_RDDTENBAS_MASK                  (0xF000000U)                                        /*!< DDR_CR52.RDDTENBAS Mask                 */
#define DDR_CR52_RDDTENBAS_SHIFT                 (24U)                                               /*!< DDR_CR52.RDDTENBAS Position             */
#define DDR_CR52_RDDTENBAS(x)                    (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< DDR_CR52.RDDTENBAS Field                */
/* ------- CR53 Bit Fields                          ------ */
