podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define DDR_CR53_CLKDISCS_MASK                   (0x1U)                                              /*!< DDR_CR53.CLKDISCS Mask                  */
#define DDR_CR53_CLKDISCS_SHIFT                  (0U)                                                /*!< DDR_CR53.CLKDISCS Position              */
#define DDR_CR53_CLKDISCS(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DDR_CR53.CLKDISCS Field                 */
#define DDR_CR53_CRTLUPDMN_MASK                  (0xF00U)                                            /*!< DDR_CR53.CRTLUPDMN Mask                 */
#define DDR_CR53_CRTLUPDMN_SHIFT                 (8U)                                                /*!< DDR_CR53.CRTLUPDMN Position             */
#define DDR_CR53_CRTLUPDMN(x)                    (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< DDR_CR53.CRTLUPDMN Field                */
#define DDR_CR53_CTRLUPDMX_MASK                  (0x3FFF0000U)                                       /*!< DDR_CR53.CTRLUPDMX Mask                 */
#define DDR_CR53_CTRLUPDMX_SHIFT                 (16U)                                               /*!< DDR_CR53.CTRLUPDMX Position             */
#define DDR_CR53_CTRLUPDMX(x)                    (((uint32_t)(((uint32_t)(x))<<16U))&0x3FFF0000UL)   /*!< DDR_CR53.CTRLUPDMX Field                */
/* ------- CR54 Bit Fields                          ------ */
#define DDR_CR54_PHYUPDTY0_MASK                  (0x3FFFU)                                           /*!< DDR_CR54.PHYUPDTY0 Mask                 */
#define DDR_CR54_PHYUPDTY0_SHIFT                 (0U)                                                /*!< DDR_CR54.PHYUPDTY0 Position             */
#define DDR_CR54_PHYUPDTY0(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFFUL)        /*!< DDR_CR54.PHYUPDTY0 Field                */
#define DDR_CR54_PHYUPDTY1_MASK                  (0x3FFF0000U)                                       /*!< DDR_CR54.PHYUPDTY1 Mask                 */
#define DDR_CR54_PHYUPDTY1_SHIFT                 (16U)                                               /*!< DDR_CR54.PHYUPDTY1 Position             */
#define DDR_CR54_PHYUPDTY1(x)                    (((uint32_t)(((uint32_t)(x))<<16U))&0x3FFF0000UL)   /*!< DDR_CR54.PHYUPDTY1 Field                */
/* ------- CR55 Bit Fields                          ------ */
#define DDR_CR55_PHYUPDTY2_MASK                  (0x3FFFU)                                           /*!< DDR_CR55.PHYUPDTY2 Mask                 */
#define DDR_CR55_PHYUPDTY2_SHIFT                 (0U)                                                /*!< DDR_CR55.PHYUPDTY2 Position             */
#define DDR_CR55_PHYUPDTY2(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFFUL)        /*!< DDR_CR55.PHYUPDTY2 Field                */
#define DDR_CR55_PHYUPDTY3_MASK                  (0x3FFF0000U)                                       /*!< DDR_CR55.PHYUPDTY3 Mask                 */
#define DDR_CR55_PHYUPDTY3_SHIFT                 (16U)                                               /*!< DDR_CR55.PHYUPDTY3 Position             */
#define DDR_CR55_PHYUPDTY3(x)                    (((uint32_t)(((uint32_t)(x))<<16U))&0x3FFF0000UL)   /*!< DDR_CR55.PHYUPDTY3 Field                */
/* ------- CR56 Bit Fields                          ------ */
#define DDR_CR56_PHYUPDRESP_MASK                 (0x3FFFU)                                           /*!< DDR_CR56.PHYUPDRESP Mask                */
#define DDR_CR56_PHYUPDRESP_SHIFT                (0U)                                                /*!< DDR_CR56.PHYUPDRESP Position            */
#define DDR_CR56_PHYUPDRESP(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFFUL)        /*!< DDR_CR56.PHYUPDRESP Field               */
#define DDR_CR56_RDLATADJ_MASK                   (0xF0000U)                                          /*!< DDR_CR56.RDLATADJ Mask                  */
#define DDR_CR56_RDLATADJ_SHIFT                  (16U)                                               /*!< DDR_CR56.RDLATADJ Position              */
#define DDR_CR56_RDLATADJ(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< DDR_CR56.RDLATADJ Field                 */
#define DDR_CR56_WRLATADJ_MASK                   (0xF000000U)                                        /*!< DDR_CR56.WRLATADJ Mask                  */
#define DDR_CR56_WRLATADJ_SHIFT                  (24U)                                               /*!< DDR_CR56.WRLATADJ Position              */
#define DDR_CR56_WRLATADJ(x)                     (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< DDR_CR56.WRLATADJ Field                 */
/* ------- CR57 Bit Fields                          ------ */
#define DDR_CR57_CMDDLY_MASK                     (0xFU)                                              /*!< DDR_CR57.CMDDLY Mask                    */
#define DDR_CR57_CMDDLY_SHIFT                    (0U)                                                /*!< DDR_CR57.CMDDLY Position                */
#define DDR_CR57_CMDDLY(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< DDR_CR57.CMDDLY Field                   */
#define DDR_CR57_CLKDISDLY_MASK                  (0x700U)                                            /*!< DDR_CR57.CLKDISDLY Mask                 */
#define DDR_CR57_CLKDISDLY_SHIFT                 (8U)                                                /*!< DDR_CR57.CLKDISDLY Position             */
#define DDR_CR57_CLKDISDLY(x)                    (((uint32_t)(((uint32_t)(x))<<8U))&0x700UL)         /*!< DDR_CR57.CLKDISDLY Field                */
#define DDR_CR57_CLKENDLY_MASK                   (0xF0000U)                                          /*!< DDR_CR57.CLKENDLY Mask                  */
#define DDR_CR57_CLKENDLY_SHIFT                  (16U)                                               /*!< DDR_CR57.CLKENDLY Position              */
#define DDR_CR57_CLKENDLY(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< DDR_CR57.CLKENDLY Field                 */
#define DDR_CR57_ODTALTEN_MASK                   (0x1000000U)                                        /*!< DDR_CR57.ODTALTEN Mask                  */
#define DDR_CR57_ODTALTEN_SHIFT                  (24U)                                               /*!< DDR_CR57.ODTALTEN Position              */
#define DDR_CR57_ODTALTEN(x)                     (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DDR_CR57.ODTALTEN Field                 */
/* ------- CR5 Bit Fields                           ------ */
#define DDR_CR5_Not_Used_MASK                    (0xFFFFU)                                           /*!< DDR_CR5.Not_Used Mask                   */
#define DDR_CR5_Not_Used_SHIFT                   (0U)                                                /*!< DDR_CR5.Not_Used Position               */
#define DDR_CR5_Not_Used(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR5.Not_Used Field                  */
#define DDR_CR5_NOT_USED_MASK                    (0xFFFF0000U)                                       /*!< DDR_CR5.NOT_USED Mask                   */
#define DDR_CR5_NOT_USED_SHIFT                   (16U)                                               /*!< DDR_CR5.NOT_USED Position               */
#define DDR_CR5_NOT_USED(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< DDR_CR5.NOT_USED Field                  */
/* ------- CR6 Bit Fields                           ------ */
#define DDR_CR6_Not_Used_MASK                    (0xFFFFU)                                           /*!< DDR_CR6.Not_Used Mask                   */
#define DDR_CR6_Not_Used_SHIFT                   (0U)                                                /*!< DDR_CR6.Not_Used Position               */
#define DDR_CR6_Not_Used(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< DDR_CR6.Not_Used Field                  */
#define DDR_CR6_NOT_USED_MASK                    (0xFFFF0000U)                                       /*!< DDR_CR6.NOT_USED Mask                   */
#define DDR_CR6_NOT_USED_SHIFT                   (16U)                                               /*!< DDR_CR6.NOT_USED Position               */
#define DDR_CR6_NOT_USED(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< DDR_CR6.NOT_USED Field                  */
/* ------- RCR Bit Fields                           ------ */
#define DDR_RCR_RST_MASK                         (0x40000000U)                                       /*!< DDR_RCR.RST Mask                        */
#define DDR_RCR_RST_SHIFT                        (30U)                                               /*!< DDR_RCR.RST Position                    */
#define DDR_RCR_RST(x)                           (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< DDR_RCR.RST Field                       */
/* ------- PAD_CTRL Bit Fields                      ------ */
#define DDR_PAD_CTRL_SPARE_DLY_CTRL_MASK         (0xFU)                                              /*!< DDR_PAD_CTRL.SPARE_DLY_CTRL Mask        */
#define DDR_PAD_CTRL_SPARE_DLY_CTRL_SHIFT        (0U)                                                /*!< DDR_PAD_CTRL.SPARE_DLY_CTRL Position    */
#define DDR_PAD_CTRL_SPARE_DLY_CTRL(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< DDR_PAD_CTRL.SPARE_DLY_CTRL Field       */
#define DDR_PAD_CTRL_PAD_ODT_CS0_MASK            (0x3000000U)                                        /*!< DDR_PAD_CTRL.PAD_ODT_CS0 Mask           */
#define DDR_PAD_CTRL_PAD_ODT_CS0_SHIFT           (24U)                                               /*!< DDR_PAD_CTRL.PAD_ODT_CS0 Position       */
#define DDR_PAD_CTRL_PAD_ODT_CS0(x)              (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< DDR_PAD_CTRL.PAD_ODT_CS0 Field          */
/**
 * @} */ /* End group DDR_Register_Masks_GROUP 
 */

/* DDR - Peripheral instance base addresses */
#define DDR_BasePtr                    0x400AE000UL //!< Peripheral base address
#define DDR                            ((DDR_Type *) DDR_BasePtr) //!< Freescale base pointer
#define DDR_BASE_PTR                   (DDR) //!< Freescale style base pointer
#define DDR_IRQS { DDR_IRQn,  }

/**
 * @} */ /* End group DDR_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup DMA0_Peripheral_access_layer_GROUP DMA0 Peripheral Access Layer
* @brief C Struct for DMA0
* @{
*/

/* ================================================================================ */
/* ================           DMA0 (file:DMA0_32CH)                ================ */
/* ================================================================================ */

/**
 * @brief Enhanced direct memory access controller
 */
/**
* @addtogroup DMA0_structs_GROUP DMA0 struct
* @brief Struct for DMA0
* @{
*/
typedef struct DMA_Type {
   __IO uint32_t  CR;                           /**< 0000: Control Register                                             */
   __I  uint32_t  ES;                           /**< 0004: Error Status Register                                        */
        uint8_t   RESERVED_0[4];                /**< 0008: 0x4 bytes                                                    */
   __IO uint32_t  ERQ;                          /**< 000C: Enable Request Register                                      */
        uint8_t   RESERVED_1[4];                /**< 0010: 0x4 bytes                                                    */
   __IO uint32_t  EEI;                          /**< 0014: Enable Error Interrupt Register                              */
   __O  uint8_t   CEEI;                         /**< 0018: Clear Enable Error Interrupt Register                        */
   __O  uint8_t   SEEI;                         /**< 0019: Set Enable Error Interrupt Register                          */
   __O  uint8_t   CERQ;                         /**< 001A: Clear Enable Request Register                                */
   __O  uint8_t   SERQ;                         /**< 001B: Set Enable Request Register                                  */
   __O  uint8_t   CDNE;                         /**< 001C: Clear DONE Status Bit Register                               */
   __O  uint8_t   SSRT;                         /**< 001D: Set START Bit Register                                       */
   __O  uint8_t   CERR;                         /**< 001E: Clear Error Register                                         */
   __O  uint8_t   CINT;                         /**< 001F: Clear Interrupt Request Register                             */
        uint8_t   RESERVED_2[4];                /**< 0020: 0x4 bytes                                                    */
   __IO uint32_t  INT;                          /**< 0024: Interrupt Request Register                                   */
        uint8_t   RESERVED_3[4];                /**< 0028: 0x4 bytes                                                    */
   __IO uint32_t  ERR;                          /**< 002C: Error Register                                               */
        uint8_t   RESERVED_4[4];                /**< 0030: 0x4 bytes                                                    */
   __I  uint32_t  HRS;                          /**< 0034: Hardware Request Status Register                             */
        uint8_t   RESERVED_5[200];              /**< 0038: 0xC8 bytes                                                   */
   union {                                      /**< 0100: (size=0020)                                                  */
      struct {                                  /**< 0100: (size=0020)                                                  */
      __IO uint8_t   DCHPRI3;                   /**< 0100: Channel 3 Priority Register                                  */
      __IO uint8_t   DCHPRI2;                   /**< 0101: Channel 2 Priority Register                                  */
      __IO uint8_t   DCHPRI1;                   /**< 0102: Channel 1 Priority Register                                  */
      __IO uint8_t   DCHPRI0;                   /**< 0103: Channel 0 Priority Register                                  */
      __IO uint8_t   DCHPRI7;                   /**< 0104: Channel 7 Priority Register                                  */
      __IO uint8_t   DCHPRI6;                   /**< 0105: Channel 6 Priority Register                                  */
      __IO uint8_t   DCHPRI5;                   /**< 0106: Channel 5 Priority Register                                  */
      __IO uint8_t   DCHPRI4;                   /**< 0107: Channel 4 Priority Register                                  */
      __IO uint8_t   DCHPRI11;                  /**< 0108: Channel 11 Priority Register                                 */
      __IO uint8_t   DCHPRI10;                  /**< 0109: Channel 10 Priority Register                                 */
      __IO uint8_t   DCHPRI9;                   /**< 010A: Channel 9 Priority Register                                  */
      __IO uint8_t   DCHPRI8;                   /**< 010B: Channel 8 Priority Register                                  */
      __IO uint8_t   DCHPRI15;                  /**< 010C: Channel 15 Priority Register                                 */
      __IO uint8_t   DCHPRI14;                  /**< 010D: Channel 14 Priority Register                                 */
      __IO uint8_t   DCHPRI13;                  /**< 010E: Channel 13 Priority Register                                 */
      __IO uint8_t   DCHPRI12;                  /**< 010F: Channel 12 Priority Register                                 */
      __IO uint8_t   DCHPRI19;                  /**< 0110: Channel 19 Priority Register                                 */
      __IO uint8_t   DCHPRI18;                  /**< 0111: Channel 18 Priority Register                                 */
      __IO uint8_t   DCHPRI17;                  /**< 0112: Channel 17 Priority Register                                 */
      __IO uint8_t   DCHPRI16;                  /**< 0113: Channel 16 Priority Register                                 */
      __IO uint8_t   DCHPRI23;                  /**< 0114: Channel 23 Priority Register                                 */
      __IO uint8_t   DCHPRI22;                  /**< 0115: Channel 22 Priority Register                                 */
      __IO uint8_t   DCHPRI21;                  /**< 0116: Channel 21 Priority Register                                 */
      __IO uint8_t   DCHPRI20;                  /**< 0117: Channel 20 Priority Register                                 */
      __IO uint8_t   DCHPRI27;                  /**< 0118: Channel 27 Priority Register                                 */
      __IO uint8_t   DCHPRI26;                  /**< 0119: Channel 26 Priority Register                                 */
      __IO uint8_t   DCHPRI25;                  /**< 011A: Channel 25 Priority Register                                 */
      __IO uint8_t   DCHPRI24;                  /**< 011B: Channel 24 Priority Register                                 */
      __IO uint8_t   DCHPRI31;                  /**< 011C: Channel 31 Priority Register                                 */
      __IO uint8_t   DCHPRI30;                  /**< 011D: Channel 30 Priority Register                                 */
      __IO uint8_t   DCHPRI29;                  /**< 011E: Channel 29 Priority Register                                 */
      __IO uint8_t   DCHPRI28;                  /**< 011F: Channel 28 Priority Register                                 */
      };
      __IO uint8_t   DCHPRI[32];                /**< 0100: Channel  Priority Register                                   */
   };
        uint8_t   RESERVED_6[3808];             /**< 0120: 0xEE0 bytes                                                  */
   struct {
      __IO uint32_t  SADDR;                     /**< 1000: Source Address                                               */
      __IO uint16_t  SOFF;                      /**< 1004: Signed Source Address Offset                                 */
      __IO uint16_t  ATTR;                      /**< 1006: Transfer Attributes                                          */
      union {                                   /**< 1008: (size=0004)                                                  */
         __IO uint32_t  NBYTES_MLNO;            /**< 1008: Minor Byte Count (Minor Loop Disabled)                       */
         __IO uint32_t  NBYTES_MLOFFNO;         /**< 1008: Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled) */
         __IO uint32_t  NBYTES_MLOFFYES;        /**< 1008: Signed Minor Loop Offset (Minor Loop and Offset Enabled)     */
      };
      __IO uint32_t  SLAST;                     /**< 100C: Last Source Address Adjustment                               */
      __IO uint32_t  DADDR;                     /**< 1010: Destination Address                                          */
      __IO uint16_t  DOFF;                      /**< 1014: Signed Destination Address Offset                            */
      union {                                   /**< 1016: (size=0002)                                                  */
         __IO uint16_t  CITER_ELINKNO;          /**< 1016: Current Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
         __IO uint16_t  CITER_ELINKYES;         /**< 1016: Current Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
      };
      __IO uint32_t  DLASTSGA;                  /**< 1018: Last Destination Address Adjustment/Scatter Gather Address   */
      __IO uint16_t  CSR;                       /**< 101C: Control and Status                                           */
      union {                                   /**< 101E: (size=0002)                                                  */
         __IO uint16_t  BITER_ELINKNO;          /**< 101E: Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
         __IO uint16_t  BITER_ELINKYES;         /**< 101E: Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
      };
   } TCD[32];                                   /**< 1000: (cluster: size=0x0400, 1024)                                 */
} DMA_Type;

/**
 * @} */ /* End group DMA0_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'DMA0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

