podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
* @addtogroup DMA0_Register_Masks_GROUP DMA0 Register Masks
* @brief Register Masks for DMA0
* @{
*/
/* ------- CR Bit Fields                            ------ */
#define DMA_CR_EDBG_MASK                         (0x2U)                                              /*!< DMA0_CR.EDBG Mask                       */
#define DMA_CR_EDBG_SHIFT                        (1U)                                                /*!< DMA0_CR.EDBG Position                   */
#define DMA_CR_EDBG(x)                           (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< DMA0_CR.EDBG Field                      */
#define DMA_CR_ERCA_MASK                         (0x4U)                                              /*!< DMA0_CR.ERCA Mask                       */
#define DMA_CR_ERCA_SHIFT                        (2U)                                                /*!< DMA0_CR.ERCA Position                   */
#define DMA_CR_ERCA(x)                           (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< DMA0_CR.ERCA Field                      */
#define DMA_CR_ERGA_MASK                         (0x8U)                                              /*!< DMA0_CR.ERGA Mask                       */
#define DMA_CR_ERGA_SHIFT                        (3U)                                                /*!< DMA0_CR.ERGA Position                   */
#define DMA_CR_ERGA(x)                           (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< DMA0_CR.ERGA Field                      */
#define DMA_CR_HOE_MASK                          (0x10U)                                             /*!< DMA0_CR.HOE Mask                        */
#define DMA_CR_HOE_SHIFT                         (4U)                                                /*!< DMA0_CR.HOE Position                    */
#define DMA_CR_HOE(x)                            (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< DMA0_CR.HOE Field                       */
#define DMA_CR_HALT_MASK                         (0x20U)                                             /*!< DMA0_CR.HALT Mask                       */
#define DMA_CR_HALT_SHIFT                        (5U)                                                /*!< DMA0_CR.HALT Position                   */
#define DMA_CR_HALT(x)                           (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< DMA0_CR.HALT Field                      */
#define DMA_CR_CLM_MASK                          (0x40U)                                             /*!< DMA0_CR.CLM Mask                        */
#define DMA_CR_CLM_SHIFT                         (6U)                                                /*!< DMA0_CR.CLM Position                    */
#define DMA_CR_CLM(x)                            (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< DMA0_CR.CLM Field                       */
#define DMA_CR_EMLM_MASK                         (0x80U)                                             /*!< DMA0_CR.EMLM Mask                       */
#define DMA_CR_EMLM_SHIFT                        (7U)                                                /*!< DMA0_CR.EMLM Position                   */
#define DMA_CR_EMLM(x)                           (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< DMA0_CR.EMLM Field                      */
#define DMA_CR_GRP0PRI_MASK                      (0x300U)                                            /*!< DMA0_CR.GRP0PRI Mask                    */
#define DMA_CR_GRP0PRI_SHIFT                     (8U)                                                /*!< DMA0_CR.GRP0PRI Position                */
#define DMA_CR_GRP0PRI(x)                        (((uint32_t)(((uint32_t)(x))<<8U))&0x300UL)         /*!< DMA0_CR.GRP0PRI Field                   */
#define DMA_CR_GRP1PRI_MASK                      (0xC00U)                                            /*!< DMA0_CR.GRP1PRI Mask                    */
#define DMA_CR_GRP1PRI_SHIFT                     (10U)                                               /*!< DMA0_CR.GRP1PRI Position                */
#define DMA_CR_GRP1PRI(x)                        (((uint32_t)(((uint32_t)(x))<<10U))&0xC00UL)        /*!< DMA0_CR.GRP1PRI Field                   */
#define DMA_CR_ECX_MASK                          (0x10000U)                                          /*!< DMA0_CR.ECX Mask                        */
#define DMA_CR_ECX_SHIFT                         (16U)                                               /*!< DMA0_CR.ECX Position                    */
#define DMA_CR_ECX(x)                            (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DMA0_CR.ECX Field                       */
#define DMA_CR_CX_MASK                           (0x20000U)                                          /*!< DMA0_CR.CX Mask                         */
#define DMA_CR_CX_SHIFT                          (17U)                                               /*!< DMA0_CR.CX Position                     */
#define DMA_CR_CX(x)                             (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< DMA0_CR.CX Field                        */
/* ------- ES Bit Fields                            ------ */
#define DMA_ES_DBE_MASK                          (0x1U)                                              /*!< DMA0_ES.DBE Mask                        */
#define DMA_ES_DBE_SHIFT                         (0U)                                                /*!< DMA0_ES.DBE Position                    */
#define DMA_ES_DBE(x)                            (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DMA0_ES.DBE Field                       */
#define DMA_ES_SBE_MASK                          (0x2U)                                              /*!< DMA0_ES.SBE Mask                        */
#define DMA_ES_SBE_SHIFT                         (1U)                                                /*!< DMA0_ES.SBE Position                    */
#define DMA_ES_SBE(x)                            (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< DMA0_ES.SBE Field                       */
#define DMA_ES_SGE_MASK                          (0x4U)                                              /*!< DMA0_ES.SGE Mask                        */
#define DMA_ES_SGE_SHIFT                         (2U)                                                /*!< DMA0_ES.SGE Position                    */
#define DMA_ES_SGE(x)                            (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< DMA0_ES.SGE Field                       */
#define DMA_ES_NCE_MASK                          (0x8U)                                              /*!< DMA0_ES.NCE Mask                        */
#define DMA_ES_NCE_SHIFT                         (3U)                                                /*!< DMA0_ES.NCE Position                    */
#define DMA_ES_NCE(x)                            (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< DMA0_ES.NCE Field                       */
#define DMA_ES_DOE_MASK                          (0x10U)                                             /*!< DMA0_ES.DOE Mask                        */
#define DMA_ES_DOE_SHIFT                         (4U)                                                /*!< DMA0_ES.DOE Position                    */
#define DMA_ES_DOE(x)                            (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< DMA0_ES.DOE Field                       */
#define DMA_ES_DAE_MASK                          (0x20U)                                             /*!< DMA0_ES.DAE Mask                        */
#define DMA_ES_DAE_SHIFT                         (5U)                                                /*!< DMA0_ES.DAE Position                    */
#define DMA_ES_DAE(x)                            (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< DMA0_ES.DAE Field                       */
#define DMA_ES_SOE_MASK                          (0x40U)                                             /*!< DMA0_ES.SOE Mask                        */
#define DMA_ES_SOE_SHIFT                         (6U)                                                /*!< DMA0_ES.SOE Position                    */
#define DMA_ES_SOE(x)                            (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< DMA0_ES.SOE Field                       */
#define DMA_ES_SAE_MASK                          (0x80U)                                             /*!< DMA0_ES.SAE Mask                        */
#define DMA_ES_SAE_SHIFT                         (7U)                                                /*!< DMA0_ES.SAE Position                    */
#define DMA_ES_SAE(x)                            (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< DMA0_ES.SAE Field                       */
#define DMA_ES_ERRCHN_MASK                       (0x1F00U)                                           /*!< DMA0_ES.ERRCHN Mask                     */
#define DMA_ES_ERRCHN_SHIFT                      (8U)                                                /*!< DMA0_ES.ERRCHN Position                 */
#define DMA_ES_ERRCHN(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0x1F00UL)        /*!< DMA0_ES.ERRCHN Field                    */
#define DMA_ES_CPE_MASK                          (0x4000U)                                           /*!< DMA0_ES.CPE Mask                        */
#define DMA_ES_CPE_SHIFT                         (14U)                                               /*!< DMA0_ES.CPE Position                    */
#define DMA_ES_CPE(x)                            (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< DMA0_ES.CPE Field                       */
#define DMA_ES_GPE_MASK                          (0x8000U)                                           /*!< DMA0_ES.GPE Mask                        */
#define DMA_ES_GPE_SHIFT                         (15U)                                               /*!< DMA0_ES.GPE Position                    */
#define DMA_ES_GPE(x)                            (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< DMA0_ES.GPE Field                       */
#define DMA_ES_ECX_MASK                          (0x10000U)                                          /*!< DMA0_ES.ECX Mask                        */
#define DMA_ES_ECX_SHIFT                         (16U)                                               /*!< DMA0_ES.ECX Position                    */
#define DMA_ES_ECX(x)                            (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DMA0_ES.ECX Field                       */
#define DMA_ES_VLD_MASK                          (0x80000000U)                                       /*!< DMA0_ES.VLD Mask                        */
#define DMA_ES_VLD_SHIFT                         (31U)                                               /*!< DMA0_ES.VLD Position                    */
#define DMA_ES_VLD(x)                            (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< DMA0_ES.VLD Field                       */
/* ------- ERQ Bit Fields                           ------ */
#define DMA_ERQ_ERQ0_MASK                        (0x1U)                                              /*!< DMA0_ERQ.ERQ0 Mask                      */
#define DMA_ERQ_ERQ0_SHIFT                       (0U)                                                /*!< DMA0_ERQ.ERQ0 Position                  */
#define DMA_ERQ_ERQ0(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DMA0_ERQ.ERQ0 Field                     */
#define DMA_ERQ_ERQ1_MASK                        (0x2U)                                              /*!< DMA0_ERQ.ERQ1 Mask                      */
#define DMA_ERQ_ERQ1_SHIFT                       (1U)                                                /*!< DMA0_ERQ.ERQ1 Position                  */
#define DMA_ERQ_ERQ1(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< DMA0_ERQ.ERQ1 Field                     */
#define DMA_ERQ_ERQ2_MASK                        (0x4U)                                              /*!< DMA0_ERQ.ERQ2 Mask                      */
#define DMA_ERQ_ERQ2_SHIFT                       (2U)                                                /*!< DMA0_ERQ.ERQ2 Position                  */
#define DMA_ERQ_ERQ2(x)                          (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< DMA0_ERQ.ERQ2 Field                     */
#define DMA_ERQ_ERQ3_MASK                        (0x8U)                                              /*!< DMA0_ERQ.ERQ3 Mask                      */
#define DMA_ERQ_ERQ3_SHIFT                       (3U)                                                /*!< DMA0_ERQ.ERQ3 Position                  */
#define DMA_ERQ_ERQ3(x)                          (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< DMA0_ERQ.ERQ3 Field                     */
#define DMA_ERQ_ERQ4_MASK                        (0x10U)                                             /*!< DMA0_ERQ.ERQ4 Mask                      */
#define DMA_ERQ_ERQ4_SHIFT                       (4U)                                                /*!< DMA0_ERQ.ERQ4 Position                  */
#define DMA_ERQ_ERQ4(x)                          (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< DMA0_ERQ.ERQ4 Field                     */
#define DMA_ERQ_ERQ5_MASK                        (0x20U)                                             /*!< DMA0_ERQ.ERQ5 Mask                      */
#define DMA_ERQ_ERQ5_SHIFT                       (5U)                                                /*!< DMA0_ERQ.ERQ5 Position                  */
#define DMA_ERQ_ERQ5(x)                          (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< DMA0_ERQ.ERQ5 Field                     */
#define DMA_ERQ_ERQ6_MASK                        (0x40U)                                             /*!< DMA0_ERQ.ERQ6 Mask                      */
#define DMA_ERQ_ERQ6_SHIFT                       (6U)                                                /*!< DMA0_ERQ.ERQ6 Position                  */
#define DMA_ERQ_ERQ6(x)                          (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< DMA0_ERQ.ERQ6 Field                     */
#define DMA_ERQ_ERQ7_MASK                        (0x80U)                                             /*!< DMA0_ERQ.ERQ7 Mask                      */
#define DMA_ERQ_ERQ7_SHIFT                       (7U)                                                /*!< DMA0_ERQ.ERQ7 Position                  */
#define DMA_ERQ_ERQ7(x)                          (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< DMA0_ERQ.ERQ7 Field                     */
#define DMA_ERQ_ERQ8_MASK                        (0x100U)                                            /*!< DMA0_ERQ.ERQ8 Mask                      */
#define DMA_ERQ_ERQ8_SHIFT                       (8U)                                                /*!< DMA0_ERQ.ERQ8 Position                  */
#define DMA_ERQ_ERQ8(x)                          (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< DMA0_ERQ.ERQ8 Field                     */
#define DMA_ERQ_ERQ9_MASK                        (0x200U)                                            /*!< DMA0_ERQ.ERQ9 Mask                      */
#define DMA_ERQ_ERQ9_SHIFT                       (9U)                                                /*!< DMA0_ERQ.ERQ9 Position                  */
#define DMA_ERQ_ERQ9(x)                          (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< DMA0_ERQ.ERQ9 Field                     */
#define DMA_ERQ_ERQ10_MASK                       (0x400U)                                            /*!< DMA0_ERQ.ERQ10 Mask                     */
#define DMA_ERQ_ERQ10_SHIFT                      (10U)                                               /*!< DMA0_ERQ.ERQ10 Position                 */
#define DMA_ERQ_ERQ10(x)                         (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< DMA0_ERQ.ERQ10 Field                    */
#define DMA_ERQ_ERQ11_MASK                       (0x800U)                                            /*!< DMA0_ERQ.ERQ11 Mask                     */
#define DMA_ERQ_ERQ11_SHIFT                      (11U)                                               /*!< DMA0_ERQ.ERQ11 Position                 */
#define DMA_ERQ_ERQ11(x)                         (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< DMA0_ERQ.ERQ11 Field                    */
#define DMA_ERQ_ERQ12_MASK                       (0x1000U)                                           /*!< DMA0_ERQ.ERQ12 Mask                     */
#define DMA_ERQ_ERQ12_SHIFT                      (12U)                                               /*!< DMA0_ERQ.ERQ12 Position                 */
#define DMA_ERQ_ERQ12(x)                         (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< DMA0_ERQ.ERQ12 Field                    */
#define DMA_ERQ_ERQ13_MASK                       (0x2000U)                                           /*!< DMA0_ERQ.ERQ13 Mask                     */
#define DMA_ERQ_ERQ13_SHIFT                      (13U)                                               /*!< DMA0_ERQ.ERQ13 Position                 */
#define DMA_ERQ_ERQ13(x)                         (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< DMA0_ERQ.ERQ13 Field                    */
#define DMA_ERQ_ERQ14_MASK                       (0x4000U)                                           /*!< DMA0_ERQ.ERQ14 Mask                     */
#define DMA_ERQ_ERQ14_SHIFT                      (14U)                                               /*!< DMA0_ERQ.ERQ14 Position                 */
#define DMA_ERQ_ERQ14(x)                         (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< DMA0_ERQ.ERQ14 Field                    */
#define DMA_ERQ_ERQ15_MASK                       (0x8000U)                                           /*!< DMA0_ERQ.ERQ15 Mask                     */
#define DMA_ERQ_ERQ15_SHIFT                      (15U)                                               /*!< DMA0_ERQ.ERQ15 Position                 */
#define DMA_ERQ_ERQ15(x)                         (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< DMA0_ERQ.ERQ15 Field                    */
#define DMA_ERQ_ERQ16_MASK                       (0x10000U)                                          /*!< DMA0_ERQ.ERQ16 Mask                     */
#define DMA_ERQ_ERQ16_SHIFT                      (16U)                                               /*!< DMA0_ERQ.ERQ16 Position                 */
#define DMA_ERQ_ERQ16(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DMA0_ERQ.ERQ16 Field                    */
#define DMA_ERQ_ERQ17_MASK                       (0x20000U)                                          /*!< DMA0_ERQ.ERQ17 Mask                     */
#define DMA_ERQ_ERQ17_SHIFT                      (17U)                                               /*!< DMA0_ERQ.ERQ17 Position                 */
#define DMA_ERQ_ERQ17(x)                         (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< DMA0_ERQ.ERQ17 Field                    */
#define DMA_ERQ_ERQ18_MASK                       (0x40000U)                                          /*!< DMA0_ERQ.ERQ18 Mask                     */
#define DMA_ERQ_ERQ18_SHIFT                      (18U)                                               /*!< DMA0_ERQ.ERQ18 Position                 */
#define DMA_ERQ_ERQ18(x)                         (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< DMA0_ERQ.ERQ18 Field                    */
#define DMA_ERQ_ERQ19_MASK                       (0x80000U)                                          /*!< DMA0_ERQ.ERQ19 Mask                     */
#define DMA_ERQ_ERQ19_SHIFT                      (19U)                                               /*!< DMA0_ERQ.ERQ19 Position                 */
#define DMA_ERQ_ERQ19(x)                         (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< DMA0_ERQ.ERQ19 Field                    */
#define DMA_ERQ_ERQ20_MASK                       (0x100000U)                                         /*!< DMA0_ERQ.ERQ20 Mask                     */
#define DMA_ERQ_ERQ20_SHIFT                      (20U)                                               /*!< DMA0_ERQ.ERQ20 Position                 */
#define DMA_ERQ_ERQ20(x)                         (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< DMA0_ERQ.ERQ20 Field                    */
#define DMA_ERQ_ERQ21_MASK                       (0x200000U)                                         /*!< DMA0_ERQ.ERQ21 Mask                     */
#define DMA_ERQ_ERQ21_SHIFT                      (21U)                                               /*!< DMA0_ERQ.ERQ21 Position                 */
#define DMA_ERQ_ERQ21(x)                         (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< DMA0_ERQ.ERQ21 Field                    */
#define DMA_ERQ_ERQ22_MASK                       (0x400000U)                                         /*!< DMA0_ERQ.ERQ22 Mask                     */
#define DMA_ERQ_ERQ22_SHIFT                      (22U)                                               /*!< DMA0_ERQ.ERQ22 Position                 */
#define DMA_ERQ_ERQ22(x)                         (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< DMA0_ERQ.ERQ22 Field                    */
#define DMA_ERQ_ERQ23_MASK                       (0x800000U)                                         /*!< DMA0_ERQ.ERQ23 Mask                     */
#define DMA_ERQ_ERQ23_SHIFT                      (23U)                                               /*!< DMA0_ERQ.ERQ23 Position                 */
#define DMA_ERQ_ERQ23(x)                         (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< DMA0_ERQ.ERQ23 Field                    */
#define DMA_ERQ_ERQ24_MASK                       (0x1000000U)                                        /*!< DMA0_ERQ.ERQ24 Mask                     */
#define DMA_ERQ_ERQ24_SHIFT                      (24U)                                               /*!< DMA0_ERQ.ERQ24 Position                 */
#define DMA_ERQ_ERQ24(x)                         (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DMA0_ERQ.ERQ24 Field                    */
#define DMA_ERQ_ERQ25_MASK                       (0x2000000U)                                        /*!< DMA0_ERQ.ERQ25 Mask                     */
#define DMA_ERQ_ERQ25_SHIFT                      (25U)                                               /*!< DMA0_ERQ.ERQ25 Position                 */
#define DMA_ERQ_ERQ25(x)                         (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< DMA0_ERQ.ERQ25 Field                    */
#define DMA_ERQ_ERQ26_MASK                       (0x4000000U)                                        /*!< DMA0_ERQ.ERQ26 Mask                     */
#define DMA_ERQ_ERQ26_SHIFT                      (26U)                                               /*!< DMA0_ERQ.ERQ26 Position                 */
#define DMA_ERQ_ERQ26(x)                         (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< DMA0_ERQ.ERQ26 Field                    */
#define DMA_ERQ_ERQ27_MASK                       (0x8000000U)                                        /*!< DMA0_ERQ.ERQ27 Mask                     */
#define DMA_ERQ_ERQ27_SHIFT                      (27U)                                               /*!< DMA0_ERQ.ERQ27 Position                 */
#define DMA_ERQ_ERQ27(x)                         (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< DMA0_ERQ.ERQ27 Field                    */
#define DMA_ERQ_ERQ28_MASK                       (0x10000000U)                                       /*!< DMA0_ERQ.ERQ28 Mask                     */
#define DMA_ERQ_ERQ28_SHIFT                      (28U)                                               /*!< DMA0_ERQ.ERQ28 Position                 */
#define DMA_ERQ_ERQ28(x)                         (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< DMA0_ERQ.ERQ28 Field                    */
