podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define DMA_ERQ_ERQ29_MASK                       (0x20000000U)                                       /*!< DMA0_ERQ.ERQ29 Mask                     */
#define DMA_ERQ_ERQ29_SHIFT                      (29U)                                               /*!< DMA0_ERQ.ERQ29 Position                 */
#define DMA_ERQ_ERQ29(x)                         (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< DMA0_ERQ.ERQ29 Field                    */
#define DMA_ERQ_ERQ30_MASK                       (0x40000000U)                                       /*!< DMA0_ERQ.ERQ30 Mask                     */
#define DMA_ERQ_ERQ30_SHIFT                      (30U)                                               /*!< DMA0_ERQ.ERQ30 Position                 */
#define DMA_ERQ_ERQ30(x)                         (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< DMA0_ERQ.ERQ30 Field                    */
#define DMA_ERQ_ERQ31_MASK                       (0x80000000U)                                       /*!< DMA0_ERQ.ERQ31 Mask                     */
#define DMA_ERQ_ERQ31_SHIFT                      (31U)                                               /*!< DMA0_ERQ.ERQ31 Position                 */
#define DMA_ERQ_ERQ31(x)                         (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< DMA0_ERQ.ERQ31 Field                    */
/* ------- EEI Bit Fields                           ------ */
#define DMA_EEI_EEI0_MASK                        (0x1U)                                              /*!< DMA0_EEI.EEI0 Mask                      */
#define DMA_EEI_EEI0_SHIFT                       (0U)                                                /*!< DMA0_EEI.EEI0 Position                  */
#define DMA_EEI_EEI0(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DMA0_EEI.EEI0 Field                     */
#define DMA_EEI_EEI1_MASK                        (0x2U)                                              /*!< DMA0_EEI.EEI1 Mask                      */
#define DMA_EEI_EEI1_SHIFT                       (1U)                                                /*!< DMA0_EEI.EEI1 Position                  */
#define DMA_EEI_EEI1(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< DMA0_EEI.EEI1 Field                     */
#define DMA_EEI_EEI2_MASK                        (0x4U)                                              /*!< DMA0_EEI.EEI2 Mask                      */
#define DMA_EEI_EEI2_SHIFT                       (2U)                                                /*!< DMA0_EEI.EEI2 Position                  */
#define DMA_EEI_EEI2(x)                          (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< DMA0_EEI.EEI2 Field                     */
#define DMA_EEI_EEI3_MASK                        (0x8U)                                              /*!< DMA0_EEI.EEI3 Mask                      */
#define DMA_EEI_EEI3_SHIFT                       (3U)                                                /*!< DMA0_EEI.EEI3 Position                  */
#define DMA_EEI_EEI3(x)                          (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< DMA0_EEI.EEI3 Field                     */
#define DMA_EEI_EEI4_MASK                        (0x10U)                                             /*!< DMA0_EEI.EEI4 Mask                      */
#define DMA_EEI_EEI4_SHIFT                       (4U)                                                /*!< DMA0_EEI.EEI4 Position                  */
#define DMA_EEI_EEI4(x)                          (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< DMA0_EEI.EEI4 Field                     */
#define DMA_EEI_EEI5_MASK                        (0x20U)                                             /*!< DMA0_EEI.EEI5 Mask                      */
#define DMA_EEI_EEI5_SHIFT                       (5U)                                                /*!< DMA0_EEI.EEI5 Position                  */
#define DMA_EEI_EEI5(x)                          (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< DMA0_EEI.EEI5 Field                     */
#define DMA_EEI_EEI6_MASK                        (0x40U)                                             /*!< DMA0_EEI.EEI6 Mask                      */
#define DMA_EEI_EEI6_SHIFT                       (6U)                                                /*!< DMA0_EEI.EEI6 Position                  */
#define DMA_EEI_EEI6(x)                          (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< DMA0_EEI.EEI6 Field                     */
#define DMA_EEI_EEI7_MASK                        (0x80U)                                             /*!< DMA0_EEI.EEI7 Mask                      */
#define DMA_EEI_EEI7_SHIFT                       (7U)                                                /*!< DMA0_EEI.EEI7 Position                  */
#define DMA_EEI_EEI7(x)                          (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< DMA0_EEI.EEI7 Field                     */
#define DMA_EEI_EEI8_MASK                        (0x100U)                                            /*!< DMA0_EEI.EEI8 Mask                      */
#define DMA_EEI_EEI8_SHIFT                       (8U)                                                /*!< DMA0_EEI.EEI8 Position                  */
#define DMA_EEI_EEI8(x)                          (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< DMA0_EEI.EEI8 Field                     */
#define DMA_EEI_EEI9_MASK                        (0x200U)                                            /*!< DMA0_EEI.EEI9 Mask                      */
#define DMA_EEI_EEI9_SHIFT                       (9U)                                                /*!< DMA0_EEI.EEI9 Position                  */
#define DMA_EEI_EEI9(x)                          (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< DMA0_EEI.EEI9 Field                     */
#define DMA_EEI_EEI10_MASK                       (0x400U)                                            /*!< DMA0_EEI.EEI10 Mask                     */
#define DMA_EEI_EEI10_SHIFT                      (10U)                                               /*!< DMA0_EEI.EEI10 Position                 */
#define DMA_EEI_EEI10(x)                         (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< DMA0_EEI.EEI10 Field                    */
#define DMA_EEI_EEI11_MASK                       (0x800U)                                            /*!< DMA0_EEI.EEI11 Mask                     */
#define DMA_EEI_EEI11_SHIFT                      (11U)                                               /*!< DMA0_EEI.EEI11 Position                 */
#define DMA_EEI_EEI11(x)                         (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< DMA0_EEI.EEI11 Field                    */
#define DMA_EEI_EEI12_MASK                       (0x1000U)                                           /*!< DMA0_EEI.EEI12 Mask                     */
#define DMA_EEI_EEI12_SHIFT                      (12U)                                               /*!< DMA0_EEI.EEI12 Position                 */
#define DMA_EEI_EEI12(x)                         (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< DMA0_EEI.EEI12 Field                    */
#define DMA_EEI_EEI13_MASK                       (0x2000U)                                           /*!< DMA0_EEI.EEI13 Mask                     */
#define DMA_EEI_EEI13_SHIFT                      (13U)                                               /*!< DMA0_EEI.EEI13 Position                 */
#define DMA_EEI_EEI13(x)                         (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< DMA0_EEI.EEI13 Field                    */
#define DMA_EEI_EEI14_MASK                       (0x4000U)                                           /*!< DMA0_EEI.EEI14 Mask                     */
#define DMA_EEI_EEI14_SHIFT                      (14U)                                               /*!< DMA0_EEI.EEI14 Position                 */
#define DMA_EEI_EEI14(x)                         (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< DMA0_EEI.EEI14 Field                    */
#define DMA_EEI_EEI15_MASK                       (0x8000U)                                           /*!< DMA0_EEI.EEI15 Mask                     */
#define DMA_EEI_EEI15_SHIFT                      (15U)                                               /*!< DMA0_EEI.EEI15 Position                 */
#define DMA_EEI_EEI15(x)                         (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< DMA0_EEI.EEI15 Field                    */
#define DMA_EEI_EEI16_MASK                       (0x10000U)                                          /*!< DMA0_EEI.EEI16 Mask                     */
#define DMA_EEI_EEI16_SHIFT                      (16U)                                               /*!< DMA0_EEI.EEI16 Position                 */
#define DMA_EEI_EEI16(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DMA0_EEI.EEI16 Field                    */
#define DMA_EEI_EEI17_MASK                       (0x20000U)                                          /*!< DMA0_EEI.EEI17 Mask                     */
#define DMA_EEI_EEI17_SHIFT                      (17U)                                               /*!< DMA0_EEI.EEI17 Position                 */
#define DMA_EEI_EEI17(x)                         (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< DMA0_EEI.EEI17 Field                    */
#define DMA_EEI_EEI18_MASK                       (0x40000U)                                          /*!< DMA0_EEI.EEI18 Mask                     */
#define DMA_EEI_EEI18_SHIFT                      (18U)                                               /*!< DMA0_EEI.EEI18 Position                 */
#define DMA_EEI_EEI18(x)                         (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< DMA0_EEI.EEI18 Field                    */
#define DMA_EEI_EEI19_MASK                       (0x80000U)                                          /*!< DMA0_EEI.EEI19 Mask                     */
#define DMA_EEI_EEI19_SHIFT                      (19U)                                               /*!< DMA0_EEI.EEI19 Position                 */
#define DMA_EEI_EEI19(x)                         (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< DMA0_EEI.EEI19 Field                    */
#define DMA_EEI_EEI20_MASK                       (0x100000U)                                         /*!< DMA0_EEI.EEI20 Mask                     */
#define DMA_EEI_EEI20_SHIFT                      (20U)                                               /*!< DMA0_EEI.EEI20 Position                 */
#define DMA_EEI_EEI20(x)                         (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< DMA0_EEI.EEI20 Field                    */
#define DMA_EEI_EEI21_MASK                       (0x200000U)                                         /*!< DMA0_EEI.EEI21 Mask                     */
#define DMA_EEI_EEI21_SHIFT                      (21U)                                               /*!< DMA0_EEI.EEI21 Position                 */
#define DMA_EEI_EEI21(x)                         (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< DMA0_EEI.EEI21 Field                    */
#define DMA_EEI_EEI22_MASK                       (0x400000U)                                         /*!< DMA0_EEI.EEI22 Mask                     */
#define DMA_EEI_EEI22_SHIFT                      (22U)                                               /*!< DMA0_EEI.EEI22 Position                 */
#define DMA_EEI_EEI22(x)                         (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< DMA0_EEI.EEI22 Field                    */
#define DMA_EEI_EEI23_MASK                       (0x800000U)                                         /*!< DMA0_EEI.EEI23 Mask                     */
#define DMA_EEI_EEI23_SHIFT                      (23U)                                               /*!< DMA0_EEI.EEI23 Position                 */
#define DMA_EEI_EEI23(x)                         (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< DMA0_EEI.EEI23 Field                    */
#define DMA_EEI_EEI24_MASK                       (0x1000000U)                                        /*!< DMA0_EEI.EEI24 Mask                     */
#define DMA_EEI_EEI24_SHIFT                      (24U)                                               /*!< DMA0_EEI.EEI24 Position                 */
#define DMA_EEI_EEI24(x)                         (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DMA0_EEI.EEI24 Field                    */
#define DMA_EEI_EEI25_MASK                       (0x2000000U)                                        /*!< DMA0_EEI.EEI25 Mask                     */
#define DMA_EEI_EEI25_SHIFT                      (25U)                                               /*!< DMA0_EEI.EEI25 Position                 */
#define DMA_EEI_EEI25(x)                         (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< DMA0_EEI.EEI25 Field                    */
#define DMA_EEI_EEI26_MASK                       (0x4000000U)                                        /*!< DMA0_EEI.EEI26 Mask                     */
#define DMA_EEI_EEI26_SHIFT                      (26U)                                               /*!< DMA0_EEI.EEI26 Position                 */
#define DMA_EEI_EEI26(x)                         (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< DMA0_EEI.EEI26 Field                    */
#define DMA_EEI_EEI27_MASK                       (0x8000000U)                                        /*!< DMA0_EEI.EEI27 Mask                     */
#define DMA_EEI_EEI27_SHIFT                      (27U)                                               /*!< DMA0_EEI.EEI27 Position                 */
#define DMA_EEI_EEI27(x)                         (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< DMA0_EEI.EEI27 Field                    */
#define DMA_EEI_EEI28_MASK                       (0x10000000U)                                       /*!< DMA0_EEI.EEI28 Mask                     */
#define DMA_EEI_EEI28_SHIFT                      (28U)                                               /*!< DMA0_EEI.EEI28 Position                 */
#define DMA_EEI_EEI28(x)                         (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< DMA0_EEI.EEI28 Field                    */
#define DMA_EEI_EEI29_MASK                       (0x20000000U)                                       /*!< DMA0_EEI.EEI29 Mask                     */
#define DMA_EEI_EEI29_SHIFT                      (29U)                                               /*!< DMA0_EEI.EEI29 Position                 */
#define DMA_EEI_EEI29(x)                         (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< DMA0_EEI.EEI29 Field                    */
#define DMA_EEI_EEI30_MASK                       (0x40000000U)                                       /*!< DMA0_EEI.EEI30 Mask                     */
#define DMA_EEI_EEI30_SHIFT                      (30U)                                               /*!< DMA0_EEI.EEI30 Position                 */
#define DMA_EEI_EEI30(x)                         (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< DMA0_EEI.EEI30 Field                    */
#define DMA_EEI_EEI31_MASK                       (0x80000000U)                                       /*!< DMA0_EEI.EEI31 Mask                     */
#define DMA_EEI_EEI31_SHIFT                      (31U)                                               /*!< DMA0_EEI.EEI31 Position                 */
#define DMA_EEI_EEI31(x)                         (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< DMA0_EEI.EEI31 Field                    */
/* ------- CEEI Bit Fields                          ------ */
#define DMA_CEEI_CEEI_MASK                       (0x1FU)                                             /*!< DMA0_CEEI.CEEI Mask                     */
#define DMA_CEEI_CEEI_SHIFT                      (0U)                                                /*!< DMA0_CEEI.CEEI Position                 */
#define DMA_CEEI_CEEI(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1FUL)            /*!< DMA0_CEEI.CEEI Field                    */
#define DMA_CEEI_CAEE_MASK                       (0x40U)                                             /*!< DMA0_CEEI.CAEE Mask                     */
#define DMA_CEEI_CAEE_SHIFT                      (6U)                                                /*!< DMA0_CEEI.CAEE Position                 */
#define DMA_CEEI_CAEE(x)                         (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< DMA0_CEEI.CAEE Field                    */
#define DMA_CEEI_NOP_MASK                        (0x80U)                                             /*!< DMA0_CEEI.NOP Mask                      */
#define DMA_CEEI_NOP_SHIFT                       (7U)                                                /*!< DMA0_CEEI.NOP Position                  */
#define DMA_CEEI_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< DMA0_CEEI.NOP Field                     */
/* ------- SEEI Bit Fields                          ------ */
#define DMA_SEEI_SEEI_MASK                       (0x1FU)                                             /*!< DMA0_SEEI.SEEI Mask                     */
#define DMA_SEEI_SEEI_SHIFT                      (0U)                                                /*!< DMA0_SEEI.SEEI Position                 */
#define DMA_SEEI_SEEI(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1FUL)            /*!< DMA0_SEEI.SEEI Field                    */
#define DMA_SEEI_SAEE_MASK                       (0x40U)                                             /*!< DMA0_SEEI.SAEE Mask                     */
#define DMA_SEEI_SAEE_SHIFT                      (6U)                                                /*!< DMA0_SEEI.SAEE Position                 */
#define DMA_SEEI_SAEE(x)                         (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< DMA0_SEEI.SAEE Field                    */
#define DMA_SEEI_NOP_MASK                        (0x80U)                                             /*!< DMA0_SEEI.NOP Mask                      */
#define DMA_SEEI_NOP_SHIFT                       (7U)                                                /*!< DMA0_SEEI.NOP Position                  */
#define DMA_SEEI_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< DMA0_SEEI.NOP Field                     */
/* ------- CERQ Bit Fields                          ------ */
#define DMA_CERQ_CERQ_MASK                       (0x1FU)                                             /*!< DMA0_CERQ.CERQ Mask                     */
#define DMA_CERQ_CERQ_SHIFT                      (0U)                                                /*!< DMA0_CERQ.CERQ Position                 */
#define DMA_CERQ_CERQ(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1FUL)            /*!< DMA0_CERQ.CERQ Field                    */
#define DMA_CERQ_CAER_MASK                       (0x40U)                                             /*!< DMA0_CERQ.CAER Mask                     */
#define DMA_CERQ_CAER_SHIFT                      (6U)                                                /*!< DMA0_CERQ.CAER Position                 */
#define DMA_CERQ_CAER(x)                         (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< DMA0_CERQ.CAER Field                    */
#define DMA_CERQ_NOP_MASK                        (0x80U)                                             /*!< DMA0_CERQ.NOP Mask                      */
#define DMA_CERQ_NOP_SHIFT                       (7U)                                                /*!< DMA0_CERQ.NOP Position                  */
#define DMA_CERQ_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< DMA0_CERQ.NOP Field                     */
/* ------- SERQ Bit Fields                          ------ */
#define DMA_SERQ_SERQ_MASK                       (0x1FU)                                             /*!< DMA0_SERQ.SERQ Mask                     */
#define DMA_SERQ_SERQ_SHIFT                      (0U)                                                /*!< DMA0_SERQ.SERQ Position                 */
#define DMA_SERQ_SERQ(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1FUL)            /*!< DMA0_SERQ.SERQ Field                    */
#define DMA_SERQ_SAER_MASK                       (0x40U)                                             /*!< DMA0_SERQ.SAER Mask                     */
#define DMA_SERQ_SAER_SHIFT                      (6U)                                                /*!< DMA0_SERQ.SAER Position                 */
#define DMA_SERQ_SAER(x)                         (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< DMA0_SERQ.SAER Field                    */
#define DMA_SERQ_NOP_MASK                        (0x80U)                                             /*!< DMA0_SERQ.NOP Mask                      */
#define DMA_SERQ_NOP_SHIFT                       (7U)                                                /*!< DMA0_SERQ.NOP Position                  */
#define DMA_SERQ_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< DMA0_SERQ.NOP Field                     */
/* ------- CDNE Bit Fields                          ------ */
#define DMA_CDNE_CDNE_MASK                       (0x1FU)                                             /*!< DMA0_CDNE.CDNE Mask                     */
#define DMA_CDNE_CDNE_SHIFT                      (0U)                                                /*!< DMA0_CDNE.CDNE Position                 */
#define DMA_CDNE_CDNE(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1FUL)            /*!< DMA0_CDNE.CDNE Field                    */
#define DMA_CDNE_CADN_MASK                       (0x40U)                                             /*!< DMA0_CDNE.CADN Mask                     */
#define DMA_CDNE_CADN_SHIFT                      (6U)                                                /*!< DMA0_CDNE.CADN Position                 */
#define DMA_CDNE_CADN(x)                         (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< DMA0_CDNE.CADN Field                    */
#define DMA_CDNE_NOP_MASK                        (0x80U)                                             /*!< DMA0_CDNE.NOP Mask                      */
#define DMA_CDNE_NOP_SHIFT                       (7U)                                                /*!< DMA0_CDNE.NOP Position                  */
#define DMA_CDNE_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< DMA0_CDNE.NOP Field                     */
/* ------- SSRT Bit Fields                          ------ */
#define DMA_SSRT_SSRT_MASK                       (0x1FU)                                             /*!< DMA0_SSRT.SSRT Mask                     */
#define DMA_SSRT_SSRT_SHIFT                      (0U)                                                /*!< DMA0_SSRT.SSRT Position                 */
#define DMA_SSRT_SSRT(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1FUL)            /*!< DMA0_SSRT.SSRT Field                    */
#define DMA_SSRT_SAST_MASK                       (0x40U)                                             /*!< DMA0_SSRT.SAST Mask                     */
#define DMA_SSRT_SAST_SHIFT                      (6U)                                                /*!< DMA0_SSRT.SAST Position                 */
#define DMA_SSRT_SAST(x)                         (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< DMA0_SSRT.SAST Field                    */
#define DMA_SSRT_NOP_MASK                        (0x80U)                                             /*!< DMA0_SSRT.NOP Mask                      */
#define DMA_SSRT_NOP_SHIFT                       (7U)                                                /*!< DMA0_SSRT.NOP Position                  */
