podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define DMA_ERR_ERR14(x)                         (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< DMA0_ERR.ERR14 Field                    */
#define DMA_ERR_ERR15_MASK                       (0x8000U)                                           /*!< DMA0_ERR.ERR15 Mask                     */
#define DMA_ERR_ERR15_SHIFT                      (15U)                                               /*!< DMA0_ERR.ERR15 Position                 */
#define DMA_ERR_ERR15(x)                         (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< DMA0_ERR.ERR15 Field                    */
#define DMA_ERR_ERR16_MASK                       (0x10000U)                                          /*!< DMA0_ERR.ERR16 Mask                     */
#define DMA_ERR_ERR16_SHIFT                      (16U)                                               /*!< DMA0_ERR.ERR16 Position                 */
#define DMA_ERR_ERR16(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DMA0_ERR.ERR16 Field                    */
#define DMA_ERR_ERR17_MASK                       (0x20000U)                                          /*!< DMA0_ERR.ERR17 Mask                     */
#define DMA_ERR_ERR17_SHIFT                      (17U)                                               /*!< DMA0_ERR.ERR17 Position                 */
#define DMA_ERR_ERR17(x)                         (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< DMA0_ERR.ERR17 Field                    */
#define DMA_ERR_ERR18_MASK                       (0x40000U)                                          /*!< DMA0_ERR.ERR18 Mask                     */
#define DMA_ERR_ERR18_SHIFT                      (18U)                                               /*!< DMA0_ERR.ERR18 Position                 */
#define DMA_ERR_ERR18(x)                         (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< DMA0_ERR.ERR18 Field                    */
#define DMA_ERR_ERR19_MASK                       (0x80000U)                                          /*!< DMA0_ERR.ERR19 Mask                     */
#define DMA_ERR_ERR19_SHIFT                      (19U)                                               /*!< DMA0_ERR.ERR19 Position                 */
#define DMA_ERR_ERR19(x)                         (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< DMA0_ERR.ERR19 Field                    */
#define DMA_ERR_ERR20_MASK                       (0x100000U)                                         /*!< DMA0_ERR.ERR20 Mask                     */
#define DMA_ERR_ERR20_SHIFT                      (20U)                                               /*!< DMA0_ERR.ERR20 Position                 */
#define DMA_ERR_ERR20(x)                         (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< DMA0_ERR.ERR20 Field                    */
#define DMA_ERR_ERR21_MASK                       (0x200000U)                                         /*!< DMA0_ERR.ERR21 Mask                     */
#define DMA_ERR_ERR21_SHIFT                      (21U)                                               /*!< DMA0_ERR.ERR21 Position                 */
#define DMA_ERR_ERR21(x)                         (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< DMA0_ERR.ERR21 Field                    */
#define DMA_ERR_ERR22_MASK                       (0x400000U)                                         /*!< DMA0_ERR.ERR22 Mask                     */
#define DMA_ERR_ERR22_SHIFT                      (22U)                                               /*!< DMA0_ERR.ERR22 Position                 */
#define DMA_ERR_ERR22(x)                         (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< DMA0_ERR.ERR22 Field                    */
#define DMA_ERR_ERR23_MASK                       (0x800000U)                                         /*!< DMA0_ERR.ERR23 Mask                     */
#define DMA_ERR_ERR23_SHIFT                      (23U)                                               /*!< DMA0_ERR.ERR23 Position                 */
#define DMA_ERR_ERR23(x)                         (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< DMA0_ERR.ERR23 Field                    */
#define DMA_ERR_ERR24_MASK                       (0x1000000U)                                        /*!< DMA0_ERR.ERR24 Mask                     */
#define DMA_ERR_ERR24_SHIFT                      (24U)                                               /*!< DMA0_ERR.ERR24 Position                 */
#define DMA_ERR_ERR24(x)                         (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DMA0_ERR.ERR24 Field                    */
#define DMA_ERR_ERR25_MASK                       (0x2000000U)                                        /*!< DMA0_ERR.ERR25 Mask                     */
#define DMA_ERR_ERR25_SHIFT                      (25U)                                               /*!< DMA0_ERR.ERR25 Position                 */
#define DMA_ERR_ERR25(x)                         (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< DMA0_ERR.ERR25 Field                    */
#define DMA_ERR_ERR26_MASK                       (0x4000000U)                                        /*!< DMA0_ERR.ERR26 Mask                     */
#define DMA_ERR_ERR26_SHIFT                      (26U)                                               /*!< DMA0_ERR.ERR26 Position                 */
#define DMA_ERR_ERR26(x)                         (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< DMA0_ERR.ERR26 Field                    */
#define DMA_ERR_ERR27_MASK                       (0x8000000U)                                        /*!< DMA0_ERR.ERR27 Mask                     */
#define DMA_ERR_ERR27_SHIFT                      (27U)                                               /*!< DMA0_ERR.ERR27 Position                 */
#define DMA_ERR_ERR27(x)                         (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< DMA0_ERR.ERR27 Field                    */
#define DMA_ERR_ERR28_MASK                       (0x10000000U)                                       /*!< DMA0_ERR.ERR28 Mask                     */
#define DMA_ERR_ERR28_SHIFT                      (28U)                                               /*!< DMA0_ERR.ERR28 Position                 */
#define DMA_ERR_ERR28(x)                         (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< DMA0_ERR.ERR28 Field                    */
#define DMA_ERR_ERR29_MASK                       (0x20000000U)                                       /*!< DMA0_ERR.ERR29 Mask                     */
#define DMA_ERR_ERR29_SHIFT                      (29U)                                               /*!< DMA0_ERR.ERR29 Position                 */
#define DMA_ERR_ERR29(x)                         (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< DMA0_ERR.ERR29 Field                    */
#define DMA_ERR_ERR30_MASK                       (0x40000000U)                                       /*!< DMA0_ERR.ERR30 Mask                     */
#define DMA_ERR_ERR30_SHIFT                      (30U)                                               /*!< DMA0_ERR.ERR30 Position                 */
#define DMA_ERR_ERR30(x)                         (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< DMA0_ERR.ERR30 Field                    */
#define DMA_ERR_ERR31_MASK                       (0x80000000U)                                       /*!< DMA0_ERR.ERR31 Mask                     */
#define DMA_ERR_ERR31_SHIFT                      (31U)                                               /*!< DMA0_ERR.ERR31 Position                 */
#define DMA_ERR_ERR31(x)                         (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< DMA0_ERR.ERR31 Field                    */
/* ------- HRS Bit Fields                           ------ */
#define DMA_HRS_HRS0_MASK                        (0x1U)                                              /*!< DMA0_HRS.HRS0 Mask                      */
#define DMA_HRS_HRS0_SHIFT                       (0U)                                                /*!< DMA0_HRS.HRS0 Position                  */
#define DMA_HRS_HRS0(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< DMA0_HRS.HRS0 Field                     */
#define DMA_HRS_HRS1_MASK                        (0x2U)                                              /*!< DMA0_HRS.HRS1 Mask                      */
#define DMA_HRS_HRS1_SHIFT                       (1U)                                                /*!< DMA0_HRS.HRS1 Position                  */
#define DMA_HRS_HRS1(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< DMA0_HRS.HRS1 Field                     */
#define DMA_HRS_HRS2_MASK                        (0x4U)                                              /*!< DMA0_HRS.HRS2 Mask                      */
#define DMA_HRS_HRS2_SHIFT                       (2U)                                                /*!< DMA0_HRS.HRS2 Position                  */
#define DMA_HRS_HRS2(x)                          (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< DMA0_HRS.HRS2 Field                     */
#define DMA_HRS_HRS3_MASK                        (0x8U)                                              /*!< DMA0_HRS.HRS3 Mask                      */
#define DMA_HRS_HRS3_SHIFT                       (3U)                                                /*!< DMA0_HRS.HRS3 Position                  */
#define DMA_HRS_HRS3(x)                          (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< DMA0_HRS.HRS3 Field                     */
#define DMA_HRS_HRS4_MASK                        (0x10U)                                             /*!< DMA0_HRS.HRS4 Mask                      */
#define DMA_HRS_HRS4_SHIFT                       (4U)                                                /*!< DMA0_HRS.HRS4 Position                  */
#define DMA_HRS_HRS4(x)                          (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< DMA0_HRS.HRS4 Field                     */
#define DMA_HRS_HRS5_MASK                        (0x20U)                                             /*!< DMA0_HRS.HRS5 Mask                      */
#define DMA_HRS_HRS5_SHIFT                       (5U)                                                /*!< DMA0_HRS.HRS5 Position                  */
#define DMA_HRS_HRS5(x)                          (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< DMA0_HRS.HRS5 Field                     */
#define DMA_HRS_HRS6_MASK                        (0x40U)                                             /*!< DMA0_HRS.HRS6 Mask                      */
#define DMA_HRS_HRS6_SHIFT                       (6U)                                                /*!< DMA0_HRS.HRS6 Position                  */
#define DMA_HRS_HRS6(x)                          (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< DMA0_HRS.HRS6 Field                     */
#define DMA_HRS_HRS7_MASK                        (0x80U)                                             /*!< DMA0_HRS.HRS7 Mask                      */
#define DMA_HRS_HRS7_SHIFT                       (7U)                                                /*!< DMA0_HRS.HRS7 Position                  */
#define DMA_HRS_HRS7(x)                          (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< DMA0_HRS.HRS7 Field                     */
#define DMA_HRS_HRS8_MASK                        (0x100U)                                            /*!< DMA0_HRS.HRS8 Mask                      */
#define DMA_HRS_HRS8_SHIFT                       (8U)                                                /*!< DMA0_HRS.HRS8 Position                  */
#define DMA_HRS_HRS8(x)                          (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< DMA0_HRS.HRS8 Field                     */
#define DMA_HRS_HRS9_MASK                        (0x200U)                                            /*!< DMA0_HRS.HRS9 Mask                      */
#define DMA_HRS_HRS9_SHIFT                       (9U)                                                /*!< DMA0_HRS.HRS9 Position                  */
#define DMA_HRS_HRS9(x)                          (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< DMA0_HRS.HRS9 Field                     */
#define DMA_HRS_HRS10_MASK                       (0x400U)                                            /*!< DMA0_HRS.HRS10 Mask                     */
#define DMA_HRS_HRS10_SHIFT                      (10U)                                               /*!< DMA0_HRS.HRS10 Position                 */
#define DMA_HRS_HRS10(x)                         (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< DMA0_HRS.HRS10 Field                    */
#define DMA_HRS_HRS11_MASK                       (0x800U)                                            /*!< DMA0_HRS.HRS11 Mask                     */
#define DMA_HRS_HRS11_SHIFT                      (11U)                                               /*!< DMA0_HRS.HRS11 Position                 */
#define DMA_HRS_HRS11(x)                         (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< DMA0_HRS.HRS11 Field                    */
#define DMA_HRS_HRS12_MASK                       (0x1000U)                                           /*!< DMA0_HRS.HRS12 Mask                     */
#define DMA_HRS_HRS12_SHIFT                      (12U)                                               /*!< DMA0_HRS.HRS12 Position                 */
#define DMA_HRS_HRS12(x)                         (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< DMA0_HRS.HRS12 Field                    */
#define DMA_HRS_HRS13_MASK                       (0x2000U)                                           /*!< DMA0_HRS.HRS13 Mask                     */
#define DMA_HRS_HRS13_SHIFT                      (13U)                                               /*!< DMA0_HRS.HRS13 Position                 */
#define DMA_HRS_HRS13(x)                         (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< DMA0_HRS.HRS13 Field                    */
#define DMA_HRS_HRS14_MASK                       (0x4000U)                                           /*!< DMA0_HRS.HRS14 Mask                     */
#define DMA_HRS_HRS14_SHIFT                      (14U)                                               /*!< DMA0_HRS.HRS14 Position                 */
#define DMA_HRS_HRS14(x)                         (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< DMA0_HRS.HRS14 Field                    */
#define DMA_HRS_HRS15_MASK                       (0x8000U)                                           /*!< DMA0_HRS.HRS15 Mask                     */
#define DMA_HRS_HRS15_SHIFT                      (15U)                                               /*!< DMA0_HRS.HRS15 Position                 */
#define DMA_HRS_HRS15(x)                         (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< DMA0_HRS.HRS15 Field                    */
#define DMA_HRS_HRS16_MASK                       (0x10000U)                                          /*!< DMA0_HRS.HRS16 Mask                     */
#define DMA_HRS_HRS16_SHIFT                      (16U)                                               /*!< DMA0_HRS.HRS16 Position                 */
#define DMA_HRS_HRS16(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< DMA0_HRS.HRS16 Field                    */
#define DMA_HRS_HRS17_MASK                       (0x20000U)                                          /*!< DMA0_HRS.HRS17 Mask                     */
#define DMA_HRS_HRS17_SHIFT                      (17U)                                               /*!< DMA0_HRS.HRS17 Position                 */
#define DMA_HRS_HRS17(x)                         (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< DMA0_HRS.HRS17 Field                    */
#define DMA_HRS_HRS18_MASK                       (0x40000U)                                          /*!< DMA0_HRS.HRS18 Mask                     */
#define DMA_HRS_HRS18_SHIFT                      (18U)                                               /*!< DMA0_HRS.HRS18 Position                 */
#define DMA_HRS_HRS18(x)                         (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< DMA0_HRS.HRS18 Field                    */
#define DMA_HRS_HRS19_MASK                       (0x80000U)                                          /*!< DMA0_HRS.HRS19 Mask                     */
#define DMA_HRS_HRS19_SHIFT                      (19U)                                               /*!< DMA0_HRS.HRS19 Position                 */
#define DMA_HRS_HRS19(x)                         (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< DMA0_HRS.HRS19 Field                    */
#define DMA_HRS_HRS20_MASK                       (0x100000U)                                         /*!< DMA0_HRS.HRS20 Mask                     */
#define DMA_HRS_HRS20_SHIFT                      (20U)                                               /*!< DMA0_HRS.HRS20 Position                 */
#define DMA_HRS_HRS20(x)                         (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< DMA0_HRS.HRS20 Field                    */
#define DMA_HRS_HRS21_MASK                       (0x200000U)                                         /*!< DMA0_HRS.HRS21 Mask                     */
#define DMA_HRS_HRS21_SHIFT                      (21U)                                               /*!< DMA0_HRS.HRS21 Position                 */
#define DMA_HRS_HRS21(x)                         (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< DMA0_HRS.HRS21 Field                    */
#define DMA_HRS_HRS22_MASK                       (0x400000U)                                         /*!< DMA0_HRS.HRS22 Mask                     */
#define DMA_HRS_HRS22_SHIFT                      (22U)                                               /*!< DMA0_HRS.HRS22 Position                 */
#define DMA_HRS_HRS22(x)                         (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< DMA0_HRS.HRS22 Field                    */
#define DMA_HRS_HRS23_MASK                       (0x800000U)                                         /*!< DMA0_HRS.HRS23 Mask                     */
#define DMA_HRS_HRS23_SHIFT                      (23U)                                               /*!< DMA0_HRS.HRS23 Position                 */
#define DMA_HRS_HRS23(x)                         (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< DMA0_HRS.HRS23 Field                    */
#define DMA_HRS_HRS24_MASK                       (0x1000000U)                                        /*!< DMA0_HRS.HRS24 Mask                     */
#define DMA_HRS_HRS24_SHIFT                      (24U)                                               /*!< DMA0_HRS.HRS24 Position                 */
#define DMA_HRS_HRS24(x)                         (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< DMA0_HRS.HRS24 Field                    */
#define DMA_HRS_HRS25_MASK                       (0x2000000U)                                        /*!< DMA0_HRS.HRS25 Mask                     */
#define DMA_HRS_HRS25_SHIFT                      (25U)                                               /*!< DMA0_HRS.HRS25 Position                 */
#define DMA_HRS_HRS25(x)                         (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< DMA0_HRS.HRS25 Field                    */
#define DMA_HRS_HRS26_MASK                       (0x4000000U)                                        /*!< DMA0_HRS.HRS26 Mask                     */
#define DMA_HRS_HRS26_SHIFT                      (26U)                                               /*!< DMA0_HRS.HRS26 Position                 */
#define DMA_HRS_HRS26(x)                         (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< DMA0_HRS.HRS26 Field                    */
#define DMA_HRS_HRS27_MASK                       (0x8000000U)                                        /*!< DMA0_HRS.HRS27 Mask                     */
#define DMA_HRS_HRS27_SHIFT                      (27U)                                               /*!< DMA0_HRS.HRS27 Position                 */
#define DMA_HRS_HRS27(x)                         (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< DMA0_HRS.HRS27 Field                    */
#define DMA_HRS_HRS28_MASK                       (0x10000000U)                                       /*!< DMA0_HRS.HRS28 Mask                     */
#define DMA_HRS_HRS28_SHIFT                      (28U)                                               /*!< DMA0_HRS.HRS28 Position                 */
#define DMA_HRS_HRS28(x)                         (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< DMA0_HRS.HRS28 Field                    */
#define DMA_HRS_HRS29_MASK                       (0x20000000U)                                       /*!< DMA0_HRS.HRS29 Mask                     */
#define DMA_HRS_HRS29_SHIFT                      (29U)                                               /*!< DMA0_HRS.HRS29 Position                 */
#define DMA_HRS_HRS29(x)                         (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< DMA0_HRS.HRS29 Field                    */
#define DMA_HRS_HRS30_MASK                       (0x40000000U)                                       /*!< DMA0_HRS.HRS30 Mask                     */
#define DMA_HRS_HRS30_SHIFT                      (30U)                                               /*!< DMA0_HRS.HRS30 Position                 */
#define DMA_HRS_HRS30(x)                         (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< DMA0_HRS.HRS30 Field                    */
#define DMA_HRS_HRS31_MASK                       (0x80000000U)                                       /*!< DMA0_HRS.HRS31 Mask                     */
#define DMA_HRS_HRS31_SHIFT                      (31U)                                               /*!< DMA0_HRS.HRS31 Position                 */
#define DMA_HRS_HRS31(x)                         (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< DMA0_HRS.HRS31 Field                    */
/* ------- DCHPRI Bit Fields                        ------ */
#define DMA_DCHPRI_CHPRI_MASK                    (0xFU)                                              /*!< DMA0_DCHPRI.CHPRI Mask                  */
#define DMA_DCHPRI_CHPRI_SHIFT                   (0U)                                                /*!< DMA0_DCHPRI.CHPRI Position              */
#define DMA_DCHPRI_CHPRI(x)                      (((uint8_t)(((uint8_t)(x))<<0U))&0xFUL)             /*!< DMA0_DCHPRI.CHPRI Field                 */
#define DMA_DCHPRI_GRPPRI_MASK                   (0x30U)                                             /*!< DMA0_DCHPRI.GRPPRI Mask                 */
#define DMA_DCHPRI_GRPPRI_SHIFT                  (4U)                                                /*!< DMA0_DCHPRI.GRPPRI Position             */
#define DMA_DCHPRI_GRPPRI(x)                     (((uint8_t)(((uint8_t)(x))<<4U))&0x30UL)            /*!< DMA0_DCHPRI.GRPPRI Field                */
#define DMA_DCHPRI_DPA_MASK                      (0x40U)                                             /*!< DMA0_DCHPRI.DPA Mask                    */
#define DMA_DCHPRI_DPA_SHIFT                     (6U)                                                /*!< DMA0_DCHPRI.DPA Position                */
#define DMA_DCHPRI_DPA(x)                        (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< DMA0_DCHPRI.DPA Field                   */
#define DMA_DCHPRI_ECP_MASK                      (0x80U)                                             /*!< DMA0_DCHPRI.ECP Mask                    */
#define DMA_DCHPRI_ECP_SHIFT                     (7U)                                                /*!< DMA0_DCHPRI.ECP Position                */
#define DMA_DCHPRI_ECP(x)                        (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< DMA0_DCHPRI.ECP Field                   */
