podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
 * DMA multiplexor slot (source) numbers
 */
typedef enum DmaSlot {
   Dma0Slot_Disabled                   =        0, //!<  Disabled
   Dma0Slot_Slot1                      =        1, //!<  Slot1
   Dma0Slot_Slot2                      =        2, //!<  Slot2
   Dma0Slot_Slot3                      =        3, //!<  Slot3
   Dma0Slot_Slot4                      =        4, //!<  Slot4
   Dma0Slot_Slot5                      =        5, //!<  Slot5
   Dma0Slot_Slot6                      =        6, //!<  Slot6
   Dma0Slot_Slot7                      =        7, //!<  Slot7
   Dma0Slot_Slot8                      =        8, //!<  Slot8
   Dma0Slot_Slot9                      =        9, //!<  Slot9
   Dma0Slot_Slot10                     =       10, //!<  Slot10
   Dma0Slot_Slot11                     =       11, //!<  Slot11
   Dma0Slot_Slot12                     =       12, //!<  Slot12
   Dma0Slot_Slot13                     =       13, //!<  Slot13
   Dma0Slot_Slot14                     =       14, //!<  Slot14
   Dma0Slot_Slot15                     =       15, //!<  Slot15
   Dma0Slot_Slot16                     =       16, //!<  Slot16
   Dma0Slot_Slot17                     =       17, //!<  Slot17
   Dma0Slot_Slot18                     =       18, //!<  Slot18
   Dma0Slot_Slot19                     =       19, //!<  Slot19
   Dma0Slot_Slot20                     =       20, //!<  Slot20
   Dma0Slot_Slot21                     =       21, //!<  Slot21
   Dma0Slot_Slot22                     =       22, //!<  Slot22
   Dma0Slot_Slot23                     =       23, //!<  Slot23
   Dma0Slot_Slot24                     =       24, //!<  Slot24
   Dma0Slot_Slot25                     =       25, //!<  Slot25
   Dma0Slot_Slot26                     =       26, //!<  Slot26
   Dma0Slot_Slot27                     =       27, //!<  Slot27
   Dma0Slot_Slot28                     =       28, //!<  Slot28
   Dma0Slot_Slot29                     =       29, //!<  Slot29
   Dma0Slot_Slot30                     =       30, //!<  Slot30
   Dma0Slot_Slot31                     =       31, //!<  Slot31
   Dma0Slot_Slot32                     =       32, //!<  Slot32
   Dma0Slot_Slot33                     =       33, //!<  Slot33
   Dma0Slot_Slot34                     =       34, //!<  Slot34
   Dma0Slot_Slot35                     =       35, //!<  Slot35
   Dma0Slot_Slot36                     =       36, //!<  Slot36
   Dma0Slot_Slot37                     =       37, //!<  Slot37
   Dma0Slot_Slot38                     =       38, //!<  Slot38
   Dma0Slot_Slot39                     =       39, //!<  Slot39
   Dma0Slot_Slot40                     =       40, //!<  Slot40
   Dma0Slot_Slot41                     =       41, //!<  Slot41
   Dma0Slot_Slot42                     =       42, //!<  Slot42
   Dma0Slot_Slot43                     =       43, //!<  Slot43
   Dma0Slot_Slot44                     =       44, //!<  Slot44
   Dma0Slot_Slot45                     =       45, //!<  Slot45
   Dma0Slot_Slot46                     =       46, //!<  Slot46
   Dma0Slot_Slot47                     =       47, //!<  Slot47
   Dma0Slot_Slot48                     =       48, //!<  Slot48
   Dma0Slot_Slot49                     =       49, //!<  Slot49
   Dma0Slot_Slot50                     =       50, //!<  Slot50
   Dma0Slot_Slot51                     =       51, //!<  Slot51
   Dma0Slot_Slot52                     =       52, //!<  Slot52
   Dma0Slot_Slot53                     =       53, //!<  Slot53
   Dma0Slot_Slot54                     =       54, //!<  Slot54
   Dma0Slot_Slot55                     =       55, //!<  Slot55
   Dma0Slot_Slot56                     =       56, //!<  Slot56
   Dma0Slot_Slot57                     =       57, //!<  Slot57
   Dma0Slot_Slot58                     =       58, //!<  Slot58
   Dma0Slot_Slot59                     =       59, //!<  Slot59
   Dma0Slot_AlwaysEnabled60            =       60, //!<  AlwaysEnabled60
   Dma0Slot_AlwaysEnabled61            =       61, //!<  AlwaysEnabled61
   Dma0Slot_AlwaysEnabled62            =       62, //!<  AlwaysEnabled62
   Dma0Slot_AlwaysEnabled63            =       63, //!<  AlwaysEnabled63
   Dma1Slot_Disabled                   =        0, //!<  Disabled
   Dma1Slot_Slot1                      =        1, //!<  Slot1
   Dma1Slot_Slot2                      =        2, //!<  Slot2
   Dma1Slot_Slot3                      =        3, //!<  Slot3
   Dma1Slot_Slot4                      =        4, //!<  Slot4
   Dma1Slot_Slot5                      =        5, //!<  Slot5
   Dma1Slot_Slot6                      =        6, //!<  Slot6
   Dma1Slot_Slot7                      =        7, //!<  Slot7
   Dma1Slot_Slot8                      =        8, //!<  Slot8
   Dma1Slot_Slot9                      =        9, //!<  Slot9
   Dma1Slot_Slot10                     =       10, //!<  Slot10
   Dma1Slot_Slot11                     =       11, //!<  Slot11
   Dma1Slot_Slot12                     =       12, //!<  Slot12
   Dma1Slot_Slot13                     =       13, //!<  Slot13
   Dma1Slot_Slot14                     =       14, //!<  Slot14
   Dma1Slot_Slot15                     =       15, //!<  Slot15
   Dma1Slot_Slot16                     =       16, //!<  Slot16
   Dma1Slot_Slot17                     =       17, //!<  Slot17
   Dma1Slot_Slot18                     =       18, //!<  Slot18
   Dma1Slot_Slot19                     =       19, //!<  Slot19
   Dma1Slot_Slot20                     =       20, //!<  Slot20
   Dma1Slot_Slot21                     =       21, //!<  Slot21
   Dma1Slot_Slot22                     =       22, //!<  Slot22
   Dma1Slot_Slot23                     =       23, //!<  Slot23
   Dma1Slot_Slot24                     =       24, //!<  Slot24
   Dma1Slot_Slot25                     =       25, //!<  Slot25
   Dma1Slot_Slot26                     =       26, //!<  Slot26
   Dma1Slot_Slot27                     =       27, //!<  Slot27
   Dma1Slot_Slot28                     =       28, //!<  Slot28
   Dma1Slot_Slot29                     =       29, //!<  Slot29
   Dma1Slot_Slot30                     =       30, //!<  Slot30
   Dma1Slot_Slot31                     =       31, //!<  Slot31
   Dma1Slot_Slot32                     =       32, //!<  Slot32
   Dma1Slot_Slot33                     =       33, //!<  Slot33
   Dma1Slot_Slot34                     =       34, //!<  Slot34
   Dma1Slot_Slot35                     =       35, //!<  Slot35
   Dma1Slot_Slot36                     =       36, //!<  Slot36
   Dma1Slot_Slot37                     =       37, //!<  Slot37
   Dma1Slot_Slot38                     =       38, //!<  Slot38
   Dma1Slot_Slot39                     =       39, //!<  Slot39
   Dma1Slot_Slot40                     =       40, //!<  Slot40
   Dma1Slot_Slot41                     =       41, //!<  Slot41
   Dma1Slot_Slot42                     =       42, //!<  Slot42
   Dma1Slot_Slot43                     =       43, //!<  Slot43
   Dma1Slot_Slot44                     =       44, //!<  Slot44
   Dma1Slot_Slot45                     =       45, //!<  Slot45
   Dma1Slot_Slot46                     =       46, //!<  Slot46
   Dma1Slot_Slot47                     =       47, //!<  Slot47
   Dma1Slot_Slot48                     =       48, //!<  Slot48
   Dma1Slot_Slot49                     =       49, //!<  Slot49
   Dma1Slot_Slot50                     =       50, //!<  Slot50
   Dma1Slot_Slot51                     =       51, //!<  Slot51
   Dma1Slot_Slot52                     =       52, //!<  Slot52
   Dma1Slot_Slot53                     =       53, //!<  Slot53
   Dma1Slot_Slot54                     =       54, //!<  Slot54
   Dma1Slot_Slot55                     =       55, //!<  Slot55
   Dma1Slot_Slot56                     =       56, //!<  Slot56
   Dma1Slot_Slot57                     =       57, //!<  Slot57
   Dma1Slot_Slot58                     =       58, //!<  Slot58
   Dma1Slot_Slot59                     =       59, //!<  Slot59
   Dma1Slot_AlwaysEnabled60            =       60, //!<  AlwaysEnabled60
   Dma1Slot_AlwaysEnabled61            =       61, //!<  AlwaysEnabled61
   Dma1Slot_AlwaysEnabled62            =       62, //!<  AlwaysEnabled62
   Dma1Slot_AlwaysEnabled63            =       63, //!<  AlwaysEnabled63
} DmaSlot;

/**
 * @} */ /* End group DMAMUX_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup DMAMUX_Peripheral_access_layer_GROUP DMAMUX Peripheral Access Layer
* @brief C Struct for DMAMUX
* @{
*/

/* ================================================================================ */
/* ================           DMAMUX1 (derived from DMAMUX0)       ================ */
/* ================================================================================ */

/**
 * @brief DMA channel multiplexor
 */

/* DMAMUX1 - Peripheral instance base addresses */
#define DMAMUX1_BasePtr                0x40022000UL //!< Peripheral base address
#define DMAMUX1                        ((DMAMUX_Type *) DMAMUX1_BasePtr) //!< Freescale base pointer
#define DMAMUX1_BASE_PTR               (DMAMUX1) //!< Freescale style base pointer
/**
 * @} */ /* End group DMAMUX_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup DRY_Peripheral_access_layer_GROUP DRY Peripheral Access Layer
* @brief C Struct for DRY
* @{
*/

/* ================================================================================ */
/* ================           DRY (file:DRY_8IN)                   ================ */
/* ================================================================================ */

/**
 * @brief Tamper Detect and Secure Key Storage
 */
/**
* @addtogroup DRY_structs_GROUP DRY struct
* @brief Struct for DRY
* @{
*/
typedef struct DRY_Type {
        uint8_t   RESERVED_0[4];                /**< 0000: 0x4 bytes                                                    */
   __IO uint32_t  SKVR;                         /**< 0004: DryIce Secure Key Valid Register                             */
   __IO uint32_t  SKWLR;                        /**< 0008: DryIce Secure Key Write Lock Register                        */
   __IO uint32_t  SKRLR;                        /**< 000C: DryIce Secure Key Read Lock Register                         */
   __IO uint32_t  CR;                           /**< 0010: DryIce Control Register                                      */
   __IO uint32_t  SR;                           /**< 0014: DryIce Status Register                                       */
   __IO uint32_t  LR;                           /**< 0018: DryIce Lock Register                                         */
   __IO uint32_t  IER;                          /**< 001C: DryIce Interrupt Enable Register                             */
   __IO uint32_t  TSR;                          /**< 0020: DryIce Tamper Seconds Register                               */
   __IO uint32_t  TER;                          /**< 0024: DryIce Tamper Enable Register                                */
   __IO uint32_t  PDR;                          /**< 0028: DryIce Pin Direction Register                                */
   __IO uint32_t  PPR;                          /**< 002C: DryIce Pin Polarity Register                                 */
   __IO uint32_t  ATR[2];                       /**< 0030: DryIce Active Tamper Register                                */
        uint8_t   RESERVED_1[8];                /**< 0038: 0x8 bytes                                                    */
   __IO uint32_t  PGFR[8];                      /**< 0040: DryIce Pin Glitch Filter Register                            */
        uint8_t   RESERVED_2[1952];             /**< 0060: 0x7A0 bytes                                                  */
   __IO uint32_t  WAC;                          /**< 0800: DryIce Write Access Control Register                         */
   __IO uint32_t  RAC;                          /**< 0804: DryIce Read Access Control Register                          */
        uint8_t   RESERVED_3[2040];             /**< 0808: 0x7F8 bytes                                                  */
   __IO uint32_t  SKR[8];                       /**< 1000: Secure Key Register                                          */
        uint8_t   RESERVED_4[2016];             /**< 1020: 0x7E0 bytes                                                  */
   __IO uint32_t  SWAC;                         /**< 1800: Secure Write Access Control                                  */
   __IO uint32_t  SRAC;                         /**< 1804: Secure Read Access Control                                   */
} DRY_Type;

/**
 * @} */ /* End group DRY_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'DRY' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

