podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
 * @brief Ethernet MAC-NET Core
 */
/**
* @addtogroup ENET_structs_GROUP ENET struct
* @brief Struct for ENET
* @{
*/
typedef struct ENET_Type {
        uint8_t   RESERVED_0[4];                /**< 0000: 0x4 bytes                                                    */
   __IO uint32_t  EIR;                          /**< 0004: Interrupt Event Register                                     */
   __IO uint32_t  EIMR;                         /**< 0008: Interrupt Mask Register                                      */
        uint8_t   RESERVED_1[4];                /**< 000C: 0x4 bytes                                                    */
   __IO uint32_t  RDAR;                         /**< 0010: Receive Descriptor Active Register                           */
   __IO uint32_t  TDAR;                         /**< 0014: Transmit Descriptor Active Register                          */
        uint8_t   RESERVED_2[12];               /**< 0018: 0xC bytes                                                    */
   __IO uint32_t  ECR;                          /**< 0024: Ethernet Control Register                                    */
        uint8_t   RESERVED_3[24];               /**< 0028: 0x18 bytes                                                   */
   __IO uint32_t  MMFR;                         /**< 0040: MII Management Frame Register                                */
   __IO uint32_t  MSCR;                         /**< 0044: MII Speed Control Register                                   */
        uint8_t   RESERVED_4[28];               /**< 0048: 0x1C bytes                                                   */
   __IO uint32_t  MIBC;                         /**< 0064: MIB Control Register                                         */
        uint8_t   RESERVED_5[28];               /**< 0068: 0x1C bytes                                                   */
   __IO uint32_t  RCR;                          /**< 0084: Receive Control Register                                     */
        uint8_t   RESERVED_6[60];               /**< 0088: 0x3C bytes                                                   */
   __IO uint32_t  TCR;                          /**< 00C4: Transmit Control Register                                    */
        uint8_t   RESERVED_7[28];               /**< 00C8: 0x1C bytes                                                   */
   __IO uint32_t  PALR;                         /**< 00E4: Physical Address Lower Register                              */
   __IO uint32_t  PAUR;                         /**< 00E8: Physical Address Upper Register                              */
   __IO uint32_t  OPD;                          /**< 00EC: Opcode/Pause Duration Register                               */
        uint8_t   RESERVED_8[40];               /**< 00F0: 0x28 bytes                                                   */
   __IO uint32_t  IAUR;                         /**< 0118: Descriptor Individual Upper Address Register                 */
   __IO uint32_t  IALR;                         /**< 011C: Descriptor Individual Lower Address Register                 */
   __IO uint32_t  GAUR;                         /**< 0120: Descriptor Group Upper Address Register                      */
   __IO uint32_t  GALR;                         /**< 0124: Descriptor Group Lower Address Register                      */
        uint8_t   RESERVED_9[28];               /**< 0128: 0x1C bytes                                                   */
   __IO uint32_t  TFWR;                         /**< 0144: Transmit FIFO Watermark Register                             */
        uint8_t   RESERVED_10[56];              /**< 0148: 0x38 bytes                                                   */
   __IO uint32_t  RDSR;                         /**< 0180: Receive Descriptor Ring Start Register                       */
   __IO uint32_t  TDSR;                         /**< 0184: Transmit Buffer Descriptor Ring Start Register               */
   __IO uint32_t  MRBR;                         /**< 0188: Maximum Receive Buffer Size Register                         */
        uint8_t   RESERVED_11[4];               /**< 018C: 0x4 bytes                                                    */
   __IO uint32_t  RSFL;                         /**< 0190: Receive FIFO Section Full Threshold                          */
   __IO uint32_t  RSEM;                         /**< 0194: Receive FIFO Section Empty Threshold                         */
   __IO uint32_t  RAEM;                         /**< 0198: Receive FIFO Almost Empty Threshold                          */
   __IO uint32_t  RAFL;                         /**< 019C: Receive FIFO Almost Full Threshold                           */
   __IO uint32_t  TSEM;                         /**< 01A0: Transmit FIFO Section Empty Threshold                        */
   __IO uint32_t  TAEM;                         /**< 01A4: Transmit FIFO Almost Empty Threshold                         */
   __IO uint32_t  TAFL;                         /**< 01A8: Transmit FIFO Almost Full Threshold                          */
   __IO uint32_t  TIPG;                         /**< 01AC: Transmit Inter-Packet Gap                                    */
   __IO uint32_t  FTRL;                         /**< 01B0: Frame Truncation Length                                      */
        uint8_t   RESERVED_12[12];              /**< 01B4: 0xC bytes                                                    */
   __IO uint32_t  TACC;                         /**< 01C0: Transmit Accelerator Function Configuration                  */
   __IO uint32_t  RACC;                         /**< 01C4: Receive Accelerator Function Configuration                   */
        uint8_t   RESERVED_13[56];              /**< 01C8: 0x38 bytes                                                   */
   __I  uint32_t  RMON_T_DROP;                  /**< 0200: Reserved Statistic Register                                  */
   __I  uint32_t  RMON_T_PACKETS;               /**< 0204: RMON Tx packet count                                         */
   __I  uint32_t  RMON_T_BC_PKT;                /**< 0208: Tx Broadcast Packets Statistic Register                      */
   __I  uint32_t  RMON_T_MC_PKT;                /**< 020C: Tx Multicast Packets Statistic Register                      */
   __I  uint32_t  RMON_T_CRC_ALIGN;             /**< 0210: Tx Packets with CRC/Align Error Statistic Register           */
   __I  uint32_t  RMON_T_UNDERSIZE;             /**< 0214: Tx Packets Less Than Bytes and Good CRC Statistic Register   */
   __I  uint32_t  RMON_T_OVERSIZE;              /**< 0218: Tx Packets GT MAX_FL bytes and Good CRC Statistic Register   */
   __I  uint32_t  RMON_T_FRAG;                  /**< 021C: Tx Packets Less Than 64 Bytes and Bad CRC Statistic Register */
   __I  uint32_t  RMON_T_JAB;                   /**< 0220: Tx Packets Greater Than MAX_FL bytes and Bad CRC Statistic Register */
   __I  uint32_t  RMON_T_COL;                   /**< 0224: Tx Collision Count Statistic Register                        */
   __I  uint32_t  RMON_T_P64;                   /**< 0228: Tx 64-Byte Packets Statistic Register                        */
   __I  uint32_t  RMON_T_P65TO127;              /**< 022C: Tx 65- to 127-byte Packets Statistic Register                */
   __I  uint32_t  RMON_T_P128TO255;             /**< 0230: Tx 128- to 255-byte Packets Statistic Register               */
   __I  uint32_t  RMON_T_P256TO511;             /**< 0234: Tx 256- to 511-byte Packets Statistic Register               */
   __I  uint32_t  RMON_T_P512TO1023;            /**< 0238: Tx 512- to 1023-byte Packets Statistic Register              */
   __I  uint32_t  RMON_T_P1024TO2047;           /**< 023C: Tx 1024- to 2047-byte Packets Statistic Register             */
   __I  uint32_t  RMON_T_P_GTE2048;             /**< 0240: Tx Packets Greater Than 2048 Bytes Statistic Register        */
   __I  uint32_t  RMON_T_OCTETS;                /**< 0244: Tx Octets Statistic Register                                 */
   __I  uint32_t  IEEE_T_DROP;                  /**< 0248: Reserved Statistic Register                                  */
   __I  uint32_t  IEEE_T_FRAME_OK;              /**< 024C: Frames Transmitted OK Statistic Register                     */
   __I  uint32_t  IEEE_T_1COL;                  /**< 0250: Frames Transmitted with Single Collision Statistic Register  */
   __I  uint32_t  IEEE_T_MCOL;                  /**< 0254: Frames Transmitted with Multiple Collisions Statistic Register */
   __I  uint32_t  IEEE_T_DEF;                   /**< 0258: Frames Transmitted after Deferral Delay Statistic Register   */
   __I  uint32_t  IEEE_T_LCOL;                  /**< 025C: Frames Transmitted with Late Collision Statistic Register    */
   __I  uint32_t  IEEE_T_EXCOL;                 /**< 0260: Frames Transmitted with Excessive Collisions Statistic Register */
   __I  uint32_t  IEEE_T_MACERR;                /**< 0264: Frames Transmitted with Tx FIFO Underrun Statistic Register  */
   __I  uint32_t  IEEE_T_CSERR;                 /**< 0268: Frames Transmitted with Carrier Sense Error Statistic Register */
   __I  uint32_t  IEEE_T_SQE;                   /**< 026C: Reserved Statistic Register                                  */
   __I  uint32_t  IEEE_T_FDXFC;                 /**< 0270: Flow Control Pause Frames Transmitted Statistic Register     */
   __I  uint32_t  IEEE_T_OCTETS_OK;             /**< 0274: Octet Count for Frames Transmitted w/o Error Statistic Register */
        uint8_t   RESERVED_14[12];              /**< 0278: 0xC bytes                                                    */
   __I  uint32_t  RMON_R_PACKETS;               /**< 0284: Rx Packet Count Statistic Register                           */
   __I  uint32_t  RMON_R_BC_PKT;                /**< 0288: Rx Broadcast Packets Statistic Register                      */
   __I  uint32_t  RMON_R_MC_PKT;                /**< 028C: Rx Multicast Packets Statistic Register                      */
   __I  uint32_t  RMON_R_CRC_ALIGN;             /**< 0290: Rx Packets with CRC/Align Error Statistic Register           */
   __I  uint32_t  RMON_R_UNDERSIZE;             /**< 0294: Rx Packets with Less Than 64 Bytes and Good CRC Statistic Register */
   __I  uint32_t  RMON_R_OVERSIZE;              /**< 0298: Rx Packets Greater Than MAX_FL and Good CRC Statistic Register */
   __I  uint32_t  RMON_R_FRAG;                  /**< 029C: Rx Packets Less Than 64 Bytes and Bad CRC Statistic Register */
   __I  uint32_t  RMON_R_JAB;                   /**< 02A0: Rx Packets Greater Than MAX_FL Bytes and Bad CRC Statistic Register */
   __I  uint32_t  RMON_R_RESVD_0;               /**< 02A4: Reserved Statistic Register                                  */
   __I  uint32_t  RMON_R_P64;                   /**< 02A8: Rx 64-Byte Packets Statistic Register                        */
   __I  uint32_t  RMON_R_P65TO127;              /**< 02AC: Rx 65- to 127-Byte Packets Statistic Register                */
   __I  uint32_t  RMON_R_P128TO255;             /**< 02B0: Rx 128- to 255-Byte Packets Statistic Register               */
   __I  uint32_t  RMON_R_P256TO511;             /**< 02B4: Rx 256- to 511-Byte Packets Statistic Register               */
   __I  uint32_t  RMON_R_P512TO1023;            /**< 02B8: Rx 512- to 1023-Byte Packets Statistic Register              */
   __I  uint32_t  RMON_R_P1024TO2047;           /**< 02BC: Rx 1024- to 2047-Byte Packets Statistic Register             */
   __I  uint32_t  RMON_R_P_GTE2048;             /**< 02C0: Rx Packets Greater than 2048 Bytes Statistic Register        */
   __I  uint32_t  RMON_R_OCTETS;                /**< 02C4: Rx Octets Statistic Register                                 */
   __I  uint32_t  IEEE_R_DROP;                  /**< 02C8: Frames not Counted Correctly Statistic Register              */
   __I  uint32_t  IEEE_R_FRAME_OK;              /**< 02CC: Frames Received OK Statistic Register                        */
   __I  uint32_t  IEEE_R_CRC;                   /**< 02D0: Frames Received with CRC Error Statistic Register            */
   __I  uint32_t  IEEE_R_ALIGN;                 /**< 02D4: Frames Received with Alignment Error Statistic Register      */
   __I  uint32_t  IEEE_R_MACERR;                /**< 02D8: Receive FIFO Overflow Count Statistic Register               */
   __I  uint32_t  IEEE_R_FDXFC;                 /**< 02DC: Flow Control Pause Frames Received Statistic Register        */
   __I  uint32_t  IEEE_R_OCTETS_OK;             /**< 02E0: Octet Count for Frames Received without Error Statistic Register */
        uint8_t   RESERVED_15[284];             /**< 02E4: 0x11C bytes                                                  */
   __IO uint32_t  ATCR;                         /**< 0400: Adjustable Timer Control Register                            */
   __IO uint32_t  ATVR;                         /**< 0404: Timer Value Register                                         */
   __IO uint32_t  ATOFF;                        /**< 0408: Timer Offset Register                                        */
   __IO uint32_t  ATPER;                        /**< 040C: Timer Period Register                                        */
   __IO uint32_t  ATCOR;                        /**< 0410: Timer Correction Register                                    */
   __IO uint32_t  ATINC;                        /**< 0414: Time-Stamping Clock Period Register                          */
   __I  uint32_t  ATSTMP;                       /**< 0418: Timestamp of Last Transmitted Frame                          */
        uint8_t   RESERVED_16[488];             /**< 041C: 0x1E8 bytes                                                  */
   __IO uint32_t  TGSR;                         /**< 0604: Timer Global Status Register                                 */
   __IO uint32_t  TCSR0;                        /**< 0608: Timer Control Status Register                                */
   __IO uint32_t  TCCR0;                        /**< 060C: Timer Compare Capture Register                               */
   __IO uint32_t  TCSR1;                        /**< 0610: Timer Control Status Register                                */
   __IO uint32_t  TCCR1;                        /**< 0614: Timer Compare Capture Register                               */
   __IO uint32_t  TCSR2;                        /**< 0618: Timer Control Status Register                                */
   __IO uint32_t  TCCR2;                        /**< 061C: Timer Compare Capture Register                               */
   __IO uint32_t  TCSR3;                        /**< 0620: Timer Control Status Register                                */
   __IO uint32_t  TCCR3;                        /**< 0624: Timer Compare Capture Register                               */
} ENET_Type;

/**
 * @} */ /* End group ENET_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'ENET' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

