podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
* @addtogroup ENET_Register_Masks_GROUP ENET Register Masks
* @brief Register Masks for ENET
* @{
*/
/* ------- EIR Bit Fields                           ------ */
#define ENET_EIR_TS_TIMER_MASK                   (0x8000U)                                           /*!< ENET_EIR.TS_TIMER Mask                  */
#define ENET_EIR_TS_TIMER_SHIFT                  (15U)                                               /*!< ENET_EIR.TS_TIMER Position              */
#define ENET_EIR_TS_TIMER(x)                     (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< ENET_EIR.TS_TIMER Field                 */
#define ENET_EIR_TS_AVAIL_MASK                   (0x10000U)                                          /*!< ENET_EIR.TS_AVAIL Mask                  */
#define ENET_EIR_TS_AVAIL_SHIFT                  (16U)                                               /*!< ENET_EIR.TS_AVAIL Position              */
#define ENET_EIR_TS_AVAIL(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< ENET_EIR.TS_AVAIL Field                 */
#define ENET_EIR_WAKEUP_MASK                     (0x20000U)                                          /*!< ENET_EIR.WAKEUP Mask                    */
#define ENET_EIR_WAKEUP_SHIFT                    (17U)                                               /*!< ENET_EIR.WAKEUP Position                */
#define ENET_EIR_WAKEUP(x)                       (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< ENET_EIR.WAKEUP Field                   */
#define ENET_EIR_PLR_MASK                        (0x40000U)                                          /*!< ENET_EIR.PLR Mask                       */
#define ENET_EIR_PLR_SHIFT                       (18U)                                               /*!< ENET_EIR.PLR Position                   */
#define ENET_EIR_PLR(x)                          (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< ENET_EIR.PLR Field                      */
#define ENET_EIR_UN_MASK                         (0x80000U)                                          /*!< ENET_EIR.UN Mask                        */
#define ENET_EIR_UN_SHIFT                        (19U)                                               /*!< ENET_EIR.UN Position                    */
#define ENET_EIR_UN(x)                           (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< ENET_EIR.UN Field                       */
#define ENET_EIR_RL_MASK                         (0x100000U)                                         /*!< ENET_EIR.RL Mask                        */
#define ENET_EIR_RL_SHIFT                        (20U)                                               /*!< ENET_EIR.RL Position                    */
#define ENET_EIR_RL(x)                           (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< ENET_EIR.RL Field                       */
#define ENET_EIR_LC_MASK                         (0x200000U)                                         /*!< ENET_EIR.LC Mask                        */
#define ENET_EIR_LC_SHIFT                        (21U)                                               /*!< ENET_EIR.LC Position                    */
#define ENET_EIR_LC(x)                           (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< ENET_EIR.LC Field                       */
#define ENET_EIR_EBERR_MASK                      (0x400000U)                                         /*!< ENET_EIR.EBERR Mask                     */
#define ENET_EIR_EBERR_SHIFT                     (22U)                                               /*!< ENET_EIR.EBERR Position                 */
#define ENET_EIR_EBERR(x)                        (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< ENET_EIR.EBERR Field                    */
#define ENET_EIR_MII_MASK                        (0x800000U)                                         /*!< ENET_EIR.MII Mask                       */
#define ENET_EIR_MII_SHIFT                       (23U)                                               /*!< ENET_EIR.MII Position                   */
#define ENET_EIR_MII(x)                          (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< ENET_EIR.MII Field                      */
#define ENET_EIR_RXB_MASK                        (0x1000000U)                                        /*!< ENET_EIR.RXB Mask                       */
#define ENET_EIR_RXB_SHIFT                       (24U)                                               /*!< ENET_EIR.RXB Position                   */
#define ENET_EIR_RXB(x)                          (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< ENET_EIR.RXB Field                      */
#define ENET_EIR_RXF_MASK                        (0x2000000U)                                        /*!< ENET_EIR.RXF Mask                       */
#define ENET_EIR_RXF_SHIFT                       (25U)                                               /*!< ENET_EIR.RXF Position                   */
#define ENET_EIR_RXF(x)                          (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< ENET_EIR.RXF Field                      */
#define ENET_EIR_TXB_MASK                        (0x4000000U)                                        /*!< ENET_EIR.TXB Mask                       */
#define ENET_EIR_TXB_SHIFT                       (26U)                                               /*!< ENET_EIR.TXB Position                   */
#define ENET_EIR_TXB(x)                          (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< ENET_EIR.TXB Field                      */
#define ENET_EIR_TXF_MASK                        (0x8000000U)                                        /*!< ENET_EIR.TXF Mask                       */
#define ENET_EIR_TXF_SHIFT                       (27U)                                               /*!< ENET_EIR.TXF Position                   */
#define ENET_EIR_TXF(x)                          (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< ENET_EIR.TXF Field                      */
#define ENET_EIR_GRA_MASK                        (0x10000000U)                                       /*!< ENET_EIR.GRA Mask                       */
#define ENET_EIR_GRA_SHIFT                       (28U)                                               /*!< ENET_EIR.GRA Position                   */
#define ENET_EIR_GRA(x)                          (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< ENET_EIR.GRA Field                      */
#define ENET_EIR_BABT_MASK                       (0x20000000U)                                       /*!< ENET_EIR.BABT Mask                      */
#define ENET_EIR_BABT_SHIFT                      (29U)                                               /*!< ENET_EIR.BABT Position                  */
#define ENET_EIR_BABT(x)                         (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< ENET_EIR.BABT Field                     */
#define ENET_EIR_BABR_MASK                       (0x40000000U)                                       /*!< ENET_EIR.BABR Mask                      */
#define ENET_EIR_BABR_SHIFT                      (30U)                                               /*!< ENET_EIR.BABR Position                  */
#define ENET_EIR_BABR(x)                         (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< ENET_EIR.BABR Field                     */
/* ------- EIMR Bit Fields                          ------ */
#define ENET_EIMR_TS_TIMER_MASK                  (0x8000U)                                           /*!< ENET_EIMR.TS_TIMER Mask                 */
#define ENET_EIMR_TS_TIMER_SHIFT                 (15U)                                               /*!< ENET_EIMR.TS_TIMER Position             */
#define ENET_EIMR_TS_TIMER(x)                    (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< ENET_EIMR.TS_TIMER Field                */
#define ENET_EIMR_TS_AVAIL_MASK                  (0x10000U)                                          /*!< ENET_EIMR.TS_AVAIL Mask                 */
#define ENET_EIMR_TS_AVAIL_SHIFT                 (16U)                                               /*!< ENET_EIMR.TS_AVAIL Position             */
#define ENET_EIMR_TS_AVAIL(x)                    (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< ENET_EIMR.TS_AVAIL Field                */
#define ENET_EIMR_WAKEUP_MASK                    (0x20000U)                                          /*!< ENET_EIMR.WAKEUP Mask                   */
#define ENET_EIMR_WAKEUP_SHIFT                   (17U)                                               /*!< ENET_EIMR.WAKEUP Position               */
#define ENET_EIMR_WAKEUP(x)                      (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< ENET_EIMR.WAKEUP Field                  */
#define ENET_EIMR_PLR_MASK                       (0x40000U)                                          /*!< ENET_EIMR.PLR Mask                      */
#define ENET_EIMR_PLR_SHIFT                      (18U)                                               /*!< ENET_EIMR.PLR Position                  */
#define ENET_EIMR_PLR(x)                         (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< ENET_EIMR.PLR Field                     */
#define ENET_EIMR_UN_MASK                        (0x80000U)                                          /*!< ENET_EIMR.UN Mask                       */
#define ENET_EIMR_UN_SHIFT                       (19U)                                               /*!< ENET_EIMR.UN Position                   */
#define ENET_EIMR_UN(x)                          (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< ENET_EIMR.UN Field                      */
#define ENET_EIMR_RL_MASK                        (0x100000U)                                         /*!< ENET_EIMR.RL Mask                       */
#define ENET_EIMR_RL_SHIFT                       (20U)                                               /*!< ENET_EIMR.RL Position                   */
#define ENET_EIMR_RL(x)                          (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< ENET_EIMR.RL Field                      */
#define ENET_EIMR_LC_MASK                        (0x200000U)                                         /*!< ENET_EIMR.LC Mask                       */
#define ENET_EIMR_LC_SHIFT                       (21U)                                               /*!< ENET_EIMR.LC Position                   */
#define ENET_EIMR_LC(x)                          (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< ENET_EIMR.LC Field                      */
#define ENET_EIMR_EBERR_MASK                     (0x400000U)                                         /*!< ENET_EIMR.EBERR Mask                    */
#define ENET_EIMR_EBERR_SHIFT                    (22U)                                               /*!< ENET_EIMR.EBERR Position                */
#define ENET_EIMR_EBERR(x)                       (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< ENET_EIMR.EBERR Field                   */
#define ENET_EIMR_MII_MASK                       (0x800000U)                                         /*!< ENET_EIMR.MII Mask                      */
#define ENET_EIMR_MII_SHIFT                      (23U)                                               /*!< ENET_EIMR.MII Position                  */
#define ENET_EIMR_MII(x)                         (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< ENET_EIMR.MII Field                     */
#define ENET_EIMR_RXB_MASK                       (0x1000000U)                                        /*!< ENET_EIMR.RXB Mask                      */
#define ENET_EIMR_RXB_SHIFT                      (24U)                                               /*!< ENET_EIMR.RXB Position                  */
#define ENET_EIMR_RXB(x)                         (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< ENET_EIMR.RXB Field                     */
#define ENET_EIMR_RXF_MASK                       (0x2000000U)                                        /*!< ENET_EIMR.RXF Mask                      */
#define ENET_EIMR_RXF_SHIFT                      (25U)                                               /*!< ENET_EIMR.RXF Position                  */
#define ENET_EIMR_RXF(x)                         (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< ENET_EIMR.RXF Field                     */
#define ENET_EIMR_TXB_MASK                       (0x4000000U)                                        /*!< ENET_EIMR.TXB Mask                      */
#define ENET_EIMR_TXB_SHIFT                      (26U)                                               /*!< ENET_EIMR.TXB Position                  */
#define ENET_EIMR_TXB(x)                         (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< ENET_EIMR.TXB Field                     */
#define ENET_EIMR_TXF_MASK                       (0x8000000U)                                        /*!< ENET_EIMR.TXF Mask                      */
#define ENET_EIMR_TXF_SHIFT                      (27U)                                               /*!< ENET_EIMR.TXF Position                  */
#define ENET_EIMR_TXF(x)                         (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< ENET_EIMR.TXF Field                     */
#define ENET_EIMR_GRA_MASK                       (0x10000000U)                                       /*!< ENET_EIMR.GRA Mask                      */
#define ENET_EIMR_GRA_SHIFT                      (28U)                                               /*!< ENET_EIMR.GRA Position                  */
#define ENET_EIMR_GRA(x)                         (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< ENET_EIMR.GRA Field                     */
#define ENET_EIMR_BABT_MASK                      (0x20000000U)                                       /*!< ENET_EIMR.BABT Mask                     */
#define ENET_EIMR_BABT_SHIFT                     (29U)                                               /*!< ENET_EIMR.BABT Position                 */
#define ENET_EIMR_BABT(x)                        (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< ENET_EIMR.BABT Field                    */
#define ENET_EIMR_BABR_MASK                      (0x40000000U)                                       /*!< ENET_EIMR.BABR Mask                     */
#define ENET_EIMR_BABR_SHIFT                     (30U)                                               /*!< ENET_EIMR.BABR Position                 */
#define ENET_EIMR_BABR(x)                        (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< ENET_EIMR.BABR Field                    */
/* ------- RDAR Bit Fields                          ------ */
#define ENET_RDAR_RDAR_MASK                      (0x1000000U)                                        /*!< ENET_RDAR.RDAR Mask                     */
#define ENET_RDAR_RDAR_SHIFT                     (24U)                                               /*!< ENET_RDAR.RDAR Position                 */
#define ENET_RDAR_RDAR(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< ENET_RDAR.RDAR Field                    */
/* ------- TDAR Bit Fields                          ------ */
#define ENET_TDAR_TDAR_MASK                      (0x1000000U)                                        /*!< ENET_TDAR.TDAR Mask                     */
#define ENET_TDAR_TDAR_SHIFT                     (24U)                                               /*!< ENET_TDAR.TDAR Position                 */
#define ENET_TDAR_TDAR(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< ENET_TDAR.TDAR Field                    */
/* ------- ECR Bit Fields                           ------ */
#define ENET_ECR_RESET_MASK                      (0x1U)                                              /*!< ENET_ECR.RESET Mask                     */
#define ENET_ECR_RESET_SHIFT                     (0U)                                                /*!< ENET_ECR.RESET Position                 */
#define ENET_ECR_RESET(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ENET_ECR.RESET Field                    */
#define ENET_ECR_ETHEREN_MASK                    (0x2U)                                              /*!< ENET_ECR.ETHEREN Mask                   */
#define ENET_ECR_ETHEREN_SHIFT                   (1U)                                                /*!< ENET_ECR.ETHEREN Position               */
#define ENET_ECR_ETHEREN(x)                      (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< ENET_ECR.ETHEREN Field                  */
#define ENET_ECR_MAGICEN_MASK                    (0x4U)                                              /*!< ENET_ECR.MAGICEN Mask                   */
#define ENET_ECR_MAGICEN_SHIFT                   (2U)                                                /*!< ENET_ECR.MAGICEN Position               */
#define ENET_ECR_MAGICEN(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ENET_ECR.MAGICEN Field                  */
#define ENET_ECR_SLEEP_MASK                      (0x8U)                                              /*!< ENET_ECR.SLEEP Mask                     */
#define ENET_ECR_SLEEP_SHIFT                     (3U)                                                /*!< ENET_ECR.SLEEP Position                 */
#define ENET_ECR_SLEEP(x)                        (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< ENET_ECR.SLEEP Field                    */
#define ENET_ECR_EN1588_MASK                     (0x10U)                                             /*!< ENET_ECR.EN1588 Mask                    */
#define ENET_ECR_EN1588_SHIFT                    (4U)                                                /*!< ENET_ECR.EN1588 Position                */
#define ENET_ECR_EN1588(x)                       (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< ENET_ECR.EN1588 Field                   */
#define ENET_ECR_DBGEN_MASK                      (0x40U)                                             /*!< ENET_ECR.DBGEN Mask                     */
#define ENET_ECR_DBGEN_SHIFT                     (6U)                                                /*!< ENET_ECR.DBGEN Position                 */
#define ENET_ECR_DBGEN(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< ENET_ECR.DBGEN Field                    */
#define ENET_ECR_STOPEN_MASK                     (0x80U)                                             /*!< ENET_ECR.STOPEN Mask                    */
#define ENET_ECR_STOPEN_SHIFT                    (7U)                                                /*!< ENET_ECR.STOPEN Position                */
#define ENET_ECR_STOPEN(x)                       (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ENET_ECR.STOPEN Field                   */
#define ENET_ECR_DBSWP_MASK                      (0x100U)                                            /*!< ENET_ECR.DBSWP Mask                     */
#define ENET_ECR_DBSWP_SHIFT                     (8U)                                                /*!< ENET_ECR.DBSWP Position                 */
#define ENET_ECR_DBSWP(x)                        (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< ENET_ECR.DBSWP Field                    */
/* ------- MMFR Bit Fields                          ------ */
#define ENET_MMFR_DATA_MASK                      (0xFFFFU)                                           /*!< ENET_MMFR.DATA Mask                     */
#define ENET_MMFR_DATA_SHIFT                     (0U)                                                /*!< ENET_MMFR.DATA Position                 */
#define ENET_MMFR_DATA(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_MMFR.DATA Field                    */
#define ENET_MMFR_TA_MASK                        (0x30000U)                                          /*!< ENET_MMFR.TA Mask                       */
#define ENET_MMFR_TA_SHIFT                       (16U)                                               /*!< ENET_MMFR.TA Position                   */
#define ENET_MMFR_TA(x)                          (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< ENET_MMFR.TA Field                      */
#define ENET_MMFR_RA_MASK                        (0x7C0000U)                                         /*!< ENET_MMFR.RA Mask                       */
#define ENET_MMFR_RA_SHIFT                       (18U)                                               /*!< ENET_MMFR.RA Position                   */
#define ENET_MMFR_RA(x)                          (((uint32_t)(((uint32_t)(x))<<18U))&0x7C0000UL)     /*!< ENET_MMFR.RA Field                      */
#define ENET_MMFR_PA_MASK                        (0xF800000U)                                        /*!< ENET_MMFR.PA Mask                       */
#define ENET_MMFR_PA_SHIFT                       (23U)                                               /*!< ENET_MMFR.PA Position                   */
#define ENET_MMFR_PA(x)                          (((uint32_t)(((uint32_t)(x))<<23U))&0xF800000UL)    /*!< ENET_MMFR.PA Field                      */
#define ENET_MMFR_OP_MASK                        (0x30000000U)                                       /*!< ENET_MMFR.OP Mask                       */
#define ENET_MMFR_OP_SHIFT                       (28U)                                               /*!< ENET_MMFR.OP Position                   */
#define ENET_MMFR_OP(x)                          (((uint32_t)(((uint32_t)(x))<<28U))&0x30000000UL)   /*!< ENET_MMFR.OP Field                      */
#define ENET_MMFR_ST_MASK                        (0xC0000000U)                                       /*!< ENET_MMFR.ST Mask                       */
#define ENET_MMFR_ST_SHIFT                       (30U)                                               /*!< ENET_MMFR.ST Position                   */
#define ENET_MMFR_ST(x)                          (((uint32_t)(((uint32_t)(x))<<30U))&0xC0000000UL)   /*!< ENET_MMFR.ST Field                      */
/* ------- MSCR Bit Fields                          ------ */
#define ENET_MSCR_MII_SPEED_MASK                 (0x7EU)                                             /*!< ENET_MSCR.MII_SPEED Mask                */
#define ENET_MSCR_MII_SPEED_SHIFT                (1U)                                                /*!< ENET_MSCR.MII_SPEED Position            */
#define ENET_MSCR_MII_SPEED(x)                   (((uint32_t)(((uint32_t)(x))<<1U))&0x7EUL)          /*!< ENET_MSCR.MII_SPEED Field               */
#define ENET_MSCR_DIS_PRE_MASK                   (0x80U)                                             /*!< ENET_MSCR.DIS_PRE Mask                  */
#define ENET_MSCR_DIS_PRE_SHIFT                  (7U)                                                /*!< ENET_MSCR.DIS_PRE Position              */
#define ENET_MSCR_DIS_PRE(x)                     (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ENET_MSCR.DIS_PRE Field                 */
#define ENET_MSCR_HOLDTIME_MASK                  (0x700U)                                            /*!< ENET_MSCR.HOLDTIME Mask                 */
#define ENET_MSCR_HOLDTIME_SHIFT                 (8U)                                                /*!< ENET_MSCR.HOLDTIME Position             */
#define ENET_MSCR_HOLDTIME(x)                    (((uint32_t)(((uint32_t)(x))<<8U))&0x700UL)         /*!< ENET_MSCR.HOLDTIME Field                */
/* ------- MIBC Bit Fields                          ------ */
#define ENET_MIBC_MIB_CLEAR_MASK                 (0x20000000U)                                       /*!< ENET_MIBC.MIB_CLEAR Mask                */
#define ENET_MIBC_MIB_CLEAR_SHIFT                (29U)                                               /*!< ENET_MIBC.MIB_CLEAR Position            */
#define ENET_MIBC_MIB_CLEAR(x)                   (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< ENET_MIBC.MIB_CLEAR Field               */
#define ENET_MIBC_MIB_IDLE_MASK                  (0x40000000U)                                       /*!< ENET_MIBC.MIB_IDLE Mask                 */
