podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define ENET_MIBC_MIB_IDLE_SHIFT                 (30U)                                               /*!< ENET_MIBC.MIB_IDLE Position             */
#define ENET_MIBC_MIB_IDLE(x)                    (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< ENET_MIBC.MIB_IDLE Field                */
#define ENET_MIBC_MIB_DIS_MASK                   (0x80000000U)                                       /*!< ENET_MIBC.MIB_DIS Mask                  */
#define ENET_MIBC_MIB_DIS_SHIFT                  (31U)                                               /*!< ENET_MIBC.MIB_DIS Position              */
#define ENET_MIBC_MIB_DIS(x)                     (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< ENET_MIBC.MIB_DIS Field                 */
/* ------- RCR Bit Fields                           ------ */
#define ENET_RCR_LOOP_MASK                       (0x1U)                                              /*!< ENET_RCR.LOOP Mask                      */
#define ENET_RCR_LOOP_SHIFT                      (0U)                                                /*!< ENET_RCR.LOOP Position                  */
#define ENET_RCR_LOOP(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ENET_RCR.LOOP Field                     */
#define ENET_RCR_DRT_MASK                        (0x2U)                                              /*!< ENET_RCR.DRT Mask                       */
#define ENET_RCR_DRT_SHIFT                       (1U)                                                /*!< ENET_RCR.DRT Position                   */
#define ENET_RCR_DRT(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< ENET_RCR.DRT Field                      */
#define ENET_RCR_MII_MODE_MASK                   (0x4U)                                              /*!< ENET_RCR.MII_MODE Mask                  */
#define ENET_RCR_MII_MODE_SHIFT                  (2U)                                                /*!< ENET_RCR.MII_MODE Position              */
#define ENET_RCR_MII_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ENET_RCR.MII_MODE Field                 */
#define ENET_RCR_PROM_MASK                       (0x8U)                                              /*!< ENET_RCR.PROM Mask                      */
#define ENET_RCR_PROM_SHIFT                      (3U)                                                /*!< ENET_RCR.PROM Position                  */
#define ENET_RCR_PROM(x)                         (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< ENET_RCR.PROM Field                     */
#define ENET_RCR_BC_REJ_MASK                     (0x10U)                                             /*!< ENET_RCR.BC_REJ Mask                    */
#define ENET_RCR_BC_REJ_SHIFT                    (4U)                                                /*!< ENET_RCR.BC_REJ Position                */
#define ENET_RCR_BC_REJ(x)                       (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< ENET_RCR.BC_REJ Field                   */
#define ENET_RCR_FCE_MASK                        (0x20U)                                             /*!< ENET_RCR.FCE Mask                       */
#define ENET_RCR_FCE_SHIFT                       (5U)                                                /*!< ENET_RCR.FCE Position                   */
#define ENET_RCR_FCE(x)                          (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< ENET_RCR.FCE Field                      */
#define ENET_RCR_RMII_MODE_MASK                  (0x100U)                                            /*!< ENET_RCR.RMII_MODE Mask                 */
#define ENET_RCR_RMII_MODE_SHIFT                 (8U)                                                /*!< ENET_RCR.RMII_MODE Position             */
#define ENET_RCR_RMII_MODE(x)                    (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< ENET_RCR.RMII_MODE Field                */
#define ENET_RCR_RMII_10T_MASK                   (0x200U)                                            /*!< ENET_RCR.RMII_10T Mask                  */
#define ENET_RCR_RMII_10T_SHIFT                  (9U)                                                /*!< ENET_RCR.RMII_10T Position              */
#define ENET_RCR_RMII_10T(x)                     (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< ENET_RCR.RMII_10T Field                 */
#define ENET_RCR_PADEN_MASK                      (0x1000U)                                           /*!< ENET_RCR.PADEN Mask                     */
#define ENET_RCR_PADEN_SHIFT                     (12U)                                               /*!< ENET_RCR.PADEN Position                 */
#define ENET_RCR_PADEN(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< ENET_RCR.PADEN Field                    */
#define ENET_RCR_PAUFWD_MASK                     (0x2000U)                                           /*!< ENET_RCR.PAUFWD Mask                    */
#define ENET_RCR_PAUFWD_SHIFT                    (13U)                                               /*!< ENET_RCR.PAUFWD Position                */
#define ENET_RCR_PAUFWD(x)                       (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< ENET_RCR.PAUFWD Field                   */
#define ENET_RCR_CRCFWD_MASK                     (0x4000U)                                           /*!< ENET_RCR.CRCFWD Mask                    */
#define ENET_RCR_CRCFWD_SHIFT                    (14U)                                               /*!< ENET_RCR.CRCFWD Position                */
#define ENET_RCR_CRCFWD(x)                       (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< ENET_RCR.CRCFWD Field                   */
#define ENET_RCR_CFEN_MASK                       (0x8000U)                                           /*!< ENET_RCR.CFEN Mask                      */
#define ENET_RCR_CFEN_SHIFT                      (15U)                                               /*!< ENET_RCR.CFEN Position                  */
#define ENET_RCR_CFEN(x)                         (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< ENET_RCR.CFEN Field                     */
#define ENET_RCR_MAX_FL_MASK                     (0x3FFF0000U)                                       /*!< ENET_RCR.MAX_FL Mask                    */
#define ENET_RCR_MAX_FL_SHIFT                    (16U)                                               /*!< ENET_RCR.MAX_FL Position                */
#define ENET_RCR_MAX_FL(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x3FFF0000UL)   /*!< ENET_RCR.MAX_FL Field                   */
#define ENET_RCR_NLC_MASK                        (0x40000000U)                                       /*!< ENET_RCR.NLC Mask                       */
#define ENET_RCR_NLC_SHIFT                       (30U)                                               /*!< ENET_RCR.NLC Position                   */
#define ENET_RCR_NLC(x)                          (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< ENET_RCR.NLC Field                      */
#define ENET_RCR_GRS_MASK                        (0x80000000U)                                       /*!< ENET_RCR.GRS Mask                       */
#define ENET_RCR_GRS_SHIFT                       (31U)                                               /*!< ENET_RCR.GRS Position                   */
#define ENET_RCR_GRS(x)                          (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< ENET_RCR.GRS Field                      */
/* ------- TCR Bit Fields                           ------ */
#define ENET_TCR_GTS_MASK                        (0x1U)                                              /*!< ENET_TCR.GTS Mask                       */
#define ENET_TCR_GTS_SHIFT                       (0U)                                                /*!< ENET_TCR.GTS Position                   */
#define ENET_TCR_GTS(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ENET_TCR.GTS Field                      */
#define ENET_TCR_FDEN_MASK                       (0x4U)                                              /*!< ENET_TCR.FDEN Mask                      */
#define ENET_TCR_FDEN_SHIFT                      (2U)                                                /*!< ENET_TCR.FDEN Position                  */
#define ENET_TCR_FDEN(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ENET_TCR.FDEN Field                     */
#define ENET_TCR_TFC_PAUSE_MASK                  (0x8U)                                              /*!< ENET_TCR.TFC_PAUSE Mask                 */
#define ENET_TCR_TFC_PAUSE_SHIFT                 (3U)                                                /*!< ENET_TCR.TFC_PAUSE Position             */
#define ENET_TCR_TFC_PAUSE(x)                    (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< ENET_TCR.TFC_PAUSE Field                */
#define ENET_TCR_RFC_PAUSE_MASK                  (0x10U)                                             /*!< ENET_TCR.RFC_PAUSE Mask                 */
#define ENET_TCR_RFC_PAUSE_SHIFT                 (4U)                                                /*!< ENET_TCR.RFC_PAUSE Position             */
#define ENET_TCR_RFC_PAUSE(x)                    (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< ENET_TCR.RFC_PAUSE Field                */
#define ENET_TCR_ADDSEL_MASK                     (0xE0U)                                             /*!< ENET_TCR.ADDSEL Mask                    */
#define ENET_TCR_ADDSEL_SHIFT                    (5U)                                                /*!< ENET_TCR.ADDSEL Position                */
#define ENET_TCR_ADDSEL(x)                       (((uint32_t)(((uint32_t)(x))<<5U))&0xE0UL)          /*!< ENET_TCR.ADDSEL Field                   */
#define ENET_TCR_ADDINS_MASK                     (0x100U)                                            /*!< ENET_TCR.ADDINS Mask                    */
#define ENET_TCR_ADDINS_SHIFT                    (8U)                                                /*!< ENET_TCR.ADDINS Position                */
#define ENET_TCR_ADDINS(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< ENET_TCR.ADDINS Field                   */
#define ENET_TCR_CRCFWD_MASK                     (0x200U)                                            /*!< ENET_TCR.CRCFWD Mask                    */
#define ENET_TCR_CRCFWD_SHIFT                    (9U)                                                /*!< ENET_TCR.CRCFWD Position                */
#define ENET_TCR_CRCFWD(x)                       (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< ENET_TCR.CRCFWD Field                   */
/* ------- PALR Bit Fields                          ------ */
#define ENET_PALR_PADDR1_MASK                    (0xFFFFFFFFU)                                       /*!< ENET_PALR.PADDR1 Mask                   */
#define ENET_PALR_PADDR1_SHIFT                   (0U)                                                /*!< ENET_PALR.PADDR1 Position               */
#define ENET_PALR_PADDR1(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_PALR.PADDR1 Field                  */
/* ------- PAUR Bit Fields                          ------ */
#define ENET_PAUR_TYPE_MASK                      (0xFFFFU)                                           /*!< ENET_PAUR.TYPE Mask                     */
#define ENET_PAUR_TYPE_SHIFT                     (0U)                                                /*!< ENET_PAUR.TYPE Position                 */
#define ENET_PAUR_TYPE(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_PAUR.TYPE Field                    */
#define ENET_PAUR_PADDR2_MASK                    (0xFFFF0000U)                                       /*!< ENET_PAUR.PADDR2 Mask                   */
#define ENET_PAUR_PADDR2_SHIFT                   (16U)                                               /*!< ENET_PAUR.PADDR2 Position               */
#define ENET_PAUR_PADDR2(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< ENET_PAUR.PADDR2 Field                  */
/* ------- OPD Bit Fields                           ------ */
#define ENET_OPD_PAUSE_DUR_MASK                  (0xFFFFU)                                           /*!< ENET_OPD.PAUSE_DUR Mask                 */
#define ENET_OPD_PAUSE_DUR_SHIFT                 (0U)                                                /*!< ENET_OPD.PAUSE_DUR Position             */
#define ENET_OPD_PAUSE_DUR(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_OPD.PAUSE_DUR Field                */
#define ENET_OPD_OPCODE_MASK                     (0xFFFF0000U)                                       /*!< ENET_OPD.OPCODE Mask                    */
#define ENET_OPD_OPCODE_SHIFT                    (16U)                                               /*!< ENET_OPD.OPCODE Position                */
#define ENET_OPD_OPCODE(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< ENET_OPD.OPCODE Field                   */
/* ------- IAUR Bit Fields                          ------ */
#define ENET_IAUR_IADDR1_MASK                    (0xFFFFFFFFU)                                       /*!< ENET_IAUR.IADDR1 Mask                   */
#define ENET_IAUR_IADDR1_SHIFT                   (0U)                                                /*!< ENET_IAUR.IADDR1 Position               */
#define ENET_IAUR_IADDR1(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_IAUR.IADDR1 Field                  */
/* ------- IALR Bit Fields                          ------ */
#define ENET_IALR_IADDR2_MASK                    (0xFFFFFFFFU)                                       /*!< ENET_IALR.IADDR2 Mask                   */
#define ENET_IALR_IADDR2_SHIFT                   (0U)                                                /*!< ENET_IALR.IADDR2 Position               */
#define ENET_IALR_IADDR2(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_IALR.IADDR2 Field                  */
/* ------- GAUR Bit Fields                          ------ */
#define ENET_GAUR_GADDR1_MASK                    (0xFFFFFFFFU)                                       /*!< ENET_GAUR.GADDR1 Mask                   */
#define ENET_GAUR_GADDR1_SHIFT                   (0U)                                                /*!< ENET_GAUR.GADDR1 Position               */
#define ENET_GAUR_GADDR1(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_GAUR.GADDR1 Field                  */
/* ------- GALR Bit Fields                          ------ */
#define ENET_GALR_GADDR2_MASK                    (0xFFFFFFFFU)                                       /*!< ENET_GALR.GADDR2 Mask                   */
#define ENET_GALR_GADDR2_SHIFT                   (0U)                                                /*!< ENET_GALR.GADDR2 Position               */
#define ENET_GALR_GADDR2(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_GALR.GADDR2 Field                  */
/* ------- TFWR Bit Fields                          ------ */
#define ENET_TFWR_TFWR_MASK                      (0x3FU)                                             /*!< ENET_TFWR.TFWR Mask                     */
#define ENET_TFWR_TFWR_SHIFT                     (0U)                                                /*!< ENET_TFWR.TFWR Position                 */
#define ENET_TFWR_TFWR(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x3FUL)          /*!< ENET_TFWR.TFWR Field                    */
#define ENET_TFWR_STRFWD_MASK                    (0x100U)                                            /*!< ENET_TFWR.STRFWD Mask                   */
#define ENET_TFWR_STRFWD_SHIFT                   (8U)                                                /*!< ENET_TFWR.STRFWD Position               */
#define ENET_TFWR_STRFWD(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< ENET_TFWR.STRFWD Field                  */
/* ------- RDSR Bit Fields                          ------ */
#define ENET_RDSR_R_DES_START_MASK               (0xFFFFFFF8U)                                       /*!< ENET_RDSR.R_DES_START Mask              */
#define ENET_RDSR_R_DES_START_SHIFT              (3U)                                                /*!< ENET_RDSR.R_DES_START Position          */
#define ENET_RDSR_R_DES_START(x)                 (((uint32_t)(((uint32_t)(x))<<3U))&0xFFFFFFF8UL)    /*!< ENET_RDSR.R_DES_START Field             */
/* ------- TDSR Bit Fields                          ------ */
#define ENET_TDSR_X_DES_START_MASK               (0xFFFFFFF8U)                                       /*!< ENET_TDSR.X_DES_START Mask              */
#define ENET_TDSR_X_DES_START_SHIFT              (3U)                                                /*!< ENET_TDSR.X_DES_START Position          */
#define ENET_TDSR_X_DES_START(x)                 (((uint32_t)(((uint32_t)(x))<<3U))&0xFFFFFFF8UL)    /*!< ENET_TDSR.X_DES_START Field             */
/* ------- MRBR Bit Fields                          ------ */
#define ENET_MRBR_R_BUF_SIZE_MASK                (0x3FF0U)                                           /*!< ENET_MRBR.R_BUF_SIZE Mask               */
#define ENET_MRBR_R_BUF_SIZE_SHIFT               (4U)                                                /*!< ENET_MRBR.R_BUF_SIZE Position           */
#define ENET_MRBR_R_BUF_SIZE(x)                  (((uint32_t)(((uint32_t)(x))<<4U))&0x3FF0UL)        /*!< ENET_MRBR.R_BUF_SIZE Field              */
/* ------- RSFL Bit Fields                          ------ */
#define ENET_RSFL_RX_SECTION_FULL_MASK           (0xFFU)                                             /*!< ENET_RSFL.RX_SECTION_FULL Mask          */
#define ENET_RSFL_RX_SECTION_FULL_SHIFT          (0U)                                                /*!< ENET_RSFL.RX_SECTION_FULL Position      */
#define ENET_RSFL_RX_SECTION_FULL(x)             (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ENET_RSFL.RX_SECTION_FULL Field         */
/* ------- RSEM Bit Fields                          ------ */
#define ENET_RSEM_RX_SECTION_EMPTY_MASK          (0xFFU)                                             /*!< ENET_RSEM.RX_SECTION_EMPTY Mask         */
#define ENET_RSEM_RX_SECTION_EMPTY_SHIFT         (0U)                                                /*!< ENET_RSEM.RX_SECTION_EMPTY Position     */
#define ENET_RSEM_RX_SECTION_EMPTY(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ENET_RSEM.RX_SECTION_EMPTY Field        */
/* ------- RAEM Bit Fields                          ------ */
#define ENET_RAEM_RX_ALMOST_EMPTY_MASK           (0xFFU)                                             /*!< ENET_RAEM.RX_ALMOST_EMPTY Mask          */
#define ENET_RAEM_RX_ALMOST_EMPTY_SHIFT          (0U)                                                /*!< ENET_RAEM.RX_ALMOST_EMPTY Position      */
#define ENET_RAEM_RX_ALMOST_EMPTY(x)             (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ENET_RAEM.RX_ALMOST_EMPTY Field         */
/* ------- RAFL Bit Fields                          ------ */
#define ENET_RAFL_RX_ALMOST_FULL_MASK            (0xFFU)                                             /*!< ENET_RAFL.RX_ALMOST_FULL Mask           */
#define ENET_RAFL_RX_ALMOST_FULL_SHIFT           (0U)                                                /*!< ENET_RAFL.RX_ALMOST_FULL Position       */
#define ENET_RAFL_RX_ALMOST_FULL(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ENET_RAFL.RX_ALMOST_FULL Field          */
/* ------- TSEM Bit Fields                          ------ */
#define ENET_TSEM_TX_SECTION_EMPTY_MASK          (0xFFU)                                             /*!< ENET_TSEM.TX_SECTION_EMPTY Mask         */
#define ENET_TSEM_TX_SECTION_EMPTY_SHIFT         (0U)                                                /*!< ENET_TSEM.TX_SECTION_EMPTY Position     */
#define ENET_TSEM_TX_SECTION_EMPTY(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ENET_TSEM.TX_SECTION_EMPTY Field        */
/* ------- TAEM Bit Fields                          ------ */
#define ENET_TAEM_TX_ALMOST_EMPTY_MASK           (0xFFU)                                             /*!< ENET_TAEM.TX_ALMOST_EMPTY Mask          */
#define ENET_TAEM_TX_ALMOST_EMPTY_SHIFT          (0U)                                                /*!< ENET_TAEM.TX_ALMOST_EMPTY Position      */
#define ENET_TAEM_TX_ALMOST_EMPTY(x)             (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ENET_TAEM.TX_ALMOST_EMPTY Field         */
/* ------- TAFL Bit Fields                          ------ */
#define ENET_TAFL_TX_ALMOST_FULL_MASK            (0xFFU)                                             /*!< ENET_TAFL.TX_ALMOST_FULL Mask           */
#define ENET_TAFL_TX_ALMOST_FULL_SHIFT           (0U)                                                /*!< ENET_TAFL.TX_ALMOST_FULL Position       */
#define ENET_TAFL_TX_ALMOST_FULL(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ENET_TAFL.TX_ALMOST_FULL Field          */
/* ------- TIPG Bit Fields                          ------ */
#define ENET_TIPG_IPG_MASK                       (0x1FU)                                             /*!< ENET_TIPG.IPG Mask                      */
#define ENET_TIPG_IPG_SHIFT                      (0U)                                                /*!< ENET_TIPG.IPG Position                  */
#define ENET_TIPG_IPG(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1FUL)          /*!< ENET_TIPG.IPG Field                     */
/* ------- FTRL Bit Fields                          ------ */
#define ENET_FTRL_TRUNC_FL_MASK                  (0x3FFFU)                                           /*!< ENET_FTRL.TRUNC_FL Mask                 */
#define ENET_FTRL_TRUNC_FL_SHIFT                 (0U)                                                /*!< ENET_FTRL.TRUNC_FL Position             */
#define ENET_FTRL_TRUNC_FL(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFFUL)        /*!< ENET_FTRL.TRUNC_FL Field                */
/* ------- TACC Bit Fields                          ------ */
#define ENET_TACC_SHIFT16_MASK                   (0x1U)                                              /*!< ENET_TACC.SHIFT16 Mask                  */
#define ENET_TACC_SHIFT16_SHIFT                  (0U)                                                /*!< ENET_TACC.SHIFT16 Position              */
#define ENET_TACC_SHIFT16(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ENET_TACC.SHIFT16 Field                 */
#define ENET_TACC_IPCHK_MASK                     (0x8U)                                              /*!< ENET_TACC.IPCHK Mask                    */
#define ENET_TACC_IPCHK_SHIFT                    (3U)                                                /*!< ENET_TACC.IPCHK Position                */
#define ENET_TACC_IPCHK(x)                       (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< ENET_TACC.IPCHK Field                   */
#define ENET_TACC_PROCHK_MASK                    (0x10U)                                             /*!< ENET_TACC.PROCHK Mask                   */
#define ENET_TACC_PROCHK_SHIFT                   (4U)                                                /*!< ENET_TACC.PROCHK Position               */
#define ENET_TACC_PROCHK(x)                      (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< ENET_TACC.PROCHK Field                  */
/* ------- RACC Bit Fields                          ------ */
#define ENET_RACC_PADREM_MASK                    (0x1U)                                              /*!< ENET_RACC.PADREM Mask                   */
#define ENET_RACC_PADREM_SHIFT                   (0U)                                                /*!< ENET_RACC.PADREM Position               */
