podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define ENET_RACC_PADREM(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ENET_RACC.PADREM Field                  */
#define ENET_RACC_IPDIS_MASK                     (0x2U)                                              /*!< ENET_RACC.IPDIS Mask                    */
#define ENET_RACC_IPDIS_SHIFT                    (1U)                                                /*!< ENET_RACC.IPDIS Position                */
#define ENET_RACC_IPDIS(x)                       (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< ENET_RACC.IPDIS Field                   */
#define ENET_RACC_PRODIS_MASK                    (0x4U)                                              /*!< ENET_RACC.PRODIS Mask                   */
#define ENET_RACC_PRODIS_SHIFT                   (2U)                                                /*!< ENET_RACC.PRODIS Position               */
#define ENET_RACC_PRODIS(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ENET_RACC.PRODIS Field                  */
#define ENET_RACC_LINEDIS_MASK                   (0x40U)                                             /*!< ENET_RACC.LINEDIS Mask                  */
#define ENET_RACC_LINEDIS_SHIFT                  (6U)                                                /*!< ENET_RACC.LINEDIS Position              */
#define ENET_RACC_LINEDIS(x)                     (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< ENET_RACC.LINEDIS Field                 */
#define ENET_RACC_SHIFT16_MASK                   (0x80U)                                             /*!< ENET_RACC.SHIFT16 Mask                  */
#define ENET_RACC_SHIFT16_SHIFT                  (7U)                                                /*!< ENET_RACC.SHIFT16 Position              */
#define ENET_RACC_SHIFT16(x)                     (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ENET_RACC.SHIFT16 Field                 */
/* ------- RMON_T_DROP Bit Fields                   ------ */
/* ------- RMON_T_PACKETS Bit Fields                ------ */
#define ENET_RMON_T_PACKETS_TXPKTS_MASK          (0xFFFFU)                                           /*!< ENET_RMON_T_PACKETS.TXPKTS Mask         */
#define ENET_RMON_T_PACKETS_TXPKTS_SHIFT         (0U)                                                /*!< ENET_RMON_T_PACKETS.TXPKTS Position     */
#define ENET_RMON_T_PACKETS_TXPKTS(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_PACKETS.TXPKTS Field        */
/* ------- RMON_T_BC_PKT Bit Fields                 ------ */
#define ENET_RMON_T_BC_PKT_TXPKTS_MASK           (0xFFFFU)                                           /*!< ENET_RMON_T_BC_PKT.TXPKTS Mask          */
#define ENET_RMON_T_BC_PKT_TXPKTS_SHIFT          (0U)                                                /*!< ENET_RMON_T_BC_PKT.TXPKTS Position      */
#define ENET_RMON_T_BC_PKT_TXPKTS(x)             (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_BC_PKT.TXPKTS Field         */
/* ------- RMON_T_MC_PKT Bit Fields                 ------ */
#define ENET_RMON_T_MC_PKT_TXPKTS_MASK           (0xFFFFU)                                           /*!< ENET_RMON_T_MC_PKT.TXPKTS Mask          */
#define ENET_RMON_T_MC_PKT_TXPKTS_SHIFT          (0U)                                                /*!< ENET_RMON_T_MC_PKT.TXPKTS Position      */
#define ENET_RMON_T_MC_PKT_TXPKTS(x)             (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_MC_PKT.TXPKTS Field         */
/* ------- RMON_T_CRC_ALIGN Bit Fields              ------ */
#define ENET_RMON_T_CRC_ALIGN_TXPKTS_MASK        (0xFFFFU)                                           /*!< ENET_RMON_T_CRC_ALIGN.TXPKTS Mask       */
#define ENET_RMON_T_CRC_ALIGN_TXPKTS_SHIFT       (0U)                                                /*!< ENET_RMON_T_CRC_ALIGN.TXPKTS Position   */
#define ENET_RMON_T_CRC_ALIGN_TXPKTS(x)          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_CRC_ALIGN.TXPKTS Field      */
/* ------- RMON_T_UNDERSIZE Bit Fields              ------ */
#define ENET_RMON_T_UNDERSIZE_TXPKTS_MASK        (0xFFFFU)                                           /*!< ENET_RMON_T_UNDERSIZE.TXPKTS Mask       */
#define ENET_RMON_T_UNDERSIZE_TXPKTS_SHIFT       (0U)                                                /*!< ENET_RMON_T_UNDERSIZE.TXPKTS Position   */
#define ENET_RMON_T_UNDERSIZE_TXPKTS(x)          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_UNDERSIZE.TXPKTS Field      */
/* ------- RMON_T_OVERSIZE Bit Fields               ------ */
#define ENET_RMON_T_OVERSIZE_TXPKTS_MASK         (0xFFFFU)                                           /*!< ENET_RMON_T_OVERSIZE.TXPKTS Mask        */
#define ENET_RMON_T_OVERSIZE_TXPKTS_SHIFT        (0U)                                                /*!< ENET_RMON_T_OVERSIZE.TXPKTS Position    */
#define ENET_RMON_T_OVERSIZE_TXPKTS(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_OVERSIZE.TXPKTS Field       */
/* ------- RMON_T_FRAG Bit Fields                   ------ */
#define ENET_RMON_T_FRAG_TXPKTS_MASK             (0xFFFFU)                                           /*!< ENET_RMON_T_FRAG.TXPKTS Mask            */
#define ENET_RMON_T_FRAG_TXPKTS_SHIFT            (0U)                                                /*!< ENET_RMON_T_FRAG.TXPKTS Position        */
#define ENET_RMON_T_FRAG_TXPKTS(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_FRAG.TXPKTS Field           */
/* ------- RMON_T_JAB Bit Fields                    ------ */
#define ENET_RMON_T_JAB_TXPKTS_MASK              (0xFFFFU)                                           /*!< ENET_RMON_T_JAB.TXPKTS Mask             */
#define ENET_RMON_T_JAB_TXPKTS_SHIFT             (0U)                                                /*!< ENET_RMON_T_JAB.TXPKTS Position         */
#define ENET_RMON_T_JAB_TXPKTS(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_JAB.TXPKTS Field            */
/* ------- RMON_T_COL Bit Fields                    ------ */
#define ENET_RMON_T_COL_TXPKTS_MASK              (0xFFFFU)                                           /*!< ENET_RMON_T_COL.TXPKTS Mask             */
#define ENET_RMON_T_COL_TXPKTS_SHIFT             (0U)                                                /*!< ENET_RMON_T_COL.TXPKTS Position         */
#define ENET_RMON_T_COL_TXPKTS(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_COL.TXPKTS Field            */
/* ------- RMON_T_P64 Bit Fields                    ------ */
#define ENET_RMON_T_P64_TXPKTS_MASK              (0xFFFFU)                                           /*!< ENET_RMON_T_P64.TXPKTS Mask             */
#define ENET_RMON_T_P64_TXPKTS_SHIFT             (0U)                                                /*!< ENET_RMON_T_P64.TXPKTS Position         */
#define ENET_RMON_T_P64_TXPKTS(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_P64.TXPKTS Field            */
/* ------- RMON_T_P65TO127 Bit Fields               ------ */
#define ENET_RMON_T_P65TO127_TXPKTS_MASK         (0xFFFFU)                                           /*!< ENET_RMON_T_P65TO127.TXPKTS Mask        */
#define ENET_RMON_T_P65TO127_TXPKTS_SHIFT        (0U)                                                /*!< ENET_RMON_T_P65TO127.TXPKTS Position    */
#define ENET_RMON_T_P65TO127_TXPKTS(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_P65TO127.TXPKTS Field       */
/* ------- RMON_T_P128TO255 Bit Fields              ------ */
#define ENET_RMON_T_P128TO255_TXPKTS_MASK        (0xFFFFU)                                           /*!< ENET_RMON_T_P128TO255.TXPKTS Mask       */
#define ENET_RMON_T_P128TO255_TXPKTS_SHIFT       (0U)                                                /*!< ENET_RMON_T_P128TO255.TXPKTS Position   */
#define ENET_RMON_T_P128TO255_TXPKTS(x)          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_P128TO255.TXPKTS Field      */
/* ------- RMON_T_P256TO511 Bit Fields              ------ */
#define ENET_RMON_T_P256TO511_TXPKTS_MASK        (0xFFFFU)                                           /*!< ENET_RMON_T_P256TO511.TXPKTS Mask       */
#define ENET_RMON_T_P256TO511_TXPKTS_SHIFT       (0U)                                                /*!< ENET_RMON_T_P256TO511.TXPKTS Position   */
#define ENET_RMON_T_P256TO511_TXPKTS(x)          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_P256TO511.TXPKTS Field      */
/* ------- RMON_T_P512TO1023 Bit Fields             ------ */
#define ENET_RMON_T_P512TO1023_TXPKTS_MASK       (0xFFFFU)                                           /*!< ENET_RMON_T_P512TO1023.TXPKTS Mask      */
#define ENET_RMON_T_P512TO1023_TXPKTS_SHIFT      (0U)                                                /*!< ENET_RMON_T_P512TO1023.TXPKTS Position  */
#define ENET_RMON_T_P512TO1023_TXPKTS(x)         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_P512TO1023.TXPKTS Field     */
/* ------- RMON_T_P1024TO2047 Bit Fields            ------ */
#define ENET_RMON_T_P1024TO2047_TXPKTS_MASK      (0xFFFFU)                                           /*!< ENET_RMON_T_P1024TO2047.TXPKTS Mask     */
#define ENET_RMON_T_P1024TO2047_TXPKTS_SHIFT     (0U)                                                /*!< ENET_RMON_T_P1024TO2047.TXPKTS Position */
#define ENET_RMON_T_P1024TO2047_TXPKTS(x)        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_P1024TO2047.TXPKTS Field    */
/* ------- RMON_T_P_GTE2048 Bit Fields              ------ */
#define ENET_RMON_T_P_GTE2048_TXPKTS_MASK        (0xFFFFU)                                           /*!< ENET_RMON_T_P_GTE2048.TXPKTS Mask       */
#define ENET_RMON_T_P_GTE2048_TXPKTS_SHIFT       (0U)                                                /*!< ENET_RMON_T_P_GTE2048.TXPKTS Position   */
#define ENET_RMON_T_P_GTE2048_TXPKTS(x)          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_T_P_GTE2048.TXPKTS Field      */
/* ------- RMON_T_OCTETS Bit Fields                 ------ */
#define ENET_RMON_T_OCTETS_TXOCTS_MASK           (0xFFFFFFFFU)                                       /*!< ENET_RMON_T_OCTETS.TXOCTS Mask          */
#define ENET_RMON_T_OCTETS_TXOCTS_SHIFT          (0U)                                                /*!< ENET_RMON_T_OCTETS.TXOCTS Position      */
#define ENET_RMON_T_OCTETS_TXOCTS(x)             (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_RMON_T_OCTETS.TXOCTS Field         */
/* ------- IEEE_T_DROP Bit Fields                   ------ */
/* ------- IEEE_T_FRAME_OK Bit Fields               ------ */
#define ENET_IEEE_T_FRAME_OK_COUNT_MASK          (0xFFFFU)                                           /*!< ENET_IEEE_T_FRAME_OK.COUNT Mask         */
#define ENET_IEEE_T_FRAME_OK_COUNT_SHIFT         (0U)                                                /*!< ENET_IEEE_T_FRAME_OK.COUNT Position     */
#define ENET_IEEE_T_FRAME_OK_COUNT(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_T_FRAME_OK.COUNT Field        */
/* ------- IEEE_T_1COL Bit Fields                   ------ */
#define ENET_IEEE_T_1COL_COUNT_MASK              (0xFFFFU)                                           /*!< ENET_IEEE_T_1COL.COUNT Mask             */
#define ENET_IEEE_T_1COL_COUNT_SHIFT             (0U)                                                /*!< ENET_IEEE_T_1COL.COUNT Position         */
#define ENET_IEEE_T_1COL_COUNT(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_T_1COL.COUNT Field            */
/* ------- IEEE_T_MCOL Bit Fields                   ------ */
#define ENET_IEEE_T_MCOL_COUNT_MASK              (0xFFFFU)                                           /*!< ENET_IEEE_T_MCOL.COUNT Mask             */
#define ENET_IEEE_T_MCOL_COUNT_SHIFT             (0U)                                                /*!< ENET_IEEE_T_MCOL.COUNT Position         */
#define ENET_IEEE_T_MCOL_COUNT(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_T_MCOL.COUNT Field            */
/* ------- IEEE_T_DEF Bit Fields                    ------ */
#define ENET_IEEE_T_DEF_COUNT_MASK               (0xFFFFU)                                           /*!< ENET_IEEE_T_DEF.COUNT Mask              */
#define ENET_IEEE_T_DEF_COUNT_SHIFT              (0U)                                                /*!< ENET_IEEE_T_DEF.COUNT Position          */
#define ENET_IEEE_T_DEF_COUNT(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_T_DEF.COUNT Field             */
/* ------- IEEE_T_LCOL Bit Fields                   ------ */
#define ENET_IEEE_T_LCOL_COUNT_MASK              (0xFFFFU)                                           /*!< ENET_IEEE_T_LCOL.COUNT Mask             */
#define ENET_IEEE_T_LCOL_COUNT_SHIFT             (0U)                                                /*!< ENET_IEEE_T_LCOL.COUNT Position         */
#define ENET_IEEE_T_LCOL_COUNT(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_T_LCOL.COUNT Field            */
/* ------- IEEE_T_EXCOL Bit Fields                  ------ */
#define ENET_IEEE_T_EXCOL_COUNT_MASK             (0xFFFFU)                                           /*!< ENET_IEEE_T_EXCOL.COUNT Mask            */
#define ENET_IEEE_T_EXCOL_COUNT_SHIFT            (0U)                                                /*!< ENET_IEEE_T_EXCOL.COUNT Position        */
#define ENET_IEEE_T_EXCOL_COUNT(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_T_EXCOL.COUNT Field           */
/* ------- IEEE_T_MACERR Bit Fields                 ------ */
#define ENET_IEEE_T_MACERR_COUNT_MASK            (0xFFFFU)                                           /*!< ENET_IEEE_T_MACERR.COUNT Mask           */
#define ENET_IEEE_T_MACERR_COUNT_SHIFT           (0U)                                                /*!< ENET_IEEE_T_MACERR.COUNT Position       */
#define ENET_IEEE_T_MACERR_COUNT(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_T_MACERR.COUNT Field          */
/* ------- IEEE_T_CSERR Bit Fields                  ------ */
#define ENET_IEEE_T_CSERR_COUNT_MASK             (0xFFFFU)                                           /*!< ENET_IEEE_T_CSERR.COUNT Mask            */
#define ENET_IEEE_T_CSERR_COUNT_SHIFT            (0U)                                                /*!< ENET_IEEE_T_CSERR.COUNT Position        */
#define ENET_IEEE_T_CSERR_COUNT(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_T_CSERR.COUNT Field           */
/* ------- IEEE_T_SQE Bit Fields                    ------ */
#define ENET_IEEE_T_SQE_COUNT_MASK               (0xFFFFU)                                           /*!< ENET_IEEE_T_SQE.COUNT Mask              */
#define ENET_IEEE_T_SQE_COUNT_SHIFT              (0U)                                                /*!< ENET_IEEE_T_SQE.COUNT Position          */
#define ENET_IEEE_T_SQE_COUNT(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_T_SQE.COUNT Field             */
/* ------- IEEE_T_FDXFC Bit Fields                  ------ */
#define ENET_IEEE_T_FDXFC_COUNT_MASK             (0xFFFFU)                                           /*!< ENET_IEEE_T_FDXFC.COUNT Mask            */
#define ENET_IEEE_T_FDXFC_COUNT_SHIFT            (0U)                                                /*!< ENET_IEEE_T_FDXFC.COUNT Position        */
#define ENET_IEEE_T_FDXFC_COUNT(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_T_FDXFC.COUNT Field           */
/* ------- IEEE_T_OCTETS_OK Bit Fields              ------ */
#define ENET_IEEE_T_OCTETS_OK_COUNT_MASK         (0xFFFFFFFFU)                                       /*!< ENET_IEEE_T_OCTETS_OK.COUNT Mask        */
#define ENET_IEEE_T_OCTETS_OK_COUNT_SHIFT        (0U)                                                /*!< ENET_IEEE_T_OCTETS_OK.COUNT Position    */
#define ENET_IEEE_T_OCTETS_OK_COUNT(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_IEEE_T_OCTETS_OK.COUNT Field       */
/* ------- RMON_R_PACKETS Bit Fields                ------ */
#define ENET_RMON_R_PACKETS_COUNT_MASK           (0xFFFFU)                                           /*!< ENET_RMON_R_PACKETS.COUNT Mask          */
#define ENET_RMON_R_PACKETS_COUNT_SHIFT          (0U)                                                /*!< ENET_RMON_R_PACKETS.COUNT Position      */
#define ENET_RMON_R_PACKETS_COUNT(x)             (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_PACKETS.COUNT Field         */
/* ------- RMON_R_BC_PKT Bit Fields                 ------ */
#define ENET_RMON_R_BC_PKT_COUNT_MASK            (0xFFFFU)                                           /*!< ENET_RMON_R_BC_PKT.COUNT Mask           */
#define ENET_RMON_R_BC_PKT_COUNT_SHIFT           (0U)                                                /*!< ENET_RMON_R_BC_PKT.COUNT Position       */
#define ENET_RMON_R_BC_PKT_COUNT(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_BC_PKT.COUNT Field          */
/* ------- RMON_R_MC_PKT Bit Fields                 ------ */
#define ENET_RMON_R_MC_PKT_COUNT_MASK            (0xFFFFU)                                           /*!< ENET_RMON_R_MC_PKT.COUNT Mask           */
#define ENET_RMON_R_MC_PKT_COUNT_SHIFT           (0U)                                                /*!< ENET_RMON_R_MC_PKT.COUNT Position       */
#define ENET_RMON_R_MC_PKT_COUNT(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_MC_PKT.COUNT Field          */
/* ------- RMON_R_CRC_ALIGN Bit Fields              ------ */
#define ENET_RMON_R_CRC_ALIGN_COUNT_MASK         (0xFFFFU)                                           /*!< ENET_RMON_R_CRC_ALIGN.COUNT Mask        */
#define ENET_RMON_R_CRC_ALIGN_COUNT_SHIFT        (0U)                                                /*!< ENET_RMON_R_CRC_ALIGN.COUNT Position    */
#define ENET_RMON_R_CRC_ALIGN_COUNT(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_CRC_ALIGN.COUNT Field       */
/* ------- RMON_R_UNDERSIZE Bit Fields              ------ */
#define ENET_RMON_R_UNDERSIZE_COUNT_MASK         (0xFFFFU)                                           /*!< ENET_RMON_R_UNDERSIZE.COUNT Mask        */
#define ENET_RMON_R_UNDERSIZE_COUNT_SHIFT        (0U)                                                /*!< ENET_RMON_R_UNDERSIZE.COUNT Position    */
#define ENET_RMON_R_UNDERSIZE_COUNT(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_UNDERSIZE.COUNT Field       */
/* ------- RMON_R_OVERSIZE Bit Fields               ------ */
#define ENET_RMON_R_OVERSIZE_COUNT_MASK          (0xFFFFU)                                           /*!< ENET_RMON_R_OVERSIZE.COUNT Mask         */
#define ENET_RMON_R_OVERSIZE_COUNT_SHIFT         (0U)                                                /*!< ENET_RMON_R_OVERSIZE.COUNT Position     */
#define ENET_RMON_R_OVERSIZE_COUNT(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_OVERSIZE.COUNT Field        */
/* ------- RMON_R_FRAG Bit Fields                   ------ */
#define ENET_RMON_R_FRAG_COUNT_MASK              (0xFFFFU)                                           /*!< ENET_RMON_R_FRAG.COUNT Mask             */
#define ENET_RMON_R_FRAG_COUNT_SHIFT             (0U)                                                /*!< ENET_RMON_R_FRAG.COUNT Position         */
#define ENET_RMON_R_FRAG_COUNT(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_FRAG.COUNT Field            */
/* ------- RMON_R_JAB Bit Fields                    ------ */
#define ENET_RMON_R_JAB_COUNT_MASK               (0xFFFFU)                                           /*!< ENET_RMON_R_JAB.COUNT Mask              */
#define ENET_RMON_R_JAB_COUNT_SHIFT              (0U)                                                /*!< ENET_RMON_R_JAB.COUNT Position          */
#define ENET_RMON_R_JAB_COUNT(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_JAB.COUNT Field             */
/* ------- RMON_R_RESVD_0 Bit Fields                ------ */
/* ------- RMON_R_P64 Bit Fields                    ------ */
#define ENET_RMON_R_P64_COUNT_MASK               (0xFFFFU)                                           /*!< ENET_RMON_R_P64.COUNT Mask              */
#define ENET_RMON_R_P64_COUNT_SHIFT              (0U)                                                /*!< ENET_RMON_R_P64.COUNT Position          */
#define ENET_RMON_R_P64_COUNT(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_P64.COUNT Field             */
/* ------- RMON_R_P65TO127 Bit Fields               ------ */
#define ENET_RMON_R_P65TO127_COUNT_MASK          (0xFFFFU)                                           /*!< ENET_RMON_R_P65TO127.COUNT Mask         */
#define ENET_RMON_R_P65TO127_COUNT_SHIFT         (0U)                                                /*!< ENET_RMON_R_P65TO127.COUNT Position     */
#define ENET_RMON_R_P65TO127_COUNT(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_P65TO127.COUNT Field        */
/* ------- RMON_R_P128TO255 Bit Fields              ------ */
#define ENET_RMON_R_P128TO255_COUNT_MASK         (0xFFFFU)                                           /*!< ENET_RMON_R_P128TO255.COUNT Mask        */
#define ENET_RMON_R_P128TO255_COUNT_SHIFT        (0U)                                                /*!< ENET_RMON_R_P128TO255.COUNT Position    */
#define ENET_RMON_R_P128TO255_COUNT(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_P128TO255.COUNT Field       */
/* ------- RMON_R_P256TO511 Bit Fields              ------ */
#define ENET_RMON_R_P256TO511_COUNT_MASK         (0xFFFFU)                                           /*!< ENET_RMON_R_P256TO511.COUNT Mask        */
#define ENET_RMON_R_P256TO511_COUNT_SHIFT        (0U)                                                /*!< ENET_RMON_R_P256TO511.COUNT Position    */
#define ENET_RMON_R_P256TO511_COUNT(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_P256TO511.COUNT Field       */
/* ------- RMON_R_P512TO1023 Bit Fields             ------ */
#define ENET_RMON_R_P512TO1023_COUNT_MASK        (0xFFFFU)                                           /*!< ENET_RMON_R_P512TO1023.COUNT Mask       */
#define ENET_RMON_R_P512TO1023_COUNT_SHIFT       (0U)                                                /*!< ENET_RMON_R_P512TO1023.COUNT Position   */
#define ENET_RMON_R_P512TO1023_COUNT(x)          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_P512TO1023.COUNT Field      */
/* ------- RMON_R_P1024TO2047 Bit Fields            ------ */
#define ENET_RMON_R_P1024TO2047_COUNT_MASK       (0xFFFFU)                                           /*!< ENET_RMON_R_P1024TO2047.COUNT Mask      */
#define ENET_RMON_R_P1024TO2047_COUNT_SHIFT      (0U)                                                /*!< ENET_RMON_R_P1024TO2047.COUNT Position  */
#define ENET_RMON_R_P1024TO2047_COUNT(x)         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_P1024TO2047.COUNT Field     */
/* ------- RMON_R_P_GTE2048 Bit Fields              ------ */
#define ENET_RMON_R_P_GTE2048_COUNT_MASK         (0xFFFFU)                                           /*!< ENET_RMON_R_P_GTE2048.COUNT Mask        */
#define ENET_RMON_R_P_GTE2048_COUNT_SHIFT        (0U)                                                /*!< ENET_RMON_R_P_GTE2048.COUNT Position    */
