podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define ENET_RMON_R_P_GTE2048_COUNT(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_RMON_R_P_GTE2048.COUNT Field       */
/* ------- RMON_R_OCTETS Bit Fields                 ------ */
#define ENET_RMON_R_OCTETS_COUNT_MASK            (0xFFFFFFFFU)                                       /*!< ENET_RMON_R_OCTETS.COUNT Mask           */
#define ENET_RMON_R_OCTETS_COUNT_SHIFT           (0U)                                                /*!< ENET_RMON_R_OCTETS.COUNT Position       */
#define ENET_RMON_R_OCTETS_COUNT(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_RMON_R_OCTETS.COUNT Field          */
/* ------- IEEE_R_DROP Bit Fields                   ------ */
#define ENET_IEEE_R_DROP_COUNT_MASK              (0xFFFFU)                                           /*!< ENET_IEEE_R_DROP.COUNT Mask             */
#define ENET_IEEE_R_DROP_COUNT_SHIFT             (0U)                                                /*!< ENET_IEEE_R_DROP.COUNT Position         */
#define ENET_IEEE_R_DROP_COUNT(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_R_DROP.COUNT Field            */
/* ------- IEEE_R_FRAME_OK Bit Fields               ------ */
#define ENET_IEEE_R_FRAME_OK_COUNT_MASK          (0xFFFFU)                                           /*!< ENET_IEEE_R_FRAME_OK.COUNT Mask         */
#define ENET_IEEE_R_FRAME_OK_COUNT_SHIFT         (0U)                                                /*!< ENET_IEEE_R_FRAME_OK.COUNT Position     */
#define ENET_IEEE_R_FRAME_OK_COUNT(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_R_FRAME_OK.COUNT Field        */
/* ------- IEEE_R_CRC Bit Fields                    ------ */
#define ENET_IEEE_R_CRC_COUNT_MASK               (0xFFFFU)                                           /*!< ENET_IEEE_R_CRC.COUNT Mask              */
#define ENET_IEEE_R_CRC_COUNT_SHIFT              (0U)                                                /*!< ENET_IEEE_R_CRC.COUNT Position          */
#define ENET_IEEE_R_CRC_COUNT(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_R_CRC.COUNT Field             */
/* ------- IEEE_R_ALIGN Bit Fields                  ------ */
#define ENET_IEEE_R_ALIGN_COUNT_MASK             (0xFFFFU)                                           /*!< ENET_IEEE_R_ALIGN.COUNT Mask            */
#define ENET_IEEE_R_ALIGN_COUNT_SHIFT            (0U)                                                /*!< ENET_IEEE_R_ALIGN.COUNT Position        */
#define ENET_IEEE_R_ALIGN_COUNT(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_R_ALIGN.COUNT Field           */
/* ------- IEEE_R_MACERR Bit Fields                 ------ */
#define ENET_IEEE_R_MACERR_COUNT_MASK            (0xFFFFU)                                           /*!< ENET_IEEE_R_MACERR.COUNT Mask           */
#define ENET_IEEE_R_MACERR_COUNT_SHIFT           (0U)                                                /*!< ENET_IEEE_R_MACERR.COUNT Position       */
#define ENET_IEEE_R_MACERR_COUNT(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_R_MACERR.COUNT Field          */
/* ------- IEEE_R_FDXFC Bit Fields                  ------ */
#define ENET_IEEE_R_FDXFC_COUNT_MASK             (0xFFFFU)                                           /*!< ENET_IEEE_R_FDXFC.COUNT Mask            */
#define ENET_IEEE_R_FDXFC_COUNT_SHIFT            (0U)                                                /*!< ENET_IEEE_R_FDXFC.COUNT Position        */
#define ENET_IEEE_R_FDXFC_COUNT(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ENET_IEEE_R_FDXFC.COUNT Field           */
/* ------- IEEE_R_OCTETS_OK Bit Fields              ------ */
#define ENET_IEEE_R_OCTETS_OK_COUNT_MASK         (0xFFFFFFFFU)                                       /*!< ENET_IEEE_R_OCTETS_OK.COUNT Mask        */
#define ENET_IEEE_R_OCTETS_OK_COUNT_SHIFT        (0U)                                                /*!< ENET_IEEE_R_OCTETS_OK.COUNT Position    */
#define ENET_IEEE_R_OCTETS_OK_COUNT(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_IEEE_R_OCTETS_OK.COUNT Field       */
/* ------- ATCR Bit Fields                          ------ */
#define ENET_ATCR_EN_MASK                        (0x1U)                                              /*!< ENET_ATCR.EN Mask                       */
#define ENET_ATCR_EN_SHIFT                       (0U)                                                /*!< ENET_ATCR.EN Position                   */
#define ENET_ATCR_EN(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ENET_ATCR.EN Field                      */
#define ENET_ATCR_OFFEN_MASK                     (0x4U)                                              /*!< ENET_ATCR.OFFEN Mask                    */
#define ENET_ATCR_OFFEN_SHIFT                    (2U)                                                /*!< ENET_ATCR.OFFEN Position                */
#define ENET_ATCR_OFFEN(x)                       (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ENET_ATCR.OFFEN Field                   */
#define ENET_ATCR_OFFRST_MASK                    (0x8U)                                              /*!< ENET_ATCR.OFFRST Mask                   */
#define ENET_ATCR_OFFRST_SHIFT                   (3U)                                                /*!< ENET_ATCR.OFFRST Position               */
#define ENET_ATCR_OFFRST(x)                      (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< ENET_ATCR.OFFRST Field                  */
#define ENET_ATCR_PEREN_MASK                     (0x10U)                                             /*!< ENET_ATCR.PEREN Mask                    */
#define ENET_ATCR_PEREN_SHIFT                    (4U)                                                /*!< ENET_ATCR.PEREN Position                */
#define ENET_ATCR_PEREN(x)                       (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< ENET_ATCR.PEREN Field                   */
#define ENET_ATCR_PINPER_MASK                    (0x80U)                                             /*!< ENET_ATCR.PINPER Mask                   */
#define ENET_ATCR_PINPER_SHIFT                   (7U)                                                /*!< ENET_ATCR.PINPER Position               */
#define ENET_ATCR_PINPER(x)                      (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ENET_ATCR.PINPER Field                  */
#define ENET_ATCR_RESTART_MASK                   (0x200U)                                            /*!< ENET_ATCR.RESTART Mask                  */
#define ENET_ATCR_RESTART_SHIFT                  (9U)                                                /*!< ENET_ATCR.RESTART Position              */
#define ENET_ATCR_RESTART(x)                     (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< ENET_ATCR.RESTART Field                 */
#define ENET_ATCR_CAPTURE_MASK                   (0x800U)                                            /*!< ENET_ATCR.CAPTURE Mask                  */
#define ENET_ATCR_CAPTURE_SHIFT                  (11U)                                               /*!< ENET_ATCR.CAPTURE Position              */
#define ENET_ATCR_CAPTURE(x)                     (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< ENET_ATCR.CAPTURE Field                 */
#define ENET_ATCR_SLAVE_MASK                     (0x2000U)                                           /*!< ENET_ATCR.SLAVE Mask                    */
#define ENET_ATCR_SLAVE_SHIFT                    (13U)                                               /*!< ENET_ATCR.SLAVE Position                */
#define ENET_ATCR_SLAVE(x)                       (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< ENET_ATCR.SLAVE Field                   */
/* ------- ATVR Bit Fields                          ------ */
#define ENET_ATVR_ATIME_MASK                     (0xFFFFFFFFU)                                       /*!< ENET_ATVR.ATIME Mask                    */
#define ENET_ATVR_ATIME_SHIFT                    (0U)                                                /*!< ENET_ATVR.ATIME Position                */
#define ENET_ATVR_ATIME(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_ATVR.ATIME Field                   */
/* ------- ATOFF Bit Fields                         ------ */
#define ENET_ATOFF_OFFSET_MASK                   (0xFFFFFFFFU)                                       /*!< ENET_ATOFF.OFFSET Mask                  */
#define ENET_ATOFF_OFFSET_SHIFT                  (0U)                                                /*!< ENET_ATOFF.OFFSET Position              */
#define ENET_ATOFF_OFFSET(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_ATOFF.OFFSET Field                 */
/* ------- ATPER Bit Fields                         ------ */
#define ENET_ATPER_PERIOD_MASK                   (0xFFFFFFFFU)                                       /*!< ENET_ATPER.PERIOD Mask                  */
#define ENET_ATPER_PERIOD_SHIFT                  (0U)                                                /*!< ENET_ATPER.PERIOD Position              */
#define ENET_ATPER_PERIOD(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_ATPER.PERIOD Field                 */
/* ------- ATCOR Bit Fields                         ------ */
#define ENET_ATCOR_COR_MASK                      (0x7FFFFFFFU)                                       /*!< ENET_ATCOR.COR Mask                     */
#define ENET_ATCOR_COR_SHIFT                     (0U)                                                /*!< ENET_ATCOR.COR Position                 */
#define ENET_ATCOR_COR(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x7FFFFFFFUL)    /*!< ENET_ATCOR.COR Field                    */
/* ------- ATINC Bit Fields                         ------ */
#define ENET_ATINC_INC_MASK                      (0x7FU)                                             /*!< ENET_ATINC.INC Mask                     */
#define ENET_ATINC_INC_SHIFT                     (0U)                                                /*!< ENET_ATINC.INC Position                 */
#define ENET_ATINC_INC(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x7FUL)          /*!< ENET_ATINC.INC Field                    */
#define ENET_ATINC_INC_CORR_MASK                 (0x7F00U)                                           /*!< ENET_ATINC.INC_CORR Mask                */
#define ENET_ATINC_INC_CORR_SHIFT                (8U)                                                /*!< ENET_ATINC.INC_CORR Position            */
#define ENET_ATINC_INC_CORR(x)                   (((uint32_t)(((uint32_t)(x))<<8U))&0x7F00UL)        /*!< ENET_ATINC.INC_CORR Field               */
/* ------- ATSTMP Bit Fields                        ------ */
#define ENET_ATSTMP_TIMESTAMP_MASK               (0xFFFFFFFFU)                                       /*!< ENET_ATSTMP.TIMESTAMP Mask              */
#define ENET_ATSTMP_TIMESTAMP_SHIFT              (0U)                                                /*!< ENET_ATSTMP.TIMESTAMP Position          */
#define ENET_ATSTMP_TIMESTAMP(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_ATSTMP.TIMESTAMP Field             */
/* ------- TGSR Bit Fields                          ------ */
#define ENET_TGSR_TF0_MASK                       (0x1U)                                              /*!< ENET_TGSR.TF0 Mask                      */
#define ENET_TGSR_TF0_SHIFT                      (0U)                                                /*!< ENET_TGSR.TF0 Position                  */
#define ENET_TGSR_TF0(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ENET_TGSR.TF0 Field                     */
#define ENET_TGSR_TF1_MASK                       (0x2U)                                              /*!< ENET_TGSR.TF1 Mask                      */
#define ENET_TGSR_TF1_SHIFT                      (1U)                                                /*!< ENET_TGSR.TF1 Position                  */
#define ENET_TGSR_TF1(x)                         (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< ENET_TGSR.TF1 Field                     */
#define ENET_TGSR_TF2_MASK                       (0x4U)                                              /*!< ENET_TGSR.TF2 Mask                      */
#define ENET_TGSR_TF2_SHIFT                      (2U)                                                /*!< ENET_TGSR.TF2 Position                  */
#define ENET_TGSR_TF2(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ENET_TGSR.TF2 Field                     */
#define ENET_TGSR_TF3_MASK                       (0x8U)                                              /*!< ENET_TGSR.TF3 Mask                      */
#define ENET_TGSR_TF3_SHIFT                      (3U)                                                /*!< ENET_TGSR.TF3 Position                  */
#define ENET_TGSR_TF3(x)                         (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< ENET_TGSR.TF3 Field                     */
/* ------- TCSR0 Bit Fields                         ------ */
#define ENET_TCSR0_TDRE_MASK                     (0x1U)                                              /*!< ENET_TCSR0.TDRE Mask                    */
#define ENET_TCSR0_TDRE_SHIFT                    (0U)                                                /*!< ENET_TCSR0.TDRE Position                */
#define ENET_TCSR0_TDRE(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ENET_TCSR0.TDRE Field                   */
#define ENET_TCSR0_TMODE_MASK                    (0x3CU)                                             /*!< ENET_TCSR0.TMODE Mask                   */
#define ENET_TCSR0_TMODE_SHIFT                   (2U)                                                /*!< ENET_TCSR0.TMODE Position               */
#define ENET_TCSR0_TMODE(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x3CUL)          /*!< ENET_TCSR0.TMODE Field                  */
#define ENET_TCSR0_TIE_MASK                      (0x40U)                                             /*!< ENET_TCSR0.TIE Mask                     */
#define ENET_TCSR0_TIE_SHIFT                     (6U)                                                /*!< ENET_TCSR0.TIE Position                 */
#define ENET_TCSR0_TIE(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< ENET_TCSR0.TIE Field                    */
#define ENET_TCSR0_TF_MASK                       (0x80U)                                             /*!< ENET_TCSR0.TF Mask                      */
#define ENET_TCSR0_TF_SHIFT                      (7U)                                                /*!< ENET_TCSR0.TF Position                  */
#define ENET_TCSR0_TF(x)                         (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ENET_TCSR0.TF Field                     */
/* ------- TCCR0 Bit Fields                         ------ */
#define ENET_TCCR0_TCC_MASK                      (0xFFFFFFFFU)                                       /*!< ENET_TCCR0.TCC Mask                     */
#define ENET_TCCR0_TCC_SHIFT                     (0U)                                                /*!< ENET_TCCR0.TCC Position                 */
#define ENET_TCCR0_TCC(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_TCCR0.TCC Field                    */
/* ------- TCSR1 Bit Fields                         ------ */
#define ENET_TCSR1_TDRE_MASK                     (0x1U)                                              /*!< ENET_TCSR1.TDRE Mask                    */
#define ENET_TCSR1_TDRE_SHIFT                    (0U)                                                /*!< ENET_TCSR1.TDRE Position                */
#define ENET_TCSR1_TDRE(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ENET_TCSR1.TDRE Field                   */
#define ENET_TCSR1_TMODE_MASK                    (0x3CU)                                             /*!< ENET_TCSR1.TMODE Mask                   */
#define ENET_TCSR1_TMODE_SHIFT                   (2U)                                                /*!< ENET_TCSR1.TMODE Position               */
#define ENET_TCSR1_TMODE(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x3CUL)          /*!< ENET_TCSR1.TMODE Field                  */
#define ENET_TCSR1_TIE_MASK                      (0x40U)                                             /*!< ENET_TCSR1.TIE Mask                     */
#define ENET_TCSR1_TIE_SHIFT                     (6U)                                                /*!< ENET_TCSR1.TIE Position                 */
#define ENET_TCSR1_TIE(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< ENET_TCSR1.TIE Field                    */
#define ENET_TCSR1_TF_MASK                       (0x80U)                                             /*!< ENET_TCSR1.TF Mask                      */
#define ENET_TCSR1_TF_SHIFT                      (7U)                                                /*!< ENET_TCSR1.TF Position                  */
#define ENET_TCSR1_TF(x)                         (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ENET_TCSR1.TF Field                     */
/* ------- TCCR1 Bit Fields                         ------ */
#define ENET_TCCR1_TCC_MASK                      (0xFFFFFFFFU)                                       /*!< ENET_TCCR1.TCC Mask                     */
#define ENET_TCCR1_TCC_SHIFT                     (0U)                                                /*!< ENET_TCCR1.TCC Position                 */
#define ENET_TCCR1_TCC(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_TCCR1.TCC Field                    */
/* ------- TCSR2 Bit Fields                         ------ */
#define ENET_TCSR2_TDRE_MASK                     (0x1U)                                              /*!< ENET_TCSR2.TDRE Mask                    */
#define ENET_TCSR2_TDRE_SHIFT                    (0U)                                                /*!< ENET_TCSR2.TDRE Position                */
#define ENET_TCSR2_TDRE(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ENET_TCSR2.TDRE Field                   */
#define ENET_TCSR2_TMODE_MASK                    (0x3CU)                                             /*!< ENET_TCSR2.TMODE Mask                   */
#define ENET_TCSR2_TMODE_SHIFT                   (2U)                                                /*!< ENET_TCSR2.TMODE Position               */
#define ENET_TCSR2_TMODE(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x3CUL)          /*!< ENET_TCSR2.TMODE Field                  */
#define ENET_TCSR2_TIE_MASK                      (0x40U)                                             /*!< ENET_TCSR2.TIE Mask                     */
#define ENET_TCSR2_TIE_SHIFT                     (6U)                                                /*!< ENET_TCSR2.TIE Position                 */
#define ENET_TCSR2_TIE(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< ENET_TCSR2.TIE Field                    */
#define ENET_TCSR2_TF_MASK                       (0x80U)                                             /*!< ENET_TCSR2.TF Mask                      */
#define ENET_TCSR2_TF_SHIFT                      (7U)                                                /*!< ENET_TCSR2.TF Position                  */
#define ENET_TCSR2_TF(x)                         (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ENET_TCSR2.TF Field                     */
/* ------- TCCR2 Bit Fields                         ------ */
#define ENET_TCCR2_TCC_MASK                      (0xFFFFFFFFU)                                       /*!< ENET_TCCR2.TCC Mask                     */
#define ENET_TCCR2_TCC_SHIFT                     (0U)                                                /*!< ENET_TCCR2.TCC Position                 */
#define ENET_TCCR2_TCC(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_TCCR2.TCC Field                    */
/* ------- TCSR3 Bit Fields                         ------ */
#define ENET_TCSR3_TDRE_MASK                     (0x1U)                                              /*!< ENET_TCSR3.TDRE Mask                    */
#define ENET_TCSR3_TDRE_SHIFT                    (0U)                                                /*!< ENET_TCSR3.TDRE Position                */
#define ENET_TCSR3_TDRE(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ENET_TCSR3.TDRE Field                   */
#define ENET_TCSR3_TMODE_MASK                    (0x3CU)                                             /*!< ENET_TCSR3.TMODE Mask                   */
#define ENET_TCSR3_TMODE_SHIFT                   (2U)                                                /*!< ENET_TCSR3.TMODE Position               */
#define ENET_TCSR3_TMODE(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x3CUL)          /*!< ENET_TCSR3.TMODE Field                  */
#define ENET_TCSR3_TIE_MASK                      (0x40U)                                             /*!< ENET_TCSR3.TIE Mask                     */
#define ENET_TCSR3_TIE_SHIFT                     (6U)                                                /*!< ENET_TCSR3.TIE Position                 */
#define ENET_TCSR3_TIE(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< ENET_TCSR3.TIE Field                    */
#define ENET_TCSR3_TF_MASK                       (0x80U)                                             /*!< ENET_TCSR3.TF Mask                      */
#define ENET_TCSR3_TF_SHIFT                      (7U)                                                /*!< ENET_TCSR3.TF Position                  */
#define ENET_TCSR3_TF(x)                         (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ENET_TCSR3.TF Field                     */
/* ------- TCCR3 Bit Fields                         ------ */
#define ENET_TCCR3_TCC_MASK                      (0xFFFFFFFFU)                                       /*!< ENET_TCCR3.TCC Mask                     */
#define ENET_TCCR3_TCC_SHIFT                     (0U)                                                /*!< ENET_TCCR3.TCC Position                 */
#define ENET_TCCR3_TCC(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ENET_TCCR3.TCC Field                    */
/**
 * @} */ /* End group ENET_Register_Masks_GROUP 
 */

