podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/* ENET - Peripheral instance base addresses */
#define ENET_BasePtr                   0x400C0000UL //!< Peripheral base address
#define ENET                           ((ENET_Type *) ENET_BasePtr) //!< Freescale base pointer
#define ENET_BASE_PTR                  (ENET) //!< Freescale style base pointer
#define ENET_IRQS { ENET_1588Timeout_IRQn, ENET_Transmit_IRQn, ENET_Receive_IRQn, ENET_Error_IRQn,  }

/**
 * @} */ /* End group ENET_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup EWM_Peripheral_access_layer_GROUP EWM Peripheral Access Layer
* @brief C Struct for EWM
* @{
*/

/* ================================================================================ */
/* ================           EWM (file:EWM_INT)                   ================ */
/* ================================================================================ */

/**
 * @brief External Watchdog Monitor
 */
/**
* @addtogroup EWM_structs_GROUP EWM struct
* @brief Struct for EWM
* @{
*/
typedef struct EWM_Type {
   __IO uint8_t   CTRL;                         /**< 0000: Control Register                                             */
   __O  uint8_t   SERV;                         /**< 0001: Service Register                                             */
   __IO uint8_t   CMPL;                         /**< 0002: Compare Low Register                                         */
   __IO uint8_t   CMPH;                         /**< 0003: Compare High Register                                        */
} EWM_Type;

/**
 * @} */ /* End group EWM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'EWM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup EWM_Register_Masks_GROUP EWM Register Masks
* @brief Register Masks for EWM
* @{
*/
/* ------- CTRL Bit Fields                          ------ */
#define EWM_CTRL_EWMEN_MASK                      (0x1U)                                              /*!< EWM_CTRL.EWMEN Mask                     */
#define EWM_CTRL_EWMEN_SHIFT                     (0U)                                                /*!< EWM_CTRL.EWMEN Position                 */
#define EWM_CTRL_EWMEN(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< EWM_CTRL.EWMEN Field                    */
#define EWM_CTRL_ASSIN_MASK                      (0x2U)                                              /*!< EWM_CTRL.ASSIN Mask                     */
#define EWM_CTRL_ASSIN_SHIFT                     (1U)                                                /*!< EWM_CTRL.ASSIN Position                 */
#define EWM_CTRL_ASSIN(x)                        (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< EWM_CTRL.ASSIN Field                    */
#define EWM_CTRL_INEN_MASK                       (0x4U)                                              /*!< EWM_CTRL.INEN Mask                      */
#define EWM_CTRL_INEN_SHIFT                      (2U)                                                /*!< EWM_CTRL.INEN Position                  */
#define EWM_CTRL_INEN(x)                         (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< EWM_CTRL.INEN Field                     */
#define EWM_CTRL_INTEN_MASK                      (0x8U)                                              /*!< EWM_CTRL.INTEN Mask                     */
#define EWM_CTRL_INTEN_SHIFT                     (3U)                                                /*!< EWM_CTRL.INTEN Position                 */
#define EWM_CTRL_INTEN(x)                        (((uint8_t)(((uint8_t)(x))<<3U))&0x8UL)             /*!< EWM_CTRL.INTEN Field                    */
/* ------- SERV Bit Fields                          ------ */
#define EWM_SERV_SERVICE_MASK                    (0xFFU)                                             /*!< EWM_SERV.SERVICE Mask                   */
#define EWM_SERV_SERVICE_SHIFT                   (0U)                                                /*!< EWM_SERV.SERVICE Position               */
#define EWM_SERV_SERVICE(x)                      (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< EWM_SERV.SERVICE Field                  */
/* ------- CMPL Bit Fields                          ------ */
#define EWM_CMPL_COMPAREL_MASK                   (0xFFU)                                             /*!< EWM_CMPL.COMPAREL Mask                  */
#define EWM_CMPL_COMPAREL_SHIFT                  (0U)                                                /*!< EWM_CMPL.COMPAREL Position              */
#define EWM_CMPL_COMPAREL(x)                     (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< EWM_CMPL.COMPAREL Field                 */
/* ------- CMPH Bit Fields                          ------ */
#define EWM_CMPH_COMPAREH_MASK                   (0xFFU)                                             /*!< EWM_CMPH.COMPAREH Mask                  */
#define EWM_CMPH_COMPAREH_SHIFT                  (0U)                                                /*!< EWM_CMPH.COMPAREH Position              */
#define EWM_CMPH_COMPAREH(x)                     (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< EWM_CMPH.COMPAREH Field                 */
/**
 * @} */ /* End group EWM_Register_Masks_GROUP 
 */

/* EWM - Peripheral instance base addresses */
#define EWM_BasePtr                    0x40061000UL //!< Peripheral base address
#define EWM                            ((EWM_Type *) EWM_BasePtr) //!< Freescale base pointer
#define EWM_BASE_PTR                   (EWM) //!< Freescale style base pointer
#define EWM_IRQS { WDOG_IRQn,  }

/**
 * @} */ /* End group EWM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FB_Peripheral_access_layer_GROUP FB Peripheral Access Layer
* @brief C Struct for FB
* @{
*/

/* ================================================================================ */
/* ================           FB (file:FB)                         ================ */
/* ================================================================================ */

/**
 * @brief FlexBus external bus interface
 */
/**
* @addtogroup FB_structs_GROUP FB struct
* @brief Struct for FB
* @{
*/
typedef struct FB_Type {
   struct {
      __IO uint32_t  CSAR;                      /**< 0000: Chip Select Address Register                                 */
      __IO uint32_t  CSMR;                      /**< 0004: Chip Select Mask Register                                    */
      __IO uint32_t  CSCR;                      /**< 0008: Chip Select Control Register                                 */
   } CS[6];                                     /**< 0000: (cluster: size=0x0048, 72)                                   */
        uint8_t   RESERVED_1[24];               /**< 0048: 0x18 bytes                                                   */
   __IO uint32_t  CSPMCR;                       /**< 0060: Chip Select port Multiplexing Control Register               */
} FB_Type;

/**
 * @} */ /* End group FB_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FB' Position & Mask macros                          ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup FB_Register_Masks_GROUP FB Register Masks
* @brief Register Masks for FB
* @{
*/
/* ------- CSAR Bit Fields                          ------ */
#define FB_CSAR_BA_MASK                          (0xFFFF0000U)                                       /*!< FB_CSAR.BA Mask                         */
#define FB_CSAR_BA_SHIFT                         (16U)                                               /*!< FB_CSAR.BA Position                     */
#define FB_CSAR_BA(x)                            (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< FB_CSAR.BA Field                        */
/* ------- CSMR Bit Fields                          ------ */
#define FB_CSMR_V_MASK                           (0x1U)                                              /*!< FB_CSMR.V Mask                          */
#define FB_CSMR_V_SHIFT                          (0U)                                                /*!< FB_CSMR.V Position                      */
#define FB_CSMR_V(x)                             (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FB_CSMR.V Field                         */
#define FB_CSMR_WP_MASK                          (0x100U)                                            /*!< FB_CSMR.WP Mask                         */
#define FB_CSMR_WP_SHIFT                         (8U)                                                /*!< FB_CSMR.WP Position                     */
#define FB_CSMR_WP(x)                            (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< FB_CSMR.WP Field                        */
#define FB_CSMR_BAM_MASK                         (0xFFFF0000U)                                       /*!< FB_CSMR.BAM Mask                        */
#define FB_CSMR_BAM_SHIFT                        (16U)                                               /*!< FB_CSMR.BAM Position                    */
#define FB_CSMR_BAM(x)                           (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< FB_CSMR.BAM Field                       */
/* ------- CSCR Bit Fields                          ------ */
#define FB_CSCR_BSTW_MASK                        (0x8U)                                              /*!< FB_CSCR.BSTW Mask                       */
#define FB_CSCR_BSTW_SHIFT                       (3U)                                                /*!< FB_CSCR.BSTW Position                   */
#define FB_CSCR_BSTW(x)                          (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< FB_CSCR.BSTW Field                      */
#define FB_CSCR_BSTR_MASK                        (0x10U)                                             /*!< FB_CSCR.BSTR Mask                       */
#define FB_CSCR_BSTR_SHIFT                       (4U)                                                /*!< FB_CSCR.BSTR Position                   */
#define FB_CSCR_BSTR(x)                          (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< FB_CSCR.BSTR Field                      */
#define FB_CSCR_BEM_MASK                         (0x20U)                                             /*!< FB_CSCR.BEM Mask                        */
#define FB_CSCR_BEM_SHIFT                        (5U)                                                /*!< FB_CSCR.BEM Position                    */
#define FB_CSCR_BEM(x)                           (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< FB_CSCR.BEM Field                       */
#define FB_CSCR_PS_MASK                          (0xC0U)                                             /*!< FB_CSCR.PS Mask                         */
#define FB_CSCR_PS_SHIFT                         (6U)                                                /*!< FB_CSCR.PS Position                     */
#define FB_CSCR_PS(x)                            (((uint32_t)(((uint32_t)(x))<<6U))&0xC0UL)          /*!< FB_CSCR.PS Field                        */
#define FB_CSCR_AA_MASK                          (0x100U)                                            /*!< FB_CSCR.AA Mask                         */
#define FB_CSCR_AA_SHIFT                         (8U)                                                /*!< FB_CSCR.AA Position                     */
#define FB_CSCR_AA(x)                            (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< FB_CSCR.AA Field                        */
#define FB_CSCR_BLS_MASK                         (0x200U)                                            /*!< FB_CSCR.BLS Mask                        */
#define FB_CSCR_BLS_SHIFT                        (9U)                                                /*!< FB_CSCR.BLS Position                    */
#define FB_CSCR_BLS(x)                           (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< FB_CSCR.BLS Field                       */
#define FB_CSCR_WS_MASK                          (0xFC00U)                                           /*!< FB_CSCR.WS Mask                         */
#define FB_CSCR_WS_SHIFT                         (10U)                                               /*!< FB_CSCR.WS Position                     */
#define FB_CSCR_WS(x)                            (((uint32_t)(((uint32_t)(x))<<10U))&0xFC00UL)       /*!< FB_CSCR.WS Field                        */
#define FB_CSCR_WRAH_MASK                        (0x30000U)                                          /*!< FB_CSCR.WRAH Mask                       */
#define FB_CSCR_WRAH_SHIFT                       (16U)                                               /*!< FB_CSCR.WRAH Position                   */
#define FB_CSCR_WRAH(x)                          (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< FB_CSCR.WRAH Field                      */
#define FB_CSCR_RDAH_MASK                        (0xC0000U)                                          /*!< FB_CSCR.RDAH Mask                       */
#define FB_CSCR_RDAH_SHIFT                       (18U)                                               /*!< FB_CSCR.RDAH Position                   */
#define FB_CSCR_RDAH(x)                          (((uint32_t)(((uint32_t)(x))<<18U))&0xC0000UL)      /*!< FB_CSCR.RDAH Field                      */
#define FB_CSCR_ASET_MASK                        (0x300000U)                                         /*!< FB_CSCR.ASET Mask                       */
#define FB_CSCR_ASET_SHIFT                       (20U)                                               /*!< FB_CSCR.ASET Position                   */
#define FB_CSCR_ASET(x)                          (((uint32_t)(((uint32_t)(x))<<20U))&0x300000UL)     /*!< FB_CSCR.ASET Field                      */
#define FB_CSCR_EXTS_MASK                        (0x400000U)                                         /*!< FB_CSCR.EXTS Mask                       */
#define FB_CSCR_EXTS_SHIFT                       (22U)                                               /*!< FB_CSCR.EXTS Position                   */
#define FB_CSCR_EXTS(x)                          (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< FB_CSCR.EXTS Field                      */
#define FB_CSCR_SWSEN_MASK                       (0x800000U)                                         /*!< FB_CSCR.SWSEN Mask                      */
#define FB_CSCR_SWSEN_SHIFT                      (23U)                                               /*!< FB_CSCR.SWSEN Position                  */
#define FB_CSCR_SWSEN(x)                         (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< FB_CSCR.SWSEN Field                     */
#define FB_CSCR_SWS_MASK                         (0xFC000000U)                                       /*!< FB_CSCR.SWS Mask                        */
#define FB_CSCR_SWS_SHIFT                        (26U)                                               /*!< FB_CSCR.SWS Position                    */
#define FB_CSCR_SWS(x)                           (((uint32_t)(((uint32_t)(x))<<26U))&0xFC000000UL)   /*!< FB_CSCR.SWS Field                       */
/* ------- CSPMCR Bit Fields                        ------ */
#define FB_CSPMCR_GROUP5_MASK                    (0xF000U)                                           /*!< FB_CSPMCR.GROUP5 Mask                   */
#define FB_CSPMCR_GROUP5_SHIFT                   (12U)                                               /*!< FB_CSPMCR.GROUP5 Position               */
#define FB_CSPMCR_GROUP5(x)                      (((uint32_t)(((uint32_t)(x))<<12U))&0xF000UL)       /*!< FB_CSPMCR.GROUP5 Field                  */
#define FB_CSPMCR_GROUP4_MASK                    (0xF0000U)                                          /*!< FB_CSPMCR.GROUP4 Mask                   */
#define FB_CSPMCR_GROUP4_SHIFT                   (16U)                                               /*!< FB_CSPMCR.GROUP4 Position               */
#define FB_CSPMCR_GROUP4(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< FB_CSPMCR.GROUP4 Field                  */
#define FB_CSPMCR_GROUP3_MASK                    (0xF00000U)                                         /*!< FB_CSPMCR.GROUP3 Mask                   */
#define FB_CSPMCR_GROUP3_SHIFT                   (20U)                                               /*!< FB_CSPMCR.GROUP3 Position               */
#define FB_CSPMCR_GROUP3(x)                      (((uint32_t)(((uint32_t)(x))<<20U))&0xF00000UL)     /*!< FB_CSPMCR.GROUP3 Field                  */
#define FB_CSPMCR_GROUP2_MASK                    (0xF000000U)                                        /*!< FB_CSPMCR.GROUP2 Mask                   */
#define FB_CSPMCR_GROUP2_SHIFT                   (24U)                                               /*!< FB_CSPMCR.GROUP2 Position               */
#define FB_CSPMCR_GROUP2(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< FB_CSPMCR.GROUP2 Field                  */
#define FB_CSPMCR_GROUP1_MASK                    (0xF0000000U)                                       /*!< FB_CSPMCR.GROUP1 Mask                   */
#define FB_CSPMCR_GROUP1_SHIFT                   (28U)                                               /*!< FB_CSPMCR.GROUP1 Position               */
#define FB_CSPMCR_GROUP1(x)                      (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< FB_CSPMCR.GROUP1 Field                  */
/**
 * @} */ /* End group FB_Register_Masks_GROUP 
 */

/* FB - Peripheral instance base addresses */
#define FB_BasePtr                     0x4000C000UL //!< Peripheral base address
#define FB                             ((FB_Type *) FB_BasePtr) //!< Freescale base pointer
#define FB_BASE_PTR                    (FB) //!< Freescale style base pointer
/**
 * @} */ /* End group FB_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FMC_Peripheral_access_layer_GROUP FMC Peripheral Access Layer
* @brief C Struct for FMC
* @{
*/

/* ================================================================================ */
/* ================           FMC (file:FMC_MK10F12)               ================ */
/* ================================================================================ */

/**
 * @brief Flash Memory Controller
 */
/**
* @addtogroup FMC_structs_GROUP FMC struct
* @brief Struct for FMC
* @{
*/
typedef struct FMC_Type {
   __IO uint32_t  PFAPR;                        /**< 0000: Flash Access Protection Register                             */
   __IO uint32_t  PFB01CR;                      /**< 0004: Flash Bank 0-1 Control Register                              */
   __IO uint32_t  PFB23CR;                      /**< 0008: Flash Bank 2-3 Control Register                              */
        uint8_t   RESERVED_0[244];              /**< 000C: 0xF4 bytes                                                   */
   struct {
      __IO uint32_t  S0;                        /**< 0100: Cache Tag Storage                                            */
      __IO uint32_t  S1;                        /**< 0104: Cache Tag Storage                                            */
      __IO uint32_t  S2;                        /**< 0108: Cache Tag Storage                                            */
      __IO uint32_t  S3;                        /**< 010C: Cache Tag Storage                                            */
   } TAGVDW[4];                                 /**< 0100: (cluster: size=0x0040, 64)                                   */
        uint8_t   RESERVED_2[192];              /**< 0140: 0xC0 bytes                                                   */
   struct {
      __IO uint32_t  S0UM;                      /**< 0200: Cache Data Storage (uppermost word)                          */
      __IO uint32_t  S0MU;                      /**< 0204: Cache Data Storage (mid-upper word)                          */
      __IO uint32_t  S0ML;                      /**< 0208: Cache Data Storage (mid-lower word)                          */
      __IO uint32_t  S0LM;                      /**< 020C: Cache Data Storage (lowermost word)                          */
      __IO uint32_t  S1UM;                      /**< 0210: Cache Data Storage (uppermost word)                          */
      __IO uint32_t  S1MU;                      /**< 0214: Cache Data Storage (mid-upper word)                          */
      __IO uint32_t  S1ML;                      /**< 0218: Cache Data Storage (mid-lower word)                          */
      __IO uint32_t  S1LM;                      /**< 021C: Cache Data Storage (lowermost word)                          */
      __IO uint32_t  S2UM;                      /**< 0220: Cache Data Storage (uppermost word)                          */
      __IO uint32_t  S2MU;                      /**< 0224: Cache Data Storage (mid-upper word)                          */
      __IO uint32_t  S2ML;                      /**< 0228: Cache Data Storage (mid-lower word)                          */
      __IO uint32_t  S2LM;                      /**< 022C: Cache Data Storage (lowermost word)                          */
      __IO uint32_t  S3UM;                      /**< 0230: Cache Data Storage (uppermost word)                          */
      __IO uint32_t  S3MU;                      /**< 0234: Cache Data Storage (mid-upper word)                          */
      __IO uint32_t  S3ML;                      /**< 0238: Cache Data Storage (mid-lower word)                          */
      __IO uint32_t  S3LM;                      /**< 023C: Cache Data Storage (lowermost word)                          */
   } DATAW[4];                                  /**< 0200: (cluster: size=0x0100, 256)                                  */
} FMC_Type;

/**
 * @} */ /* End group FMC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FMC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

