podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
* @addtogroup FMC_Register_Masks_GROUP FMC Register Masks
* @brief Register Masks for FMC
* @{
*/
/* ------- PFAPR Bit Fields                         ------ */
#define FMC_PFAPR_M0AP_MASK                      (0x3U)                                              /*!< FMC_PFAPR.M0AP Mask                     */
#define FMC_PFAPR_M0AP_SHIFT                     (0U)                                                /*!< FMC_PFAPR.M0AP Position                 */
#define FMC_PFAPR_M0AP(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< FMC_PFAPR.M0AP Field                    */
#define FMC_PFAPR_M1AP_MASK                      (0xCU)                                              /*!< FMC_PFAPR.M1AP Mask                     */
#define FMC_PFAPR_M1AP_SHIFT                     (2U)                                                /*!< FMC_PFAPR.M1AP Position                 */
#define FMC_PFAPR_M1AP(x)                        (((uint32_t)(((uint32_t)(x))<<2U))&0xCUL)           /*!< FMC_PFAPR.M1AP Field                    */
#define FMC_PFAPR_M2AP_MASK                      (0x30U)                                             /*!< FMC_PFAPR.M2AP Mask                     */
#define FMC_PFAPR_M2AP_SHIFT                     (4U)                                                /*!< FMC_PFAPR.M2AP Position                 */
#define FMC_PFAPR_M2AP(x)                        (((uint32_t)(((uint32_t)(x))<<4U))&0x30UL)          /*!< FMC_PFAPR.M2AP Field                    */
#define FMC_PFAPR_M3AP_MASK                      (0xC0U)                                             /*!< FMC_PFAPR.M3AP Mask                     */
#define FMC_PFAPR_M3AP_SHIFT                     (6U)                                                /*!< FMC_PFAPR.M3AP Position                 */
#define FMC_PFAPR_M3AP(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0xC0UL)          /*!< FMC_PFAPR.M3AP Field                    */
#define FMC_PFAPR_M4AP_MASK                      (0x300U)                                            /*!< FMC_PFAPR.M4AP Mask                     */
#define FMC_PFAPR_M4AP_SHIFT                     (8U)                                                /*!< FMC_PFAPR.M4AP Position                 */
#define FMC_PFAPR_M4AP(x)                        (((uint32_t)(((uint32_t)(x))<<8U))&0x300UL)         /*!< FMC_PFAPR.M4AP Field                    */
#define FMC_PFAPR_M5AP_MASK                      (0xC00U)                                            /*!< FMC_PFAPR.M5AP Mask                     */
#define FMC_PFAPR_M5AP_SHIFT                     (10U)                                               /*!< FMC_PFAPR.M5AP Position                 */
#define FMC_PFAPR_M5AP(x)                        (((uint32_t)(((uint32_t)(x))<<10U))&0xC00UL)        /*!< FMC_PFAPR.M5AP Field                    */
#define FMC_PFAPR_M6AP_MASK                      (0x3000U)                                           /*!< FMC_PFAPR.M6AP Mask                     */
#define FMC_PFAPR_M6AP_SHIFT                     (12U)                                               /*!< FMC_PFAPR.M6AP Position                 */
#define FMC_PFAPR_M6AP(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0x3000UL)       /*!< FMC_PFAPR.M6AP Field                    */
#define FMC_PFAPR_M7AP_MASK                      (0xC000U)                                           /*!< FMC_PFAPR.M7AP Mask                     */
#define FMC_PFAPR_M7AP_SHIFT                     (14U)                                               /*!< FMC_PFAPR.M7AP Position                 */
#define FMC_PFAPR_M7AP(x)                        (((uint32_t)(((uint32_t)(x))<<14U))&0xC000UL)       /*!< FMC_PFAPR.M7AP Field                    */
#define FMC_PFAPR_M0PFD_MASK                     (0x10000U)                                          /*!< FMC_PFAPR.M0PFD Mask                    */
#define FMC_PFAPR_M0PFD_SHIFT                    (16U)                                               /*!< FMC_PFAPR.M0PFD Position                */
#define FMC_PFAPR_M0PFD(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< FMC_PFAPR.M0PFD Field                   */
#define FMC_PFAPR_M1PFD_MASK                     (0x20000U)                                          /*!< FMC_PFAPR.M1PFD Mask                    */
#define FMC_PFAPR_M1PFD_SHIFT                    (17U)                                               /*!< FMC_PFAPR.M1PFD Position                */
#define FMC_PFAPR_M1PFD(x)                       (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< FMC_PFAPR.M1PFD Field                   */
#define FMC_PFAPR_M2PFD_MASK                     (0x40000U)                                          /*!< FMC_PFAPR.M2PFD Mask                    */
#define FMC_PFAPR_M2PFD_SHIFT                    (18U)                                               /*!< FMC_PFAPR.M2PFD Position                */
#define FMC_PFAPR_M2PFD(x)                       (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< FMC_PFAPR.M2PFD Field                   */
#define FMC_PFAPR_M3PFD_MASK                     (0x80000U)                                          /*!< FMC_PFAPR.M3PFD Mask                    */
#define FMC_PFAPR_M3PFD_SHIFT                    (19U)                                               /*!< FMC_PFAPR.M3PFD Position                */
#define FMC_PFAPR_M3PFD(x)                       (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< FMC_PFAPR.M3PFD Field                   */
#define FMC_PFAPR_M4PFD_MASK                     (0x100000U)                                         /*!< FMC_PFAPR.M4PFD Mask                    */
#define FMC_PFAPR_M4PFD_SHIFT                    (20U)                                               /*!< FMC_PFAPR.M4PFD Position                */
#define FMC_PFAPR_M4PFD(x)                       (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< FMC_PFAPR.M4PFD Field                   */
#define FMC_PFAPR_M5PFD_MASK                     (0x200000U)                                         /*!< FMC_PFAPR.M5PFD Mask                    */
#define FMC_PFAPR_M5PFD_SHIFT                    (21U)                                               /*!< FMC_PFAPR.M5PFD Position                */
#define FMC_PFAPR_M5PFD(x)                       (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< FMC_PFAPR.M5PFD Field                   */
#define FMC_PFAPR_M6PFD_MASK                     (0x400000U)                                         /*!< FMC_PFAPR.M6PFD Mask                    */
#define FMC_PFAPR_M6PFD_SHIFT                    (22U)                                               /*!< FMC_PFAPR.M6PFD Position                */
#define FMC_PFAPR_M6PFD(x)                       (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< FMC_PFAPR.M6PFD Field                   */
#define FMC_PFAPR_M7PFD_MASK                     (0x800000U)                                         /*!< FMC_PFAPR.M7PFD Mask                    */
#define FMC_PFAPR_M7PFD_SHIFT                    (23U)                                               /*!< FMC_PFAPR.M7PFD Position                */
#define FMC_PFAPR_M7PFD(x)                       (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< FMC_PFAPR.M7PFD Field                   */
/* ------- PFB01CR Bit Fields                       ------ */
#define FMC_PFB01CR_B01SEBE_MASK                 (0x1U)                                              /*!< FMC_PFB01CR.B01SEBE Mask                */
#define FMC_PFB01CR_B01SEBE_SHIFT                (0U)                                                /*!< FMC_PFB01CR.B01SEBE Position            */
#define FMC_PFB01CR_B01SEBE(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FMC_PFB01CR.B01SEBE Field               */
#define FMC_PFB01CR_B01IPE_MASK                  (0x2U)                                              /*!< FMC_PFB01CR.B01IPE Mask                 */
#define FMC_PFB01CR_B01IPE_SHIFT                 (1U)                                                /*!< FMC_PFB01CR.B01IPE Position             */
#define FMC_PFB01CR_B01IPE(x)                    (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< FMC_PFB01CR.B01IPE Field                */
#define FMC_PFB01CR_B01DPE_MASK                  (0x4U)                                              /*!< FMC_PFB01CR.B01DPE Mask                 */
#define FMC_PFB01CR_B01DPE_SHIFT                 (2U)                                                /*!< FMC_PFB01CR.B01DPE Position             */
#define FMC_PFB01CR_B01DPE(x)                    (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< FMC_PFB01CR.B01DPE Field                */
#define FMC_PFB01CR_B01ICE_MASK                  (0x8U)                                              /*!< FMC_PFB01CR.B01ICE Mask                 */
#define FMC_PFB01CR_B01ICE_SHIFT                 (3U)                                                /*!< FMC_PFB01CR.B01ICE Position             */
#define FMC_PFB01CR_B01ICE(x)                    (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< FMC_PFB01CR.B01ICE Field                */
#define FMC_PFB01CR_B01DCE_MASK                  (0x10U)                                             /*!< FMC_PFB01CR.B01DCE Mask                 */
#define FMC_PFB01CR_B01DCE_SHIFT                 (4U)                                                /*!< FMC_PFB01CR.B01DCE Position             */
#define FMC_PFB01CR_B01DCE(x)                    (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< FMC_PFB01CR.B01DCE Field                */
#define FMC_PFB01CR_CRC_MASK                     (0xE0U)                                             /*!< FMC_PFB01CR.CRC Mask                    */
#define FMC_PFB01CR_CRC_SHIFT                    (5U)                                                /*!< FMC_PFB01CR.CRC Position                */
#define FMC_PFB01CR_CRC(x)                       (((uint32_t)(((uint32_t)(x))<<5U))&0xE0UL)          /*!< FMC_PFB01CR.CRC Field                   */
#define FMC_PFB01CR_B01MW_MASK                   (0x60000U)                                          /*!< FMC_PFB01CR.B01MW Mask                  */
#define FMC_PFB01CR_B01MW_SHIFT                  (17U)                                               /*!< FMC_PFB01CR.B01MW Position              */
#define FMC_PFB01CR_B01MW(x)                     (((uint32_t)(((uint32_t)(x))<<17U))&0x60000UL)      /*!< FMC_PFB01CR.B01MW Field                 */
#define FMC_PFB01CR_S_B_INV_MASK                 (0x80000U)                                          /*!< FMC_PFB01CR.S_B_INV Mask                */
#define FMC_PFB01CR_S_B_INV_SHIFT                (19U)                                               /*!< FMC_PFB01CR.S_B_INV Position            */
#define FMC_PFB01CR_S_B_INV(x)                   (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< FMC_PFB01CR.S_B_INV Field               */
#define FMC_PFB01CR_CINV_WAY_MASK                (0xF00000U)                                         /*!< FMC_PFB01CR.CINV_WAY Mask               */
#define FMC_PFB01CR_CINV_WAY_SHIFT               (20U)                                               /*!< FMC_PFB01CR.CINV_WAY Position           */
#define FMC_PFB01CR_CINV_WAY(x)                  (((uint32_t)(((uint32_t)(x))<<20U))&0xF00000UL)     /*!< FMC_PFB01CR.CINV_WAY Field              */
#define FMC_PFB01CR_CLCK_WAY_MASK                (0xF000000U)                                        /*!< FMC_PFB01CR.CLCK_WAY Mask               */
#define FMC_PFB01CR_CLCK_WAY_SHIFT               (24U)                                               /*!< FMC_PFB01CR.CLCK_WAY Position           */
#define FMC_PFB01CR_CLCK_WAY(x)                  (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< FMC_PFB01CR.CLCK_WAY Field              */
#define FMC_PFB01CR_B01RWSC_MASK                 (0xF0000000U)                                       /*!< FMC_PFB01CR.B01RWSC Mask                */
#define FMC_PFB01CR_B01RWSC_SHIFT                (28U)                                               /*!< FMC_PFB01CR.B01RWSC Position            */
#define FMC_PFB01CR_B01RWSC(x)                   (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< FMC_PFB01CR.B01RWSC Field               */
/* ------- PFB23CR Bit Fields                       ------ */
#define FMC_PFB23CR_B23SEBE_MASK                 (0x1U)                                              /*!< FMC_PFB23CR.B23SEBE Mask                */
#define FMC_PFB23CR_B23SEBE_SHIFT                (0U)                                                /*!< FMC_PFB23CR.B23SEBE Position            */
#define FMC_PFB23CR_B23SEBE(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FMC_PFB23CR.B23SEBE Field               */
#define FMC_PFB23CR_B23IPE_MASK                  (0x2U)                                              /*!< FMC_PFB23CR.B23IPE Mask                 */
#define FMC_PFB23CR_B23IPE_SHIFT                 (1U)                                                /*!< FMC_PFB23CR.B23IPE Position             */
#define FMC_PFB23CR_B23IPE(x)                    (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< FMC_PFB23CR.B23IPE Field                */
#define FMC_PFB23CR_B23DPE_MASK                  (0x4U)                                              /*!< FMC_PFB23CR.B23DPE Mask                 */
#define FMC_PFB23CR_B23DPE_SHIFT                 (2U)                                                /*!< FMC_PFB23CR.B23DPE Position             */
#define FMC_PFB23CR_B23DPE(x)                    (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< FMC_PFB23CR.B23DPE Field                */
#define FMC_PFB23CR_B23ICE_MASK                  (0x8U)                                              /*!< FMC_PFB23CR.B23ICE Mask                 */
#define FMC_PFB23CR_B23ICE_SHIFT                 (3U)                                                /*!< FMC_PFB23CR.B23ICE Position             */
#define FMC_PFB23CR_B23ICE(x)                    (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< FMC_PFB23CR.B23ICE Field                */
#define FMC_PFB23CR_B23DCE_MASK                  (0x10U)                                             /*!< FMC_PFB23CR.B23DCE Mask                 */
#define FMC_PFB23CR_B23DCE_SHIFT                 (4U)                                                /*!< FMC_PFB23CR.B23DCE Position             */
#define FMC_PFB23CR_B23DCE(x)                    (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< FMC_PFB23CR.B23DCE Field                */
#define FMC_PFB23CR_B23MW_MASK                   (0x60000U)                                          /*!< FMC_PFB23CR.B23MW Mask                  */
#define FMC_PFB23CR_B23MW_SHIFT                  (17U)                                               /*!< FMC_PFB23CR.B23MW Position              */
#define FMC_PFB23CR_B23MW(x)                     (((uint32_t)(((uint32_t)(x))<<17U))&0x60000UL)      /*!< FMC_PFB23CR.B23MW Field                 */
#define FMC_PFB23CR_B23RWSC_MASK                 (0xF0000000U)                                       /*!< FMC_PFB23CR.B23RWSC Mask                */
#define FMC_PFB23CR_B23RWSC_SHIFT                (28U)                                               /*!< FMC_PFB23CR.B23RWSC Position            */
#define FMC_PFB23CR_B23RWSC(x)                   (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< FMC_PFB23CR.B23RWSC Field               */
/* ------- S0 Bit Fields                            ------ */
#define FMC_TAGVD0_valid_MASK                    (0x1U)                                              /*!< FMC_TAGVD0.valid Mask                   */
#define FMC_TAGVD0_valid_SHIFT                   (0U)                                                /*!< FMC_TAGVD0.valid Position               */
#define FMC_TAGVD0_valid(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FMC_TAGVD0.valid Field                  */
#define FMC_TAGVD0_tag_MASK                      (0xFFFC0U)                                          /*!< FMC_TAGVD0.tag Mask                     */
#define FMC_TAGVD0_tag_SHIFT                     (6U)                                                /*!< FMC_TAGVD0.tag Position                 */
#define FMC_TAGVD0_tag(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0xFFFC0UL)       /*!< FMC_TAGVD0.tag Field                    */
/* ------- S1 Bit Fields                            ------ */
#define FMC_TAGVD1_valid_MASK                    (0x1U)                                              /*!< FMC_TAGVD1.valid Mask                   */
#define FMC_TAGVD1_valid_SHIFT                   (0U)                                                /*!< FMC_TAGVD1.valid Position               */
#define FMC_TAGVD1_valid(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FMC_TAGVD1.valid Field                  */
#define FMC_TAGVD1_tag_MASK                      (0xFFFC0U)                                          /*!< FMC_TAGVD1.tag Mask                     */
#define FMC_TAGVD1_tag_SHIFT                     (6U)                                                /*!< FMC_TAGVD1.tag Position                 */
#define FMC_TAGVD1_tag(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0xFFFC0UL)       /*!< FMC_TAGVD1.tag Field                    */
/* ------- S2 Bit Fields                            ------ */
#define FMC_TAGVD2_valid_MASK                    (0x1U)                                              /*!< FMC_TAGVD2.valid Mask                   */
#define FMC_TAGVD2_valid_SHIFT                   (0U)                                                /*!< FMC_TAGVD2.valid Position               */
#define FMC_TAGVD2_valid(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FMC_TAGVD2.valid Field                  */
#define FMC_TAGVD2_tag_MASK                      (0xFFFC0U)                                          /*!< FMC_TAGVD2.tag Mask                     */
#define FMC_TAGVD2_tag_SHIFT                     (6U)                                                /*!< FMC_TAGVD2.tag Position                 */
#define FMC_TAGVD2_tag(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0xFFFC0UL)       /*!< FMC_TAGVD2.tag Field                    */
/* ------- S3 Bit Fields                            ------ */
#define FMC_TAGVD3_valid_MASK                    (0x1U)                                              /*!< FMC_TAGVD3.valid Mask                   */
#define FMC_TAGVD3_valid_SHIFT                   (0U)                                                /*!< FMC_TAGVD3.valid Position               */
#define FMC_TAGVD3_valid(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FMC_TAGVD3.valid Field                  */
#define FMC_TAGVD3_tag_MASK                      (0xFFFC0U)                                          /*!< FMC_TAGVD3.tag Mask                     */
#define FMC_TAGVD3_tag_SHIFT                     (6U)                                                /*!< FMC_TAGVD3.tag Position                 */
#define FMC_TAGVD3_tag(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0xFFFC0UL)       /*!< FMC_TAGVD3.tag Field                    */
/* ------- S0UM Bit Fields                          ------ */
#define FMC_DATAW0UM_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW0UM.data Mask                  */
#define FMC_DATAW0UM_data_SHIFT                  (0U)                                                /*!< FMC_DATAW0UM.data Position              */
#define FMC_DATAW0UM_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW0UM.data Field                 */
/* ------- S0MU Bit Fields                          ------ */
#define FMC_DATAW0MU_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW0MU.data Mask                  */
#define FMC_DATAW0MU_data_SHIFT                  (0U)                                                /*!< FMC_DATAW0MU.data Position              */
#define FMC_DATAW0MU_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW0MU.data Field                 */
/* ------- S0ML Bit Fields                          ------ */
#define FMC_DATAW0ML_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW0ML.data Mask                  */
#define FMC_DATAW0ML_data_SHIFT                  (0U)                                                /*!< FMC_DATAW0ML.data Position              */
#define FMC_DATAW0ML_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW0ML.data Field                 */
/* ------- S0LM Bit Fields                          ------ */
#define FMC_DATAW0LM_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW0LM.data Mask                  */
#define FMC_DATAW0LM_data_SHIFT                  (0U)                                                /*!< FMC_DATAW0LM.data Position              */
#define FMC_DATAW0LM_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW0LM.data Field                 */
/* ------- S1UM Bit Fields                          ------ */
#define FMC_DATAW1UM_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW1UM.data Mask                  */
#define FMC_DATAW1UM_data_SHIFT                  (0U)                                                /*!< FMC_DATAW1UM.data Position              */
#define FMC_DATAW1UM_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW1UM.data Field                 */
/* ------- S1MU Bit Fields                          ------ */
#define FMC_DATAW1MU_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW1MU.data Mask                  */
#define FMC_DATAW1MU_data_SHIFT                  (0U)                                                /*!< FMC_DATAW1MU.data Position              */
#define FMC_DATAW1MU_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW1MU.data Field                 */
/* ------- S1ML Bit Fields                          ------ */
#define FMC_DATAW1ML_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW1ML.data Mask                  */
#define FMC_DATAW1ML_data_SHIFT                  (0U)                                                /*!< FMC_DATAW1ML.data Position              */
#define FMC_DATAW1ML_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW1ML.data Field                 */
/* ------- S1LM Bit Fields                          ------ */
#define FMC_DATAW1LM_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW1LM.data Mask                  */
#define FMC_DATAW1LM_data_SHIFT                  (0U)                                                /*!< FMC_DATAW1LM.data Position              */
#define FMC_DATAW1LM_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW1LM.data Field                 */
/* ------- S2UM Bit Fields                          ------ */
#define FMC_DATAW2UM_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW2UM.data Mask                  */
#define FMC_DATAW2UM_data_SHIFT                  (0U)                                                /*!< FMC_DATAW2UM.data Position              */
#define FMC_DATAW2UM_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW2UM.data Field                 */
/* ------- S2MU Bit Fields                          ------ */
