podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define FMC_DATAW2MU_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW2MU.data Mask                  */
#define FMC_DATAW2MU_data_SHIFT                  (0U)                                                /*!< FMC_DATAW2MU.data Position              */
#define FMC_DATAW2MU_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW2MU.data Field                 */
/* ------- S2ML Bit Fields                          ------ */
#define FMC_DATAW2ML_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW2ML.data Mask                  */
#define FMC_DATAW2ML_data_SHIFT                  (0U)                                                /*!< FMC_DATAW2ML.data Position              */
#define FMC_DATAW2ML_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW2ML.data Field                 */
/* ------- S2LM Bit Fields                          ------ */
#define FMC_DATAW2LM_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW2LM.data Mask                  */
#define FMC_DATAW2LM_data_SHIFT                  (0U)                                                /*!< FMC_DATAW2LM.data Position              */
#define FMC_DATAW2LM_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW2LM.data Field                 */
/* ------- S3UM Bit Fields                          ------ */
#define FMC_DATAW3UM_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW3UM.data Mask                  */
#define FMC_DATAW3UM_data_SHIFT                  (0U)                                                /*!< FMC_DATAW3UM.data Position              */
#define FMC_DATAW3UM_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW3UM.data Field                 */
/* ------- S3MU Bit Fields                          ------ */
#define FMC_DATAW3MU_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW3MU.data Mask                  */
#define FMC_DATAW3MU_data_SHIFT                  (0U)                                                /*!< FMC_DATAW3MU.data Position              */
#define FMC_DATAW3MU_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW3MU.data Field                 */
/* ------- S3ML Bit Fields                          ------ */
#define FMC_DATAW3ML_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW3ML.data Mask                  */
#define FMC_DATAW3ML_data_SHIFT                  (0U)                                                /*!< FMC_DATAW3ML.data Position              */
#define FMC_DATAW3ML_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW3ML.data Field                 */
/* ------- S3LM Bit Fields                          ------ */
#define FMC_DATAW3LM_data_MASK                   (0xFFFFFFFFU)                                       /*!< FMC_DATAW3LM.data Mask                  */
#define FMC_DATAW3LM_data_SHIFT                  (0U)                                                /*!< FMC_DATAW3LM.data Position              */
#define FMC_DATAW3LM_data(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW3LM.data Field                 */
/**
 * @} */ /* End group FMC_Register_Masks_GROUP 
 */

/* FMC - Peripheral instance base addresses */
#define FMC_BasePtr                    0x4001F000UL //!< Peripheral base address
#define FMC                            ((FMC_Type *) FMC_BasePtr) //!< Freescale base pointer
#define FMC_BASE_PTR                   (FMC) //!< Freescale style base pointer
/**
 * @} */ /* End group FMC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FTFE_Peripheral_access_layer_GROUP FTFE Peripheral Access Layer
* @brief C Struct for FTFE
* @{
*/

/* ================================================================================ */
/* ================           FTFE (file:FTFE_FEPROT_FDPROT)       ================ */
/* ================================================================================ */

/**
 * @brief Flash Memory Interface
 */
/**
* @addtogroup FTFE_structs_GROUP FTFE struct
* @brief Struct for FTFE
* @{
*/
typedef struct FTFE_Type {
   __IO uint8_t   FSTAT;                        /**< 0000: Flash Status Register                                        */
   __IO uint8_t   FCNFG;                        /**< 0001: Flash Configuration Register                                 */
   __I  uint8_t   FSEC;                         /**< 0002: Flash Security Register                                      */
   __I  uint8_t   FOPT;                         /**< 0003: Flash Option Register                                        */
   __IO uint8_t   FCCOB3;                       /**< 0004: FCCOB 3 - Usually Flash address [7..0]                       */
   __IO uint8_t   FCCOB2;                       /**< 0005: FCCOB 2 - Usually Flash address [15..8]                      */
   __IO uint8_t   FCCOB1;                       /**< 0006: FCCOB 1 - Usually Flash address [23..16]                     */
   __IO uint8_t   FCCOB0;                       /**< 0007: FCCOB 0 - Usually FCMD (Flash command)                       */
   __IO uint8_t   FCCOB7;                       /**< 0008: FCCOB 7 - Usually Data Byte 3                                */
   __IO uint8_t   FCCOB6;                       /**< 0009: FCCOB 6 - Usually Data Byte 2                                */
   __IO uint8_t   FCCOB5;                       /**< 000A: FCCOB 5 - Usually Data Byte 1                                */
   __IO uint8_t   FCCOB4;                       /**< 000B: FCCOB 4 - Usually Data Byte 0                                */
   __IO uint8_t   FCCOBB;                       /**< 000C: FCCOB B - Usually Data Byte 7                                */
   __IO uint8_t   FCCOBA;                       /**< 000D: FCCOB A - Usually Data Byte 6                                */
   __IO uint8_t   FCCOB9;                       /**< 000E: FCCOB 9 - Usually Data Byte 5                                */
   __IO uint8_t   FCCOB8;                       /**< 000F: FCCOB 8 - Usually Data Byte 4                                */
   __IO uint8_t   FPROT3;                       /**< 0010: Program Flash Protection                                     */
   __IO uint8_t   FPROT2;                       /**< 0011: Program Flash Protection                                     */
   __IO uint8_t   FPROT1;                       /**< 0012: Program Flash Protection                                     */
   __IO uint8_t   FPROT0;                       /**< 0013: Program Flash Protection                                     */
        uint8_t   RESERVED_0[2];                /**< 0014: 0x2 bytes                                                    */
   __IO uint8_t   FEPROT;                       /**< 0016: EEPROM Protection Register                                   */
   __IO uint8_t   FDPROT;                       /**< 0017: Data Flash Protection Register                               */
} FTFE_Type;

/**
 * @} */ /* End group FTFE_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FTFE' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup FTFE_Register_Masks_GROUP FTFE Register Masks
* @brief Register Masks for FTFE
* @{
*/
/* ------- FSTAT Bit Fields                         ------ */
#define FTFE_FSTAT_MGSTAT0_MASK                  (0x1U)                                              /*!< FTFE_FSTAT.MGSTAT0 Mask                 */
#define FTFE_FSTAT_MGSTAT0_SHIFT                 (0U)                                                /*!< FTFE_FSTAT.MGSTAT0 Position             */
#define FTFE_FSTAT_MGSTAT0(x)                    (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< FTFE_FSTAT.MGSTAT0 Field                */
#define FTFE_FSTAT_FPVIOL_MASK                   (0x10U)                                             /*!< FTFE_FSTAT.FPVIOL Mask                  */
#define FTFE_FSTAT_FPVIOL_SHIFT                  (4U)                                                /*!< FTFE_FSTAT.FPVIOL Position              */
#define FTFE_FSTAT_FPVIOL(x)                     (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< FTFE_FSTAT.FPVIOL Field                 */
#define FTFE_FSTAT_ACCERR_MASK                   (0x20U)                                             /*!< FTFE_FSTAT.ACCERR Mask                  */
#define FTFE_FSTAT_ACCERR_SHIFT                  (5U)                                                /*!< FTFE_FSTAT.ACCERR Position              */
#define FTFE_FSTAT_ACCERR(x)                     (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< FTFE_FSTAT.ACCERR Field                 */
#define FTFE_FSTAT_RDCOLERR_MASK                 (0x40U)                                             /*!< FTFE_FSTAT.RDCOLERR Mask                */
#define FTFE_FSTAT_RDCOLERR_SHIFT                (6U)                                                /*!< FTFE_FSTAT.RDCOLERR Position            */
#define FTFE_FSTAT_RDCOLERR(x)                   (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< FTFE_FSTAT.RDCOLERR Field               */
#define FTFE_FSTAT_CCIF_MASK                     (0x80U)                                             /*!< FTFE_FSTAT.CCIF Mask                    */
#define FTFE_FSTAT_CCIF_SHIFT                    (7U)                                                /*!< FTFE_FSTAT.CCIF Position                */
#define FTFE_FSTAT_CCIF(x)                       (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< FTFE_FSTAT.CCIF Field                   */
/* ------- FCNFG Bit Fields                         ------ */
#define FTFE_FCNFG_EEERDY_MASK                   (0x1U)                                              /*!< FTFE_FCNFG.EEERDY Mask                  */
#define FTFE_FCNFG_EEERDY_SHIFT                  (0U)                                                /*!< FTFE_FCNFG.EEERDY Position              */
#define FTFE_FCNFG_EEERDY(x)                     (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< FTFE_FCNFG.EEERDY Field                 */
#define FTFE_FCNFG_RAMRDY_MASK                   (0x2U)                                              /*!< FTFE_FCNFG.RAMRDY Mask                  */
#define FTFE_FCNFG_RAMRDY_SHIFT                  (1U)                                                /*!< FTFE_FCNFG.RAMRDY Position              */
#define FTFE_FCNFG_RAMRDY(x)                     (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< FTFE_FCNFG.RAMRDY Field                 */
#define FTFE_FCNFG_PFLSH_MASK                    (0x4U)                                              /*!< FTFE_FCNFG.PFLSH Mask                   */
#define FTFE_FCNFG_PFLSH_SHIFT                   (2U)                                                /*!< FTFE_FCNFG.PFLSH Position               */
#define FTFE_FCNFG_PFLSH(x)                      (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< FTFE_FCNFG.PFLSH Field                  */
#define FTFE_FCNFG_SWAP_MASK                     (0x8U)                                              /*!< FTFE_FCNFG.SWAP Mask                    */
#define FTFE_FCNFG_SWAP_SHIFT                    (3U)                                                /*!< FTFE_FCNFG.SWAP Position                */
#define FTFE_FCNFG_SWAP(x)                       (((uint8_t)(((uint8_t)(x))<<3U))&0x8UL)             /*!< FTFE_FCNFG.SWAP Field                   */
#define FTFE_FCNFG_ERSSUSP_MASK                  (0x10U)                                             /*!< FTFE_FCNFG.ERSSUSP Mask                 */
#define FTFE_FCNFG_ERSSUSP_SHIFT                 (4U)                                                /*!< FTFE_FCNFG.ERSSUSP Position             */
#define FTFE_FCNFG_ERSSUSP(x)                    (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< FTFE_FCNFG.ERSSUSP Field                */
#define FTFE_FCNFG_ERSAREQ_MASK                  (0x20U)                                             /*!< FTFE_FCNFG.ERSAREQ Mask                 */
#define FTFE_FCNFG_ERSAREQ_SHIFT                 (5U)                                                /*!< FTFE_FCNFG.ERSAREQ Position             */
#define FTFE_FCNFG_ERSAREQ(x)                    (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< FTFE_FCNFG.ERSAREQ Field                */
#define FTFE_FCNFG_RDCOLLIE_MASK                 (0x40U)                                             /*!< FTFE_FCNFG.RDCOLLIE Mask                */
#define FTFE_FCNFG_RDCOLLIE_SHIFT                (6U)                                                /*!< FTFE_FCNFG.RDCOLLIE Position            */
#define FTFE_FCNFG_RDCOLLIE(x)                   (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< FTFE_FCNFG.RDCOLLIE Field               */
#define FTFE_FCNFG_CCIE_MASK                     (0x80U)                                             /*!< FTFE_FCNFG.CCIE Mask                    */
#define FTFE_FCNFG_CCIE_SHIFT                    (7U)                                                /*!< FTFE_FCNFG.CCIE Position                */
#define FTFE_FCNFG_CCIE(x)                       (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< FTFE_FCNFG.CCIE Field                   */
/* ------- FSEC Bit Fields                          ------ */
#define FTFE_FSEC_SEC_MASK                       (0x3U)                                              /*!< FTFE_FSEC.SEC Mask                      */
#define FTFE_FSEC_SEC_SHIFT                      (0U)                                                /*!< FTFE_FSEC.SEC Position                  */
#define FTFE_FSEC_SEC(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x3UL)             /*!< FTFE_FSEC.SEC Field                     */
#define FTFE_FSEC_FSLACC_MASK                    (0xCU)                                              /*!< FTFE_FSEC.FSLACC Mask                   */
#define FTFE_FSEC_FSLACC_SHIFT                   (2U)                                                /*!< FTFE_FSEC.FSLACC Position               */
#define FTFE_FSEC_FSLACC(x)                      (((uint8_t)(((uint8_t)(x))<<2U))&0xCUL)             /*!< FTFE_FSEC.FSLACC Field                  */
#define FTFE_FSEC_MEEN_MASK                      (0x30U)                                             /*!< FTFE_FSEC.MEEN Mask                     */
#define FTFE_FSEC_MEEN_SHIFT                     (4U)                                                /*!< FTFE_FSEC.MEEN Position                 */
#define FTFE_FSEC_MEEN(x)                        (((uint8_t)(((uint8_t)(x))<<4U))&0x30UL)            /*!< FTFE_FSEC.MEEN Field                    */
#define FTFE_FSEC_KEYEN_MASK                     (0xC0U)                                             /*!< FTFE_FSEC.KEYEN Mask                    */
#define FTFE_FSEC_KEYEN_SHIFT                    (6U)                                                /*!< FTFE_FSEC.KEYEN Position                */
#define FTFE_FSEC_KEYEN(x)                       (((uint8_t)(((uint8_t)(x))<<6U))&0xC0UL)            /*!< FTFE_FSEC.KEYEN Field                   */
/* ------- FOPT Bit Fields                          ------ */
#define FTFE_FOPT_OPT_MASK                       (0xFFU)                                             /*!< FTFE_FOPT.OPT Mask                      */
#define FTFE_FOPT_OPT_SHIFT                      (0U)                                                /*!< FTFE_FOPT.OPT Position                  */
#define FTFE_FOPT_OPT(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< FTFE_FOPT.OPT Field                     */
/* ------- FCCOB Bit Fields                         ------ */
#define FTFE_FCCOB_CCOBn_MASK                    (0xFFU)                                             /*!< FTFE_FCCOB.CCOBn Mask                   */
#define FTFE_FCCOB_CCOBn_SHIFT                   (0U)                                                /*!< FTFE_FCCOB.CCOBn Position               */
#define FTFE_FCCOB_CCOBn(x)                      (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< FTFE_FCCOB.CCOBn Field                  */
/* ------- FPROT Bit Fields                         ------ */
#define FTFE_FPROT_PROT_MASK                     (0xFFU)                                             /*!< FTFE_FPROT.PROT Mask                    */
#define FTFE_FPROT_PROT_SHIFT                    (0U)                                                /*!< FTFE_FPROT.PROT Position                */
#define FTFE_FPROT_PROT(x)                       (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< FTFE_FPROT.PROT Field                   */
/* ------- FEPROT Bit Fields                        ------ */
#define FTFE_FEPROT_EPROT_MASK                   (0xFFU)                                             /*!< FTFE_FEPROT.EPROT Mask                  */
#define FTFE_FEPROT_EPROT_SHIFT                  (0U)                                                /*!< FTFE_FEPROT.EPROT Position              */
#define FTFE_FEPROT_EPROT(x)                     (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< FTFE_FEPROT.EPROT Field                 */
/* ------- FDPROT Bit Fields                        ------ */
#define FTFE_FDPROT_DPROT_MASK                   (0xFFU)                                             /*!< FTFE_FDPROT.DPROT Mask                  */
#define FTFE_FDPROT_DPROT_SHIFT                  (0U)                                                /*!< FTFE_FDPROT.DPROT Position              */
#define FTFE_FDPROT_DPROT(x)                     (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< FTFE_FDPROT.DPROT Field                 */
/**
 * @} */ /* End group FTFE_Register_Masks_GROUP 
 */

/* FTFE - Peripheral instance base addresses */
#define FTFE_BasePtr                   0x40020000UL //!< Peripheral base address
#define FTFE                           ((FTFE_Type *) FTFE_BasePtr) //!< Freescale base pointer
#define FTFE_BASE_PTR                  (FTFE) //!< Freescale style base pointer
#define FTFE_IRQS { FTF_Command_IRQn, FTF_ReadCollision_IRQn,  }

/**
 * @} */ /* End group FTFE_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FTM_Peripheral_access_layer_GROUP FTM Peripheral Access Layer
* @brief C Struct for FTM
* @{
*/

/* ================================================================================ */
/* ================           FTM0 (file:FTM0_8CH)                 ================ */
/* ================================================================================ */

/**
 * @brief FlexTimer Module (8 channels)
 */
#define FTM_CONTROLS_COUNT   8          /**< Number of FTM channels                             */
/**
* @addtogroup FTM_structs_GROUP FTM struct
* @brief Struct for FTM
* @{
*/
typedef struct FTM_Type {
   __IO uint32_t  SC;                           /**< 0000: Status and Control                                           */
   __IO uint32_t  CNT;                          /**< 0004: Counter                                                      */
   __IO uint32_t  MOD;                          /**< 0008: Modulo                                                       */
   struct {
      __IO uint32_t  CnSC;                      /**< 000C: Channel  Status and Control                                  */
      __IO uint32_t  CnV;                       /**< 0010: Channel  Value                                               */
   } CONTROLS[FTM_CONTROLS_COUNT];              /**< 000C: (cluster: size=0x0040, 64)                                   */
   __IO uint32_t  CNTIN;                        /**< 004C: Counter Initial Value                                        */
   __IO uint32_t  STATUS;                       /**< 0050: Capture and Compare Status                                   */
   __IO uint32_t  MODE;                         /**< 0054: Features Mode Selection                                      */
   __IO uint32_t  SYNC;                         /**< 0058: Synchronization                                              */
   __IO uint32_t  OUTINIT;                      /**< 005C: Initial State for Channels Output                            */
   __IO uint32_t  OUTMASK;                      /**< 0060: Output Mask                                                  */
   __IO uint32_t  COMBINE;                      /**< 0064: Function for Linked Channels                                 */
   __IO uint32_t  DEADTIME;                     /**< 0068: Deadtime Insertion Control                                   */
   __IO uint32_t  EXTTRIG;                      /**< 006C: FTM External Trigger                                         */
   __IO uint32_t  POL;                          /**< 0070: Channels Polarity                                            */
   __IO uint32_t  FMS;                          /**< 0074: Fault Mode Status                                            */
   __IO uint32_t  FILTER;                       /**< 0078: Input Capture Filter Control                                 */
   __IO uint32_t  FLTCTRL;                      /**< 007C: Fault Control                                                */
   __IO uint32_t  QDCTRL;                       /**< 0080: Quadrature Decoder Control and Status                        */
   __IO uint32_t  CONF;                         /**< 0084: Configuration                                                */
   __IO uint32_t  FLTPOL;                       /**< 0088: FTM Fault Input Polarity                                     */
   __IO uint32_t  SYNCONF;                      /**< 008C: Synchronization Configuration                                */
   __IO uint32_t  INVCTRL;                      /**< 0090: FTM Inverting Control                                        */
   __IO uint32_t  SWOCTRL;                      /**< 0094: FTM Software Output Control                                  */
   __IO uint32_t  PWMLOAD;                      /**< 0098: FTM PWM Load                                                 */
} FTM_Type;

/**
 * @} */ /* End group FTM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FTM0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

