podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/* I2S0 - Peripheral instance base addresses */
#define I2S0_BasePtr                   0x4002F000UL //!< Peripheral base address
#define I2S0                           ((I2S_Type *) I2S0_BasePtr) //!< Freescale base pointer
#define I2S0_BASE_PTR                  (I2S0) //!< Freescale style base pointer
#define I2S0_IRQS { I2S0_Tx_IRQn, I2S0_Rx_IRQn,  }

/**
 * @} */ /* End group I2S_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup I2S_Peripheral_access_layer_GROUP I2S Peripheral Access Layer
* @brief C Struct for I2S
* @{
*/

/* ================================================================================ */
/* ================           I2S1 (derived from I2S0)             ================ */
/* ================================================================================ */

/**
 * @brief Inter-IC Sound / Synchronous Audio Interface
 */

/* I2S1 - Peripheral instance base addresses */
#define I2S1_BasePtr                   0x400AF000UL //!< Peripheral base address
#define I2S1                           ((I2S_Type *) I2S1_BasePtr) //!< Freescale base pointer
#define I2S1_BASE_PTR                  (I2S1) //!< Freescale style base pointer
#define I2S1_IRQS { I2S1_Tx_IRQn, I2S1_Rx_IRQn,  }

/**
 * @} */ /* End group I2S_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup LCDC_Peripheral_access_layer_GROUP LCDC Peripheral Access Layer
* @brief C Struct for LCDC
* @{
*/

/* ================================================================================ */
/* ================           LCDC (file:LCDC_0)                   ================ */
/* ================================================================================ */

/**
 * @brief Liquid Crystal Display Controller
 */
/**
* @addtogroup LCDC_structs_GROUP LCDC struct
* @brief Struct for LCDC
* @{
*/
typedef struct LCDC_Type {
   __IO uint32_t  LSSAR;                        /**< 0000: LCDC screen start address register                           */
   __IO uint32_t  LSR;                          /**< 0004: LCDC size register                                           */
   __IO uint32_t  LVPWR;                        /**< 0008: LCDC virtual page width register                             */
   __IO uint32_t  LCPR;                         /**< 000C: LCDC cursor position register                                */
   __IO uint32_t  LCWHB;                        /**< 0010: LCDC cursor width, height, and blink register                */
   __IO uint32_t  LCCMR;                        /**< 0014: LCDC color cursor mapping register                           */
   __IO uint32_t  LPCR;                         /**< 0018: LCDC panel configuration register                            */
   __IO uint32_t  LHCR;                         /**< 001C: LCDC horizontal configuration register                       */
   __IO uint32_t  LVCR;                         /**< 0020: LCDC vertical configuration register                         */
   __IO uint32_t  LPOR;                         /**< 0024: LCDC panning offset register                                 */
        uint8_t   RESERVED_0[4];                /**< 0028: 0x4 bytes                                                    */
   __IO uint32_t  LPCCR;                        /**< 002C: LCDC PWM contrast control register                           */
   __IO uint32_t  LDCR;                         /**< 0030: LCDC DMA control register                                    */
   __IO uint32_t  LRMCR;                        /**< 0034: LCDC refresh mode control register                           */
   __IO uint32_t  LICR;                         /**< 0038: LCDC interrupt configuration register                        */
   __IO uint32_t  LIER;                         /**< 003C: LCDC interrupt enable register                               */
   __I  uint32_t  LISR;                         /**< 0040: LCDC interrupt status register                               */
        uint8_t   RESERVED_1[12];               /**< 0044: 0xC bytes                                                    */
   __IO uint32_t  LGWSAR;                       /**< 0050: LCDC graphic window start address register                   */
   __IO uint32_t  LGWSR;                        /**< 0054: LCDC graphic window size register                            */
   __IO uint32_t  LGWVPWR;                      /**< 0058: LCDC graphic window virtual page width register              */
   __IO uint32_t  LGWPOR;                       /**< 005C: LCDC graphic window panning offset register                  */
   __IO uint32_t  LGWPR;                        /**< 0060: LCDC graphic window position register                        */
   __IO uint32_t  LGWCR;                        /**< 0064: LCDC graphic window control register                         */
   __IO uint32_t  LGWDCR;                       /**< 0068: LCDC graphic window DMA control register                     */
        uint8_t   RESERVED_2[20];               /**< 006C: 0x14 bytes                                                   */
   __IO uint32_t  LAUSCR;                       /**< 0080: LCDC AUS mode control register                               */
   __IO uint32_t  LAUSCCR;                      /**< 0084: LCDC AUS mode cursor control register                        */
} LCDC_Type;

/**
 * @} */ /* End group LCDC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'LCDC' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup LCDC_Register_Masks_GROUP LCDC Register Masks
* @brief Register Masks for LCDC
* @{
*/
/* ------- LSSAR Bit Fields                         ------ */
#define LCDC_LSSAR_SSA_MASK                      (0xFFFFFFFCU)                                       /*!< LCDC_LSSAR.SSA Mask                     */
#define LCDC_LSSAR_SSA_SHIFT                     (2U)                                                /*!< LCDC_LSSAR.SSA Position                 */
#define LCDC_LSSAR_SSA(x)                        (((uint32_t)(((uint32_t)(x))<<2U))&0xFFFFFFFCUL)    /*!< LCDC_LSSAR.SSA Field                    */
/* ------- LSR Bit Fields                           ------ */
#define LCDC_LSR_YMAX_MASK                       (0x3FFU)                                            /*!< LCDC_LSR.YMAX Mask                      */
#define LCDC_LSR_YMAX_SHIFT                      (0U)                                                /*!< LCDC_LSR.YMAX Position                  */
#define LCDC_LSR_YMAX(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFUL)         /*!< LCDC_LSR.YMAX Field                     */
#define LCDC_LSR_XMAX_MASK                       (0x7F00000U)                                        /*!< LCDC_LSR.XMAX Mask                      */
#define LCDC_LSR_XMAX_SHIFT                      (20U)                                               /*!< LCDC_LSR.XMAX Position                  */
#define LCDC_LSR_XMAX(x)                         (((uint32_t)(((uint32_t)(x))<<20U))&0x7F00000UL)    /*!< LCDC_LSR.XMAX Field                     */
/* ------- LVPWR Bit Fields                         ------ */
#define LCDC_LVPWR_VPW_MASK                      (0x7FFU)                                            /*!< LCDC_LVPWR.VPW Mask                     */
#define LCDC_LVPWR_VPW_SHIFT                     (0U)                                                /*!< LCDC_LVPWR.VPW Position                 */
#define LCDC_LVPWR_VPW(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x7FFUL)         /*!< LCDC_LVPWR.VPW Field                    */
/* ------- LCPR Bit Fields                          ------ */
#define LCDC_LCPR_CYP_MASK                       (0x3FFU)                                            /*!< LCDC_LCPR.CYP Mask                      */
#define LCDC_LCPR_CYP_SHIFT                      (0U)                                                /*!< LCDC_LCPR.CYP Position                  */
#define LCDC_LCPR_CYP(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFUL)         /*!< LCDC_LCPR.CYP Field                     */
#define LCDC_LCPR_CXP_MASK                       (0x3FF0000U)                                        /*!< LCDC_LCPR.CXP Mask                      */
#define LCDC_LCPR_CXP_SHIFT                      (16U)                                               /*!< LCDC_LCPR.CXP Position                  */
#define LCDC_LCPR_CXP(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0x3FF0000UL)    /*!< LCDC_LCPR.CXP Field                     */
#define LCDC_LCPR_OP_MASK                        (0x10000000U)                                       /*!< LCDC_LCPR.OP Mask                       */
#define LCDC_LCPR_OP_SHIFT                       (28U)                                               /*!< LCDC_LCPR.OP Position                   */
#define LCDC_LCPR_OP(x)                          (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< LCDC_LCPR.OP Field                      */
#define LCDC_LCPR_CC_MASK                        (0xC0000000U)                                       /*!< LCDC_LCPR.CC Mask                       */
#define LCDC_LCPR_CC_SHIFT                       (30U)                                               /*!< LCDC_LCPR.CC Position                   */
#define LCDC_LCPR_CC(x)                          (((uint32_t)(((uint32_t)(x))<<30U))&0xC0000000UL)   /*!< LCDC_LCPR.CC Field                      */
/* ------- LCWHB Bit Fields                         ------ */
#define LCDC_LCWHB_BD_MASK                       (0xFFU)                                             /*!< LCDC_LCWHB.BD Mask                      */
#define LCDC_LCWHB_BD_SHIFT                      (0U)                                                /*!< LCDC_LCWHB.BD Position                  */
#define LCDC_LCWHB_BD(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< LCDC_LCWHB.BD Field                     */
#define LCDC_LCWHB_CH_MASK                       (0x1F0000U)                                         /*!< LCDC_LCWHB.CH Mask                      */
#define LCDC_LCWHB_CH_SHIFT                      (16U)                                               /*!< LCDC_LCWHB.CH Position                  */
#define LCDC_LCWHB_CH(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0x1F0000UL)     /*!< LCDC_LCWHB.CH Field                     */
#define LCDC_LCWHB_CW_MASK                       (0x1F000000U)                                       /*!< LCDC_LCWHB.CW Mask                      */
#define LCDC_LCWHB_CW_SHIFT                      (24U)                                               /*!< LCDC_LCWHB.CW Position                  */
#define LCDC_LCWHB_CW(x)                         (((uint32_t)(((uint32_t)(x))<<24U))&0x1F000000UL)   /*!< LCDC_LCWHB.CW Field                     */
#define LCDC_LCWHB_BK_EN_MASK                    (0x80000000U)                                       /*!< LCDC_LCWHB.BK_EN Mask                   */
#define LCDC_LCWHB_BK_EN_SHIFT                   (31U)                                               /*!< LCDC_LCWHB.BK_EN Position               */
#define LCDC_LCWHB_BK_EN(x)                      (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< LCDC_LCWHB.BK_EN Field                  */
/* ------- LCCMR Bit Fields                         ------ */
#define LCDC_LCCMR_CUR_COL_B_MASK                (0x3FU)                                             /*!< LCDC_LCCMR.CUR_COL_B Mask               */
#define LCDC_LCCMR_CUR_COL_B_SHIFT               (0U)                                                /*!< LCDC_LCCMR.CUR_COL_B Position           */
#define LCDC_LCCMR_CUR_COL_B(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0x3FUL)          /*!< LCDC_LCCMR.CUR_COL_B Field              */
#define LCDC_LCCMR_CUR_COL_G_MASK                (0xFC0U)                                            /*!< LCDC_LCCMR.CUR_COL_G Mask               */
#define LCDC_LCCMR_CUR_COL_G_SHIFT               (6U)                                                /*!< LCDC_LCCMR.CUR_COL_G Position           */
#define LCDC_LCCMR_CUR_COL_G(x)                  (((uint32_t)(((uint32_t)(x))<<6U))&0xFC0UL)         /*!< LCDC_LCCMR.CUR_COL_G Field              */
#define LCDC_LCCMR_CUR_COL_R_MASK                (0x3F000U)                                          /*!< LCDC_LCCMR.CUR_COL_R Mask               */
#define LCDC_LCCMR_CUR_COL_R_SHIFT               (12U)                                               /*!< LCDC_LCCMR.CUR_COL_R Position           */
#define LCDC_LCCMR_CUR_COL_R(x)                  (((uint32_t)(((uint32_t)(x))<<12U))&0x3F000UL)      /*!< LCDC_LCCMR.CUR_COL_R Field              */
/* ------- LPCR Bit Fields                          ------ */
#define LCDC_LPCR_PCD_MASK                       (0x3FU)                                             /*!< LCDC_LPCR.PCD Mask                      */
#define LCDC_LPCR_PCD_SHIFT                      (0U)                                                /*!< LCDC_LPCR.PCD Position                  */
#define LCDC_LPCR_PCD(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x3FUL)          /*!< LCDC_LPCR.PCD Field                     */
#define LCDC_LPCR_SCLKSEL_MASK                   (0x80U)                                             /*!< LCDC_LPCR.SCLKSEL Mask                  */
#define LCDC_LPCR_SCLKSEL_SHIFT                  (7U)                                                /*!< LCDC_LPCR.SCLKSEL Position              */
#define LCDC_LPCR_SCLKSEL(x)                     (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< LCDC_LPCR.SCLKSEL Field                 */
#define LCDC_LPCR_ACD_MASK                       (0x7F00U)                                           /*!< LCDC_LPCR.ACD Mask                      */
#define LCDC_LPCR_ACD_SHIFT                      (8U)                                                /*!< LCDC_LPCR.ACD Position                  */
#define LCDC_LPCR_ACD(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0x7F00UL)        /*!< LCDC_LPCR.ACD Field                     */
#define LCDC_LPCR_ACDSEL_MASK                    (0x8000U)                                           /*!< LCDC_LPCR.ACDSEL Mask                   */
#define LCDC_LPCR_ACDSEL_SHIFT                   (15U)                                               /*!< LCDC_LPCR.ACDSEL Position               */
#define LCDC_LPCR_ACDSEL(x)                      (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< LCDC_LPCR.ACDSEL Field                  */
#define LCDC_LPCR_REV_VS_MASK                    (0x10000U)                                          /*!< LCDC_LPCR.REV_VS Mask                   */
#define LCDC_LPCR_REV_VS_SHIFT                   (16U)                                               /*!< LCDC_LPCR.REV_VS Position               */
#define LCDC_LPCR_REV_VS(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< LCDC_LPCR.REV_VS Field                  */
#define LCDC_LPCR_SWAP_SEL_MASK                  (0x20000U)                                          /*!< LCDC_LPCR.SWAP_SEL Mask                 */
#define LCDC_LPCR_SWAP_SEL_SHIFT                 (17U)                                               /*!< LCDC_LPCR.SWAP_SEL Position             */
#define LCDC_LPCR_SWAP_SEL(x)                    (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< LCDC_LPCR.SWAP_SEL Field                */
#define LCDC_LPCR_END_SEL_MASK                   (0x40000U)                                          /*!< LCDC_LPCR.END_SEL Mask                  */
#define LCDC_LPCR_END_SEL_SHIFT                  (18U)                                               /*!< LCDC_LPCR.END_SEL Position              */
#define LCDC_LPCR_END_SEL(x)                     (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< LCDC_LPCR.END_SEL Field                 */
#define LCDC_LPCR_SCLKIDLE_MASK                  (0x80000U)                                          /*!< LCDC_LPCR.SCLKIDLE Mask                 */
#define LCDC_LPCR_SCLKIDLE_SHIFT                 (19U)                                               /*!< LCDC_LPCR.SCLKIDLE Position             */
#define LCDC_LPCR_SCLKIDLE(x)                    (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< LCDC_LPCR.SCLKIDLE Field                */
#define LCDC_LPCR_OEPOL_MASK                     (0x100000U)                                         /*!< LCDC_LPCR.OEPOL Mask                    */
#define LCDC_LPCR_OEPOL_SHIFT                    (20U)                                               /*!< LCDC_LPCR.OEPOL Position                */
#define LCDC_LPCR_OEPOL(x)                       (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< LCDC_LPCR.OEPOL Field                   */
#define LCDC_LPCR_CLKPOL_MASK                    (0x200000U)                                         /*!< LCDC_LPCR.CLKPOL Mask                   */
#define LCDC_LPCR_CLKPOL_SHIFT                   (21U)                                               /*!< LCDC_LPCR.CLKPOL Position               */
#define LCDC_LPCR_CLKPOL(x)                      (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< LCDC_LPCR.CLKPOL Field                  */
#define LCDC_LPCR_LPPOL_MASK                     (0x400000U)                                         /*!< LCDC_LPCR.LPPOL Mask                    */
#define LCDC_LPCR_LPPOL_SHIFT                    (22U)                                               /*!< LCDC_LPCR.LPPOL Position                */
#define LCDC_LPCR_LPPOL(x)                       (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< LCDC_LPCR.LPPOL Field                   */
#define LCDC_LPCR_FLMPOL_MASK                    (0x800000U)                                         /*!< LCDC_LPCR.FLMPOL Mask                   */
#define LCDC_LPCR_FLMPOL_SHIFT                   (23U)                                               /*!< LCDC_LPCR.FLMPOL Position               */
#define LCDC_LPCR_FLMPOL(x)                      (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< LCDC_LPCR.FLMPOL Field                  */
#define LCDC_LPCR_PIXPOL_MASK                    (0x1000000U)                                        /*!< LCDC_LPCR.PIXPOL Mask                   */
#define LCDC_LPCR_PIXPOL_SHIFT                   (24U)                                               /*!< LCDC_LPCR.PIXPOL Position               */
#define LCDC_LPCR_PIXPOL(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< LCDC_LPCR.PIXPOL Field                  */
#define LCDC_LPCR_BPIX_MASK                      (0xE000000U)                                        /*!< LCDC_LPCR.BPIX Mask                     */
#define LCDC_LPCR_BPIX_SHIFT                     (25U)                                               /*!< LCDC_LPCR.BPIX Position                 */
#define LCDC_LPCR_BPIX(x)                        (((uint32_t)(((uint32_t)(x))<<25U))&0xE000000UL)    /*!< LCDC_LPCR.BPIX Field                    */
#define LCDC_LPCR_PBSIZ_MASK                     (0x30000000U)                                       /*!< LCDC_LPCR.PBSIZ Mask                    */
#define LCDC_LPCR_PBSIZ_SHIFT                    (28U)                                               /*!< LCDC_LPCR.PBSIZ Position                */
#define LCDC_LPCR_PBSIZ(x)                       (((uint32_t)(((uint32_t)(x))<<28U))&0x30000000UL)   /*!< LCDC_LPCR.PBSIZ Field                   */
#define LCDC_LPCR_COLOR_MASK                     (0x40000000U)                                       /*!< LCDC_LPCR.COLOR Mask                    */
#define LCDC_LPCR_COLOR_SHIFT                    (30U)                                               /*!< LCDC_LPCR.COLOR Position                */
#define LCDC_LPCR_COLOR(x)                       (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< LCDC_LPCR.COLOR Field                   */
#define LCDC_LPCR_TFT_MASK                       (0x80000000U)                                       /*!< LCDC_LPCR.TFT Mask                      */
#define LCDC_LPCR_TFT_SHIFT                      (31U)                                               /*!< LCDC_LPCR.TFT Position                  */
#define LCDC_LPCR_TFT(x)                         (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< LCDC_LPCR.TFT Field                     */
/* ------- LHCR Bit Fields                          ------ */
#define LCDC_LHCR_H_WAIT_2_MASK                  (0xFFU)                                             /*!< LCDC_LHCR.H_WAIT_2 Mask                 */
#define LCDC_LHCR_H_WAIT_2_SHIFT                 (0U)                                                /*!< LCDC_LHCR.H_WAIT_2 Position             */
#define LCDC_LHCR_H_WAIT_2(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< LCDC_LHCR.H_WAIT_2 Field                */
#define LCDC_LHCR_H_WAIT_1_MASK                  (0xFF00U)                                           /*!< LCDC_LHCR.H_WAIT_1 Mask                 */
#define LCDC_LHCR_H_WAIT_1_SHIFT                 (8U)                                                /*!< LCDC_LHCR.H_WAIT_1 Position             */
#define LCDC_LHCR_H_WAIT_1(x)                    (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< LCDC_LHCR.H_WAIT_1 Field                */
#define LCDC_LHCR_H_WIDTH_MASK                   (0xFC000000U)                                       /*!< LCDC_LHCR.H_WIDTH Mask                  */
#define LCDC_LHCR_H_WIDTH_SHIFT                  (26U)                                               /*!< LCDC_LHCR.H_WIDTH Position              */
#define LCDC_LHCR_H_WIDTH(x)                     (((uint32_t)(((uint32_t)(x))<<26U))&0xFC000000UL)   /*!< LCDC_LHCR.H_WIDTH Field                 */
/* ------- LVCR Bit Fields                          ------ */
#define LCDC_LVCR_V_WAIT_2_MASK                  (0xFFU)                                             /*!< LCDC_LVCR.V_WAIT_2 Mask                 */
#define LCDC_LVCR_V_WAIT_2_SHIFT                 (0U)                                                /*!< LCDC_LVCR.V_WAIT_2 Position             */
#define LCDC_LVCR_V_WAIT_2(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< LCDC_LVCR.V_WAIT_2 Field                */
#define LCDC_LVCR_V_WAIT_1_MASK                  (0xFF00U)                                           /*!< LCDC_LVCR.V_WAIT_1 Mask                 */
#define LCDC_LVCR_V_WAIT_1_SHIFT                 (8U)                                                /*!< LCDC_LVCR.V_WAIT_1 Position             */
#define LCDC_LVCR_V_WAIT_1(x)                    (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< LCDC_LVCR.V_WAIT_1 Field                */
#define LCDC_LVCR_V_WIDTH_MASK                   (0xFC000000U)                                       /*!< LCDC_LVCR.V_WIDTH Mask                  */
#define LCDC_LVCR_V_WIDTH_SHIFT                  (26U)                                               /*!< LCDC_LVCR.V_WIDTH Position              */
#define LCDC_LVCR_V_WIDTH(x)                     (((uint32_t)(((uint32_t)(x))<<26U))&0xFC000000UL)   /*!< LCDC_LVCR.V_WIDTH Field                 */
/* ------- LPOR Bit Fields                          ------ */
#define LCDC_LPOR_POS_MASK                       (0x1FU)                                             /*!< LCDC_LPOR.POS Mask                      */
#define LCDC_LPOR_POS_SHIFT                      (0U)                                                /*!< LCDC_LPOR.POS Position                  */
#define LCDC_LPOR_POS(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1FUL)          /*!< LCDC_LPOR.POS Field                     */
/* ------- LPCCR Bit Fields                         ------ */
#define LCDC_LPCCR_PW_MASK                       (0xFFU)                                             /*!< LCDC_LPCCR.PW Mask                      */
