podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define LCDC_LPCCR_PW_SHIFT                      (0U)                                                /*!< LCDC_LPCCR.PW Position                  */
#define LCDC_LPCCR_PW(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< LCDC_LPCCR.PW Field                     */
#define LCDC_LPCCR_CC_EN_MASK                    (0x100U)                                            /*!< LCDC_LPCCR.CC_EN Mask                   */
#define LCDC_LPCCR_CC_EN_SHIFT                   (8U)                                                /*!< LCDC_LPCCR.CC_EN Position               */
#define LCDC_LPCCR_CC_EN(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< LCDC_LPCCR.CC_EN Field                  */
#define LCDC_LPCCR_SCR_MASK                      (0x600U)                                            /*!< LCDC_LPCCR.SCR Mask                     */
#define LCDC_LPCCR_SCR_SHIFT                     (9U)                                                /*!< LCDC_LPCCR.SCR Position                 */
#define LCDC_LPCCR_SCR(x)                        (((uint32_t)(((uint32_t)(x))<<9U))&0x600UL)         /*!< LCDC_LPCCR.SCR Field                    */
#define LCDC_LPCCR_LDMSK_MASK                    (0x8000U)                                           /*!< LCDC_LPCCR.LDMSK Mask                   */
#define LCDC_LPCCR_LDMSK_SHIFT                   (15U)                                               /*!< LCDC_LPCCR.LDMSK Position               */
#define LCDC_LPCCR_LDMSK(x)                      (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< LCDC_LPCCR.LDMSK Field                  */
/* ------- LDCR Bit Fields                          ------ */
#define LCDC_LDCR_TM_MASK                        (0x7FU)                                             /*!< LCDC_LDCR.TM Mask                       */
#define LCDC_LDCR_TM_SHIFT                       (0U)                                                /*!< LCDC_LDCR.TM Position                   */
#define LCDC_LDCR_TM(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x7FUL)          /*!< LCDC_LDCR.TM Field                      */
#define LCDC_LDCR_HM_MASK                        (0x7F0000U)                                         /*!< LCDC_LDCR.HM Mask                       */
#define LCDC_LDCR_HM_SHIFT                       (16U)                                               /*!< LCDC_LDCR.HM Position                   */
#define LCDC_LDCR_HM(x)                          (((uint32_t)(((uint32_t)(x))<<16U))&0x7F0000UL)     /*!< LCDC_LDCR.HM Field                      */
#define LCDC_LDCR_BURST_MASK                     (0x80000000U)                                       /*!< LCDC_LDCR.BURST Mask                    */
#define LCDC_LDCR_BURST_SHIFT                    (31U)                                               /*!< LCDC_LDCR.BURST Position                */
#define LCDC_LDCR_BURST(x)                       (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< LCDC_LDCR.BURST Field                   */
/* ------- LRMCR Bit Fields                         ------ */
#define LCDC_LRMCR_SELF_REF_MASK                 (0x1U)                                              /*!< LCDC_LRMCR.SELF_REF Mask                */
#define LCDC_LRMCR_SELF_REF_SHIFT                (0U)                                                /*!< LCDC_LRMCR.SELF_REF Position            */
#define LCDC_LRMCR_SELF_REF(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< LCDC_LRMCR.SELF_REF Field               */
/* ------- LICR Bit Fields                          ------ */
#define LCDC_LICR_INTCON_MASK                    (0x1U)                                              /*!< LCDC_LICR.INTCON Mask                   */
#define LCDC_LICR_INTCON_SHIFT                   (0U)                                                /*!< LCDC_LICR.INTCON Position               */
#define LCDC_LICR_INTCON(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< LCDC_LICR.INTCON Field                  */
#define LCDC_LICR_INTSYN_MASK                    (0x4U)                                              /*!< LCDC_LICR.INTSYN Mask                   */
#define LCDC_LICR_INTSYN_SHIFT                   (2U)                                                /*!< LCDC_LICR.INTSYN Position               */
#define LCDC_LICR_INTSYN(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< LCDC_LICR.INTSYN Field                  */
#define LCDC_LICR_GW_INT_CON_MASK                (0x10U)                                             /*!< LCDC_LICR.GW_INT_CON Mask               */
#define LCDC_LICR_GW_INT_CON_SHIFT               (4U)                                                /*!< LCDC_LICR.GW_INT_CON Position           */
#define LCDC_LICR_GW_INT_CON(x)                  (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< LCDC_LICR.GW_INT_CON Field              */
/* ------- LIER Bit Fields                          ------ */
#define LCDC_LIER_BOF_EN_MASK                    (0x1U)                                              /*!< LCDC_LIER.BOF_EN Mask                   */
#define LCDC_LIER_BOF_EN_SHIFT                   (0U)                                                /*!< LCDC_LIER.BOF_EN Position               */
#define LCDC_LIER_BOF_EN(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< LCDC_LIER.BOF_EN Field                  */
#define LCDC_LIER_EOF_EN_MASK                    (0x2U)                                              /*!< LCDC_LIER.EOF_EN Mask                   */
#define LCDC_LIER_EOF_EN_SHIFT                   (1U)                                                /*!< LCDC_LIER.EOF_EN Position               */
#define LCDC_LIER_EOF_EN(x)                      (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< LCDC_LIER.EOF_EN Field                  */
#define LCDC_LIER_UDR_ERR_EN_MASK                (0x8U)                                              /*!< LCDC_LIER.UDR_ERR_EN Mask               */
#define LCDC_LIER_UDR_ERR_EN_SHIFT               (3U)                                                /*!< LCDC_LIER.UDR_ERR_EN Position           */
#define LCDC_LIER_UDR_ERR_EN(x)                  (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< LCDC_LIER.UDR_ERR_EN Field              */
#define LCDC_LIER_GW_BOF_EN_MASK                 (0x10U)                                             /*!< LCDC_LIER.GW_BOF_EN Mask                */
#define LCDC_LIER_GW_BOF_EN_SHIFT                (4U)                                                /*!< LCDC_LIER.GW_BOF_EN Position            */
#define LCDC_LIER_GW_BOF_EN(x)                   (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< LCDC_LIER.GW_BOF_EN Field               */
#define LCDC_LIER_GW_EOF_EN_MASK                 (0x20U)                                             /*!< LCDC_LIER.GW_EOF_EN Mask                */
#define LCDC_LIER_GW_EOF_EN_SHIFT                (5U)                                                /*!< LCDC_LIER.GW_EOF_EN Position            */
#define LCDC_LIER_GW_EOF_EN(x)                   (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< LCDC_LIER.GW_EOF_EN Field               */
#define LCDC_LIER_GW_UDR_ERR_EN_MASK             (0x80U)                                             /*!< LCDC_LIER.GW_UDR_ERR_EN Mask            */
#define LCDC_LIER_GW_UDR_ERR_EN_SHIFT            (7U)                                                /*!< LCDC_LIER.GW_UDR_ERR_EN Position        */
#define LCDC_LIER_GW_UDR_ERR_EN(x)               (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< LCDC_LIER.GW_UDR_ERR_EN Field           */
/* ------- LISR Bit Fields                          ------ */
#define LCDC_LISR_BOF_MASK                       (0x1U)                                              /*!< LCDC_LISR.BOF Mask                      */
#define LCDC_LISR_BOF_SHIFT                      (0U)                                                /*!< LCDC_LISR.BOF Position                  */
#define LCDC_LISR_BOF(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< LCDC_LISR.BOF Field                     */
#define LCDC_LISR_EOF_MASK                       (0x2U)                                              /*!< LCDC_LISR.EOF Mask                      */
#define LCDC_LISR_EOF_SHIFT                      (1U)                                                /*!< LCDC_LISR.EOF Position                  */
#define LCDC_LISR_EOF(x)                         (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< LCDC_LISR.EOF Field                     */
#define LCDC_LISR_UDR_ERR_MASK                   (0x8U)                                              /*!< LCDC_LISR.UDR_ERR Mask                  */
#define LCDC_LISR_UDR_ERR_SHIFT                  (3U)                                                /*!< LCDC_LISR.UDR_ERR Position              */
#define LCDC_LISR_UDR_ERR(x)                     (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< LCDC_LISR.UDR_ERR Field                 */
#define LCDC_LISR_GW_BOF_MASK                    (0x10U)                                             /*!< LCDC_LISR.GW_BOF Mask                   */
#define LCDC_LISR_GW_BOF_SHIFT                   (4U)                                                /*!< LCDC_LISR.GW_BOF Position               */
#define LCDC_LISR_GW_BOF(x)                      (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< LCDC_LISR.GW_BOF Field                  */
#define LCDC_LISR_GW_EOF_MASK                    (0x20U)                                             /*!< LCDC_LISR.GW_EOF Mask                   */
#define LCDC_LISR_GW_EOF_SHIFT                   (5U)                                                /*!< LCDC_LISR.GW_EOF Position               */
#define LCDC_LISR_GW_EOF(x)                      (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< LCDC_LISR.GW_EOF Field                  */
#define LCDC_LISR_GW_UDR_ERR_MASK                (0x80U)                                             /*!< LCDC_LISR.GW_UDR_ERR Mask               */
#define LCDC_LISR_GW_UDR_ERR_SHIFT               (7U)                                                /*!< LCDC_LISR.GW_UDR_ERR Position           */
#define LCDC_LISR_GW_UDR_ERR(x)                  (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< LCDC_LISR.GW_UDR_ERR Field              */
/* ------- LGWSAR Bit Fields                        ------ */
#define LCDC_LGWSAR_GWSA_MASK                    (0xFFFFFFFCU)                                       /*!< LCDC_LGWSAR.GWSA Mask                   */
#define LCDC_LGWSAR_GWSA_SHIFT                   (2U)                                                /*!< LCDC_LGWSAR.GWSA Position               */
#define LCDC_LGWSAR_GWSA(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0xFFFFFFFCUL)    /*!< LCDC_LGWSAR.GWSA Field                  */
/* ------- LGWSR Bit Fields                         ------ */
#define LCDC_LGWSR_GWH_MASK                      (0x3FFU)                                            /*!< LCDC_LGWSR.GWH Mask                     */
#define LCDC_LGWSR_GWH_SHIFT                     (0U)                                                /*!< LCDC_LGWSR.GWH Position                 */
#define LCDC_LGWSR_GWH(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFUL)         /*!< LCDC_LGWSR.GWH Field                    */
#define LCDC_LGWSR_GWW_MASK                      (0x7F00000U)                                        /*!< LCDC_LGWSR.GWW Mask                     */
#define LCDC_LGWSR_GWW_SHIFT                     (20U)                                               /*!< LCDC_LGWSR.GWW Position                 */
#define LCDC_LGWSR_GWW(x)                        (((uint32_t)(((uint32_t)(x))<<20U))&0x7F00000UL)    /*!< LCDC_LGWSR.GWW Field                    */
/* ------- LGWVPWR Bit Fields                       ------ */
#define LCDC_LGWVPWR_GWVPW_MASK                  (0x7FFU)                                            /*!< LCDC_LGWVPWR.GWVPW Mask                 */
#define LCDC_LGWVPWR_GWVPW_SHIFT                 (0U)                                                /*!< LCDC_LGWVPWR.GWVPW Position             */
#define LCDC_LGWVPWR_GWVPW(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x7FFUL)         /*!< LCDC_LGWVPWR.GWVPW Field                */
/* ------- LGWPOR Bit Fields                        ------ */
#define LCDC_LGWPOR_GWPO_MASK                    (0x1FU)                                             /*!< LCDC_LGWPOR.GWPO Mask                   */
#define LCDC_LGWPOR_GWPO_SHIFT                   (0U)                                                /*!< LCDC_LGWPOR.GWPO Position               */
#define LCDC_LGWPOR_GWPO(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1FUL)          /*!< LCDC_LGWPOR.GWPO Field                  */
/* ------- LGWPR Bit Fields                         ------ */
#define LCDC_LGWPR_GWYP_MASK                     (0x3FFU)                                            /*!< LCDC_LGWPR.GWYP Mask                    */
#define LCDC_LGWPR_GWYP_SHIFT                    (0U)                                                /*!< LCDC_LGWPR.GWYP Position                */
#define LCDC_LGWPR_GWYP(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFUL)         /*!< LCDC_LGWPR.GWYP Field                   */
#define LCDC_LGWPR_GWXP_MASK                     (0x3FF0000U)                                        /*!< LCDC_LGWPR.GWXP Mask                    */
#define LCDC_LGWPR_GWXP_SHIFT                    (16U)                                               /*!< LCDC_LGWPR.GWXP Position                */
#define LCDC_LGWPR_GWXP(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x3FF0000UL)    /*!< LCDC_LGWPR.GWXP Field                   */
/* ------- LGWCR Bit Fields                         ------ */
#define LCDC_LGWCR_GWCKB_MASK                    (0x3FU)                                             /*!< LCDC_LGWCR.GWCKB Mask                   */
#define LCDC_LGWCR_GWCKB_SHIFT                   (0U)                                                /*!< LCDC_LGWCR.GWCKB Position               */
#define LCDC_LGWCR_GWCKB(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x3FUL)          /*!< LCDC_LGWCR.GWCKB Field                  */
#define LCDC_LGWCR_GWCKG_MASK                    (0xFC0U)                                            /*!< LCDC_LGWCR.GWCKG Mask                   */
#define LCDC_LGWCR_GWCKG_SHIFT                   (6U)                                                /*!< LCDC_LGWCR.GWCKG Position               */
#define LCDC_LGWCR_GWCKG(x)                      (((uint32_t)(((uint32_t)(x))<<6U))&0xFC0UL)         /*!< LCDC_LGWCR.GWCKG Field                  */
#define LCDC_LGWCR_GWCKR_MASK                    (0x3F000U)                                          /*!< LCDC_LGWCR.GWCKR Mask                   */
#define LCDC_LGWCR_GWCKR_SHIFT                   (12U)                                               /*!< LCDC_LGWCR.GWCKR Position               */
#define LCDC_LGWCR_GWCKR(x)                      (((uint32_t)(((uint32_t)(x))<<12U))&0x3F000UL)      /*!< LCDC_LGWCR.GWCKR Field                  */
#define LCDC_LGWCR_GW_RVS_MASK                   (0x200000U)                                         /*!< LCDC_LGWCR.GW_RVS Mask                  */
#define LCDC_LGWCR_GW_RVS_SHIFT                  (21U)                                               /*!< LCDC_LGWCR.GW_RVS Position              */
#define LCDC_LGWCR_GW_RVS(x)                     (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< LCDC_LGWCR.GW_RVS Field                 */
#define LCDC_LGWCR_GWE_MASK                      (0x400000U)                                         /*!< LCDC_LGWCR.GWE Mask                     */
#define LCDC_LGWCR_GWE_SHIFT                     (22U)                                               /*!< LCDC_LGWCR.GWE Position                 */
#define LCDC_LGWCR_GWE(x)                        (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< LCDC_LGWCR.GWE Field                    */
#define LCDC_LGWCR_GWCKE_MASK                    (0x800000U)                                         /*!< LCDC_LGWCR.GWCKE Mask                   */
#define LCDC_LGWCR_GWCKE_SHIFT                   (23U)                                               /*!< LCDC_LGWCR.GWCKE Position               */
#define LCDC_LGWCR_GWCKE(x)                      (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< LCDC_LGWCR.GWCKE Field                  */
#define LCDC_LGWCR_GWAV_MASK                     (0xFF000000U)                                       /*!< LCDC_LGWCR.GWAV Mask                    */
#define LCDC_LGWCR_GWAV_SHIFT                    (24U)                                               /*!< LCDC_LGWCR.GWAV Position                */
#define LCDC_LGWCR_GWAV(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< LCDC_LGWCR.GWAV Field                   */
/* ------- LGWDCR Bit Fields                        ------ */
#define LCDC_LGWDCR_GWTM_MASK                    (0x7FU)                                             /*!< LCDC_LGWDCR.GWTM Mask                   */
#define LCDC_LGWDCR_GWTM_SHIFT                   (0U)                                                /*!< LCDC_LGWDCR.GWTM Position               */
#define LCDC_LGWDCR_GWTM(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x7FUL)          /*!< LCDC_LGWDCR.GWTM Field                  */
#define LCDC_LGWDCR_GWHM_MASK                    (0x7F0000U)                                         /*!< LCDC_LGWDCR.GWHM Mask                   */
#define LCDC_LGWDCR_GWHM_SHIFT                   (16U)                                               /*!< LCDC_LGWDCR.GWHM Position               */
#define LCDC_LGWDCR_GWHM(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0x7F0000UL)     /*!< LCDC_LGWDCR.GWHM Field                  */
#define LCDC_LGWDCR_GWBT_MASK                    (0x80000000U)                                       /*!< LCDC_LGWDCR.GWBT Mask                   */
#define LCDC_LGWDCR_GWBT_SHIFT                   (31U)                                               /*!< LCDC_LGWDCR.GWBT Position               */
#define LCDC_LGWDCR_GWBT(x)                      (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< LCDC_LGWDCR.GWBT Field                  */
/* ------- LAUSCR Bit Fields                        ------ */
#define LCDC_LAUSCR_AGWCKB_MASK                  (0xFFU)                                             /*!< LCDC_LAUSCR.AGWCKB Mask                 */
#define LCDC_LAUSCR_AGWCKB_SHIFT                 (0U)                                                /*!< LCDC_LAUSCR.AGWCKB Position             */
#define LCDC_LAUSCR_AGWCKB(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< LCDC_LAUSCR.AGWCKB Field                */
#define LCDC_LAUSCR_AGWCKG_MASK                  (0xFF00U)                                           /*!< LCDC_LAUSCR.AGWCKG Mask                 */
#define LCDC_LAUSCR_AGWCKG_SHIFT                 (8U)                                                /*!< LCDC_LAUSCR.AGWCKG Position             */
#define LCDC_LAUSCR_AGWCKG(x)                    (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< LCDC_LAUSCR.AGWCKG Field                */
#define LCDC_LAUSCR_AGWCKR_MASK                  (0xFF0000U)                                         /*!< LCDC_LAUSCR.AGWCKR Mask                 */
#define LCDC_LAUSCR_AGWCKR_SHIFT                 (16U)                                               /*!< LCDC_LAUSCR.AGWCKR Position             */
#define LCDC_LAUSCR_AGWCKR(x)                    (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< LCDC_LAUSCR.AGWCKR Field                */
#define LCDC_LAUSCR_AUS_Mode_MASK                (0x80000000U)                                       /*!< LCDC_LAUSCR.AUS_Mode Mask               */
#define LCDC_LAUSCR_AUS_Mode_SHIFT               (31U)                                               /*!< LCDC_LAUSCR.AUS_Mode Position           */
#define LCDC_LAUSCR_AUS_Mode(x)                  (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< LCDC_LAUSCR.AUS_Mode Field              */
/* ------- LAUSCCR Bit Fields                       ------ */
#define LCDC_LAUSCCR_ACUR_COL_B_MASK             (0xFFU)                                             /*!< LCDC_LAUSCCR.ACUR_COL_B Mask            */
#define LCDC_LAUSCCR_ACUR_COL_B_SHIFT            (0U)                                                /*!< LCDC_LAUSCCR.ACUR_COL_B Position        */
#define LCDC_LAUSCCR_ACUR_COL_B(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< LCDC_LAUSCCR.ACUR_COL_B Field           */
#define LCDC_LAUSCCR_ACUR_COL_G_MASK             (0xFF00U)                                           /*!< LCDC_LAUSCCR.ACUR_COL_G Mask            */
#define LCDC_LAUSCCR_ACUR_COL_G_SHIFT            (8U)                                                /*!< LCDC_LAUSCCR.ACUR_COL_G Position        */
#define LCDC_LAUSCCR_ACUR_COL_G(x)               (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< LCDC_LAUSCCR.ACUR_COL_G Field           */
#define LCDC_LAUSCCR_ACUR_COL_R_MASK             (0xFF0000U)                                         /*!< LCDC_LAUSCCR.ACUR_COL_R Mask            */
#define LCDC_LAUSCCR_ACUR_COL_R_SHIFT            (16U)                                               /*!< LCDC_LAUSCCR.ACUR_COL_R Position        */
#define LCDC_LAUSCCR_ACUR_COL_R(x)               (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< LCDC_LAUSCCR.ACUR_COL_R Field           */
/**
 * @} */ /* End group LCDC_Register_Masks_GROUP 
 */

