podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
* @addtogroup LMEM_Register_Masks_GROUP LMEM Register Masks
* @brief Register Masks for LMEM
* @{
*/
/* ------- PCCCR Bit Fields                         ------ */
#define LMEM_PCCCR_ENCACHE_MASK                  (0x1U)                                              /*!< LMEM_PCCCR.ENCACHE Mask                 */
#define LMEM_PCCCR_ENCACHE_SHIFT                 (0U)                                                /*!< LMEM_PCCCR.ENCACHE Position             */
#define LMEM_PCCCR_ENCACHE(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< LMEM_PCCCR.ENCACHE Field                */
#define LMEM_PCCCR_ENWRBUF_MASK                  (0x2U)                                              /*!< LMEM_PCCCR.ENWRBUF Mask                 */
#define LMEM_PCCCR_ENWRBUF_SHIFT                 (1U)                                                /*!< LMEM_PCCCR.ENWRBUF Position             */
#define LMEM_PCCCR_ENWRBUF(x)                    (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< LMEM_PCCCR.ENWRBUF Field                */
#define LMEM_PCCCR_INVW0_MASK                    (0x1000000U)                                        /*!< LMEM_PCCCR.INVW0 Mask                   */
#define LMEM_PCCCR_INVW0_SHIFT                   (24U)                                               /*!< LMEM_PCCCR.INVW0 Position               */
#define LMEM_PCCCR_INVW0(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< LMEM_PCCCR.INVW0 Field                  */
#define LMEM_PCCCR_PUSHW0_MASK                   (0x2000000U)                                        /*!< LMEM_PCCCR.PUSHW0 Mask                  */
#define LMEM_PCCCR_PUSHW0_SHIFT                  (25U)                                               /*!< LMEM_PCCCR.PUSHW0 Position              */
#define LMEM_PCCCR_PUSHW0(x)                     (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< LMEM_PCCCR.PUSHW0 Field                 */
#define LMEM_PCCCR_INVW1_MASK                    (0x4000000U)                                        /*!< LMEM_PCCCR.INVW1 Mask                   */
#define LMEM_PCCCR_INVW1_SHIFT                   (26U)                                               /*!< LMEM_PCCCR.INVW1 Position               */
#define LMEM_PCCCR_INVW1(x)                      (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< LMEM_PCCCR.INVW1 Field                  */
#define LMEM_PCCCR_PUSHW1_MASK                   (0x8000000U)                                        /*!< LMEM_PCCCR.PUSHW1 Mask                  */
#define LMEM_PCCCR_PUSHW1_SHIFT                  (27U)                                               /*!< LMEM_PCCCR.PUSHW1 Position              */
#define LMEM_PCCCR_PUSHW1(x)                     (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< LMEM_PCCCR.PUSHW1 Field                 */
#define LMEM_PCCCR_GO_MASK                       (0x80000000U)                                       /*!< LMEM_PCCCR.GO Mask                      */
#define LMEM_PCCCR_GO_SHIFT                      (31U)                                               /*!< LMEM_PCCCR.GO Position                  */
#define LMEM_PCCCR_GO(x)                         (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< LMEM_PCCCR.GO Field                     */
/* ------- PCCLCR Bit Fields                        ------ */
#define LMEM_PCCLCR_LGO_MASK                     (0x1U)                                              /*!< LMEM_PCCLCR.LGO Mask                    */
#define LMEM_PCCLCR_LGO_SHIFT                    (0U)                                                /*!< LMEM_PCCLCR.LGO Position                */
#define LMEM_PCCLCR_LGO(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< LMEM_PCCLCR.LGO Field                   */
#define LMEM_PCCLCR_CACHEADDR_MASK               (0xFFCU)                                            /*!< LMEM_PCCLCR.CACHEADDR Mask              */
#define LMEM_PCCLCR_CACHEADDR_SHIFT              (2U)                                                /*!< LMEM_PCCLCR.CACHEADDR Position          */
#define LMEM_PCCLCR_CACHEADDR(x)                 (((uint32_t)(((uint32_t)(x))<<2U))&0xFFCUL)         /*!< LMEM_PCCLCR.CACHEADDR Field             */
#define LMEM_PCCLCR_WSEL_MASK                    (0x4000U)                                           /*!< LMEM_PCCLCR.WSEL Mask                   */
#define LMEM_PCCLCR_WSEL_SHIFT                   (14U)                                               /*!< LMEM_PCCLCR.WSEL Position               */
#define LMEM_PCCLCR_WSEL(x)                      (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< LMEM_PCCLCR.WSEL Field                  */
#define LMEM_PCCLCR_TDSEL_MASK                   (0x10000U)                                          /*!< LMEM_PCCLCR.TDSEL Mask                  */
#define LMEM_PCCLCR_TDSEL_SHIFT                  (16U)                                               /*!< LMEM_PCCLCR.TDSEL Position              */
#define LMEM_PCCLCR_TDSEL(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< LMEM_PCCLCR.TDSEL Field                 */
#define LMEM_PCCLCR_LCIVB_MASK                   (0x100000U)                                         /*!< LMEM_PCCLCR.LCIVB Mask                  */
#define LMEM_PCCLCR_LCIVB_SHIFT                  (20U)                                               /*!< LMEM_PCCLCR.LCIVB Position              */
#define LMEM_PCCLCR_LCIVB(x)                     (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< LMEM_PCCLCR.LCIVB Field                 */
#define LMEM_PCCLCR_LCIMB_MASK                   (0x200000U)                                         /*!< LMEM_PCCLCR.LCIMB Mask                  */
#define LMEM_PCCLCR_LCIMB_SHIFT                  (21U)                                               /*!< LMEM_PCCLCR.LCIMB Position              */
#define LMEM_PCCLCR_LCIMB(x)                     (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< LMEM_PCCLCR.LCIMB Field                 */
#define LMEM_PCCLCR_LCWAY_MASK                   (0x400000U)                                         /*!< LMEM_PCCLCR.LCWAY Mask                  */
#define LMEM_PCCLCR_LCWAY_SHIFT                  (22U)                                               /*!< LMEM_PCCLCR.LCWAY Position              */
#define LMEM_PCCLCR_LCWAY(x)                     (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< LMEM_PCCLCR.LCWAY Field                 */
#define LMEM_PCCLCR_LCMD_MASK                    (0x3000000U)                                        /*!< LMEM_PCCLCR.LCMD Mask                   */
#define LMEM_PCCLCR_LCMD_SHIFT                   (24U)                                               /*!< LMEM_PCCLCR.LCMD Position               */
#define LMEM_PCCLCR_LCMD(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< LMEM_PCCLCR.LCMD Field                  */
#define LMEM_PCCLCR_LADSEL_MASK                  (0x4000000U)                                        /*!< LMEM_PCCLCR.LADSEL Mask                 */
#define LMEM_PCCLCR_LADSEL_SHIFT                 (26U)                                               /*!< LMEM_PCCLCR.LADSEL Position             */
#define LMEM_PCCLCR_LADSEL(x)                    (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< LMEM_PCCLCR.LADSEL Field                */
#define LMEM_PCCLCR_LACC_MASK                    (0x8000000U)                                        /*!< LMEM_PCCLCR.LACC Mask                   */
#define LMEM_PCCLCR_LACC_SHIFT                   (27U)                                               /*!< LMEM_PCCLCR.LACC Position               */
#define LMEM_PCCLCR_LACC(x)                      (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< LMEM_PCCLCR.LACC Field                  */
/* ------- PCCSAR Bit Fields                        ------ */
#define LMEM_PCCSAR_LGO_MASK                     (0x1U)                                              /*!< LMEM_PCCSAR.LGO Mask                    */
#define LMEM_PCCSAR_LGO_SHIFT                    (0U)                                                /*!< LMEM_PCCSAR.LGO Position                */
#define LMEM_PCCSAR_LGO(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< LMEM_PCCSAR.LGO Field                   */
#define LMEM_PCCSAR_PHYADDR_MASK                 (0xFFFFFFFCU)                                       /*!< LMEM_PCCSAR.PHYADDR Mask                */
#define LMEM_PCCSAR_PHYADDR_SHIFT                (2U)                                                /*!< LMEM_PCCSAR.PHYADDR Position            */
#define LMEM_PCCSAR_PHYADDR(x)                   (((uint32_t)(((uint32_t)(x))<<2U))&0xFFFFFFFCUL)    /*!< LMEM_PCCSAR.PHYADDR Field               */
/* ------- PCCCVR Bit Fields                        ------ */
#define LMEM_PCCCVR_DATA_MASK                    (0xFFFFFFFFU)                                       /*!< LMEM_PCCCVR.DATA Mask                   */
#define LMEM_PCCCVR_DATA_SHIFT                   (0U)                                                /*!< LMEM_PCCCVR.DATA Position               */
#define LMEM_PCCCVR_DATA(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< LMEM_PCCCVR.DATA Field                  */
/* ------- PCCRMR Bit Fields                        ------ */
#define LMEM_PCCRMR_R15_MASK                     (0x3U)                                              /*!< LMEM_PCCRMR.R15 Mask                    */
#define LMEM_PCCRMR_R15_SHIFT                    (0U)                                                /*!< LMEM_PCCRMR.R15 Position                */
#define LMEM_PCCRMR_R15(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< LMEM_PCCRMR.R15 Field                   */
#define LMEM_PCCRMR_R14_MASK                     (0xCU)                                              /*!< LMEM_PCCRMR.R14 Mask                    */
#define LMEM_PCCRMR_R14_SHIFT                    (2U)                                                /*!< LMEM_PCCRMR.R14 Position                */
#define LMEM_PCCRMR_R14(x)                       (((uint32_t)(((uint32_t)(x))<<2U))&0xCUL)           /*!< LMEM_PCCRMR.R14 Field                   */
#define LMEM_PCCRMR_R13_MASK                     (0x30U)                                             /*!< LMEM_PCCRMR.R13 Mask                    */
#define LMEM_PCCRMR_R13_SHIFT                    (4U)                                                /*!< LMEM_PCCRMR.R13 Position                */
#define LMEM_PCCRMR_R13(x)                       (((uint32_t)(((uint32_t)(x))<<4U))&0x30UL)          /*!< LMEM_PCCRMR.R13 Field                   */
#define LMEM_PCCRMR_R12_MASK                     (0xC0U)                                             /*!< LMEM_PCCRMR.R12 Mask                    */
#define LMEM_PCCRMR_R12_SHIFT                    (6U)                                                /*!< LMEM_PCCRMR.R12 Position                */
#define LMEM_PCCRMR_R12(x)                       (((uint32_t)(((uint32_t)(x))<<6U))&0xC0UL)          /*!< LMEM_PCCRMR.R12 Field                   */
#define LMEM_PCCRMR_R11_MASK                     (0x300U)                                            /*!< LMEM_PCCRMR.R11 Mask                    */
#define LMEM_PCCRMR_R11_SHIFT                    (8U)                                                /*!< LMEM_PCCRMR.R11 Position                */
#define LMEM_PCCRMR_R11(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0x300UL)         /*!< LMEM_PCCRMR.R11 Field                   */
#define LMEM_PCCRMR_R10_MASK                     (0xC00U)                                            /*!< LMEM_PCCRMR.R10 Mask                    */
#define LMEM_PCCRMR_R10_SHIFT                    (10U)                                               /*!< LMEM_PCCRMR.R10 Position                */
#define LMEM_PCCRMR_R10(x)                       (((uint32_t)(((uint32_t)(x))<<10U))&0xC00UL)        /*!< LMEM_PCCRMR.R10 Field                   */
#define LMEM_PCCRMR_R9_MASK                      (0x3000U)                                           /*!< LMEM_PCCRMR.R9 Mask                     */
#define LMEM_PCCRMR_R9_SHIFT                     (12U)                                               /*!< LMEM_PCCRMR.R9 Position                 */
#define LMEM_PCCRMR_R9(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0x3000UL)       /*!< LMEM_PCCRMR.R9 Field                    */
#define LMEM_PCCRMR_R8_MASK                      (0xC000U)                                           /*!< LMEM_PCCRMR.R8 Mask                     */
#define LMEM_PCCRMR_R8_SHIFT                     (14U)                                               /*!< LMEM_PCCRMR.R8 Position                 */
#define LMEM_PCCRMR_R8(x)                        (((uint32_t)(((uint32_t)(x))<<14U))&0xC000UL)       /*!< LMEM_PCCRMR.R8 Field                    */
#define LMEM_PCCRMR_R7_MASK                      (0x30000U)                                          /*!< LMEM_PCCRMR.R7 Mask                     */
#define LMEM_PCCRMR_R7_SHIFT                     (16U)                                               /*!< LMEM_PCCRMR.R7 Position                 */
#define LMEM_PCCRMR_R7(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< LMEM_PCCRMR.R7 Field                    */
#define LMEM_PCCRMR_R6_MASK                      (0xC0000U)                                          /*!< LMEM_PCCRMR.R6 Mask                     */
#define LMEM_PCCRMR_R6_SHIFT                     (18U)                                               /*!< LMEM_PCCRMR.R6 Position                 */
#define LMEM_PCCRMR_R6(x)                        (((uint32_t)(((uint32_t)(x))<<18U))&0xC0000UL)      /*!< LMEM_PCCRMR.R6 Field                    */
#define LMEM_PCCRMR_R5_MASK                      (0x300000U)                                         /*!< LMEM_PCCRMR.R5 Mask                     */
#define LMEM_PCCRMR_R5_SHIFT                     (20U)                                               /*!< LMEM_PCCRMR.R5 Position                 */
#define LMEM_PCCRMR_R5(x)                        (((uint32_t)(((uint32_t)(x))<<20U))&0x300000UL)     /*!< LMEM_PCCRMR.R5 Field                    */
#define LMEM_PCCRMR_R4_MASK                      (0xC00000U)                                         /*!< LMEM_PCCRMR.R4 Mask                     */
#define LMEM_PCCRMR_R4_SHIFT                     (22U)                                               /*!< LMEM_PCCRMR.R4 Position                 */
#define LMEM_PCCRMR_R4(x)                        (((uint32_t)(((uint32_t)(x))<<22U))&0xC00000UL)     /*!< LMEM_PCCRMR.R4 Field                    */
#define LMEM_PCCRMR_R3_MASK                      (0x3000000U)                                        /*!< LMEM_PCCRMR.R3 Mask                     */
#define LMEM_PCCRMR_R3_SHIFT                     (24U)                                               /*!< LMEM_PCCRMR.R3 Position                 */
#define LMEM_PCCRMR_R3(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< LMEM_PCCRMR.R3 Field                    */
#define LMEM_PCCRMR_R2_MASK                      (0xC000000U)                                        /*!< LMEM_PCCRMR.R2 Mask                     */
#define LMEM_PCCRMR_R2_SHIFT                     (26U)                                               /*!< LMEM_PCCRMR.R2 Position                 */
#define LMEM_PCCRMR_R2(x)                        (((uint32_t)(((uint32_t)(x))<<26U))&0xC000000UL)    /*!< LMEM_PCCRMR.R2 Field                    */
#define LMEM_PCCRMR_R1_MASK                      (0x30000000U)                                       /*!< LMEM_PCCRMR.R1 Mask                     */
#define LMEM_PCCRMR_R1_SHIFT                     (28U)                                               /*!< LMEM_PCCRMR.R1 Position                 */
#define LMEM_PCCRMR_R1(x)                        (((uint32_t)(((uint32_t)(x))<<28U))&0x30000000UL)   /*!< LMEM_PCCRMR.R1 Field                    */
#define LMEM_PCCRMR_R0_MASK                      (0xC0000000U)                                       /*!< LMEM_PCCRMR.R0 Mask                     */
#define LMEM_PCCRMR_R0_SHIFT                     (30U)                                               /*!< LMEM_PCCRMR.R0 Position                 */
#define LMEM_PCCRMR_R0(x)                        (((uint32_t)(((uint32_t)(x))<<30U))&0xC0000000UL)   /*!< LMEM_PCCRMR.R0 Field                    */
/* ------- PSCCR Bit Fields                         ------ */
#define LMEM_PSCCR_ENCACHE_MASK                  (0x1U)                                              /*!< LMEM_PSCCR.ENCACHE Mask                 */
#define LMEM_PSCCR_ENCACHE_SHIFT                 (0U)                                                /*!< LMEM_PSCCR.ENCACHE Position             */
#define LMEM_PSCCR_ENCACHE(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< LMEM_PSCCR.ENCACHE Field                */
#define LMEM_PSCCR_ENWRBUF_MASK                  (0x2U)                                              /*!< LMEM_PSCCR.ENWRBUF Mask                 */
#define LMEM_PSCCR_ENWRBUF_SHIFT                 (1U)                                                /*!< LMEM_PSCCR.ENWRBUF Position             */
#define LMEM_PSCCR_ENWRBUF(x)                    (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< LMEM_PSCCR.ENWRBUF Field                */
#define LMEM_PSCCR_INVW0_MASK                    (0x1000000U)                                        /*!< LMEM_PSCCR.INVW0 Mask                   */
#define LMEM_PSCCR_INVW0_SHIFT                   (24U)                                               /*!< LMEM_PSCCR.INVW0 Position               */
#define LMEM_PSCCR_INVW0(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< LMEM_PSCCR.INVW0 Field                  */
#define LMEM_PSCCR_PUSHW0_MASK                   (0x2000000U)                                        /*!< LMEM_PSCCR.PUSHW0 Mask                  */
#define LMEM_PSCCR_PUSHW0_SHIFT                  (25U)                                               /*!< LMEM_PSCCR.PUSHW0 Position              */
#define LMEM_PSCCR_PUSHW0(x)                     (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< LMEM_PSCCR.PUSHW0 Field                 */
#define LMEM_PSCCR_INVW1_MASK                    (0x4000000U)                                        /*!< LMEM_PSCCR.INVW1 Mask                   */
#define LMEM_PSCCR_INVW1_SHIFT                   (26U)                                               /*!< LMEM_PSCCR.INVW1 Position               */
#define LMEM_PSCCR_INVW1(x)                      (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< LMEM_PSCCR.INVW1 Field                  */
#define LMEM_PSCCR_PUSHW1_MASK                   (0x8000000U)                                        /*!< LMEM_PSCCR.PUSHW1 Mask                  */
#define LMEM_PSCCR_PUSHW1_SHIFT                  (27U)                                               /*!< LMEM_PSCCR.PUSHW1 Position              */
#define LMEM_PSCCR_PUSHW1(x)                     (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< LMEM_PSCCR.PUSHW1 Field                 */
#define LMEM_PSCCR_GO_MASK                       (0x80000000U)                                       /*!< LMEM_PSCCR.GO Mask                      */
#define LMEM_PSCCR_GO_SHIFT                      (31U)                                               /*!< LMEM_PSCCR.GO Position                  */
#define LMEM_PSCCR_GO(x)                         (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< LMEM_PSCCR.GO Field                     */
/* ------- PSCLCR Bit Fields                        ------ */
#define LMEM_PSCLCR_LGO_MASK                     (0x1U)                                              /*!< LMEM_PSCLCR.LGO Mask                    */
#define LMEM_PSCLCR_LGO_SHIFT                    (0U)                                                /*!< LMEM_PSCLCR.LGO Position                */
#define LMEM_PSCLCR_LGO(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< LMEM_PSCLCR.LGO Field                   */
#define LMEM_PSCLCR_CACHEADDR_MASK               (0xFFCU)                                            /*!< LMEM_PSCLCR.CACHEADDR Mask              */
#define LMEM_PSCLCR_CACHEADDR_SHIFT              (2U)                                                /*!< LMEM_PSCLCR.CACHEADDR Position          */
#define LMEM_PSCLCR_CACHEADDR(x)                 (((uint32_t)(((uint32_t)(x))<<2U))&0xFFCUL)         /*!< LMEM_PSCLCR.CACHEADDR Field             */
#define LMEM_PSCLCR_WSEL_MASK                    (0x4000U)                                           /*!< LMEM_PSCLCR.WSEL Mask                   */
#define LMEM_PSCLCR_WSEL_SHIFT                   (14U)                                               /*!< LMEM_PSCLCR.WSEL Position               */
#define LMEM_PSCLCR_WSEL(x)                      (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< LMEM_PSCLCR.WSEL Field                  */
#define LMEM_PSCLCR_TDSEL_MASK                   (0x10000U)                                          /*!< LMEM_PSCLCR.TDSEL Mask                  */
#define LMEM_PSCLCR_TDSEL_SHIFT                  (16U)                                               /*!< LMEM_PSCLCR.TDSEL Position              */
#define LMEM_PSCLCR_TDSEL(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< LMEM_PSCLCR.TDSEL Field                 */
#define LMEM_PSCLCR_LCIVB_MASK                   (0x100000U)                                         /*!< LMEM_PSCLCR.LCIVB Mask                  */
#define LMEM_PSCLCR_LCIVB_SHIFT                  (20U)                                               /*!< LMEM_PSCLCR.LCIVB Position              */
#define LMEM_PSCLCR_LCIVB(x)                     (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< LMEM_PSCLCR.LCIVB Field                 */
#define LMEM_PSCLCR_LCIMB_MASK                   (0x200000U)                                         /*!< LMEM_PSCLCR.LCIMB Mask                  */
#define LMEM_PSCLCR_LCIMB_SHIFT                  (21U)                                               /*!< LMEM_PSCLCR.LCIMB Position              */
#define LMEM_PSCLCR_LCIMB(x)                     (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< LMEM_PSCLCR.LCIMB Field                 */
#define LMEM_PSCLCR_LCWAY_MASK                   (0x400000U)                                         /*!< LMEM_PSCLCR.LCWAY Mask                  */
#define LMEM_PSCLCR_LCWAY_SHIFT                  (22U)                                               /*!< LMEM_PSCLCR.LCWAY Position              */
#define LMEM_PSCLCR_LCWAY(x)                     (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< LMEM_PSCLCR.LCWAY Field                 */
#define LMEM_PSCLCR_LCMD_MASK                    (0x3000000U)                                        /*!< LMEM_PSCLCR.LCMD Mask                   */
#define LMEM_PSCLCR_LCMD_SHIFT                   (24U)                                               /*!< LMEM_PSCLCR.LCMD Position               */
#define LMEM_PSCLCR_LCMD(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< LMEM_PSCLCR.LCMD Field                  */
#define LMEM_PSCLCR_LADSEL_MASK                  (0x4000000U)                                        /*!< LMEM_PSCLCR.LADSEL Mask                 */
#define LMEM_PSCLCR_LADSEL_SHIFT                 (26U)                                               /*!< LMEM_PSCLCR.LADSEL Position             */
#define LMEM_PSCLCR_LADSEL(x)                    (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< LMEM_PSCLCR.LADSEL Field                */
#define LMEM_PSCLCR_LACC_MASK                    (0x8000000U)                                        /*!< LMEM_PSCLCR.LACC Mask                   */
