podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define LMEM_PSCLCR_LACC_SHIFT                   (27U)                                               /*!< LMEM_PSCLCR.LACC Position               */
#define LMEM_PSCLCR_LACC(x)                      (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< LMEM_PSCLCR.LACC Field                  */
/* ------- PSCSAR Bit Fields                        ------ */
#define LMEM_PSCSAR_LGO_MASK                     (0x1U)                                              /*!< LMEM_PSCSAR.LGO Mask                    */
#define LMEM_PSCSAR_LGO_SHIFT                    (0U)                                                /*!< LMEM_PSCSAR.LGO Position                */
#define LMEM_PSCSAR_LGO(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< LMEM_PSCSAR.LGO Field                   */
#define LMEM_PSCSAR_PHYADDR_MASK                 (0xFFFFFFFCU)                                       /*!< LMEM_PSCSAR.PHYADDR Mask                */
#define LMEM_PSCSAR_PHYADDR_SHIFT                (2U)                                                /*!< LMEM_PSCSAR.PHYADDR Position            */
#define LMEM_PSCSAR_PHYADDR(x)                   (((uint32_t)(((uint32_t)(x))<<2U))&0xFFFFFFFCUL)    /*!< LMEM_PSCSAR.PHYADDR Field               */
/* ------- PSCCVR Bit Fields                        ------ */
#define LMEM_PSCCVR_DATA_MASK                    (0xFFFFFFFFU)                                       /*!< LMEM_PSCCVR.DATA Mask                   */
#define LMEM_PSCCVR_DATA_SHIFT                   (0U)                                                /*!< LMEM_PSCCVR.DATA Position               */
#define LMEM_PSCCVR_DATA(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< LMEM_PSCCVR.DATA Field                  */
/* ------- PSCRMR Bit Fields                        ------ */
#define LMEM_PSCRMR_R15_MASK                     (0x3U)                                              /*!< LMEM_PSCRMR.R15 Mask                    */
#define LMEM_PSCRMR_R15_SHIFT                    (0U)                                                /*!< LMEM_PSCRMR.R15 Position                */
#define LMEM_PSCRMR_R15(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< LMEM_PSCRMR.R15 Field                   */
#define LMEM_PSCRMR_R14_MASK                     (0xCU)                                              /*!< LMEM_PSCRMR.R14 Mask                    */
#define LMEM_PSCRMR_R14_SHIFT                    (2U)                                                /*!< LMEM_PSCRMR.R14 Position                */
#define LMEM_PSCRMR_R14(x)                       (((uint32_t)(((uint32_t)(x))<<2U))&0xCUL)           /*!< LMEM_PSCRMR.R14 Field                   */
#define LMEM_PSCRMR_R13_MASK                     (0x30U)                                             /*!< LMEM_PSCRMR.R13 Mask                    */
#define LMEM_PSCRMR_R13_SHIFT                    (4U)                                                /*!< LMEM_PSCRMR.R13 Position                */
#define LMEM_PSCRMR_R13(x)                       (((uint32_t)(((uint32_t)(x))<<4U))&0x30UL)          /*!< LMEM_PSCRMR.R13 Field                   */
#define LMEM_PSCRMR_R12_MASK                     (0xC0U)                                             /*!< LMEM_PSCRMR.R12 Mask                    */
#define LMEM_PSCRMR_R12_SHIFT                    (6U)                                                /*!< LMEM_PSCRMR.R12 Position                */
#define LMEM_PSCRMR_R12(x)                       (((uint32_t)(((uint32_t)(x))<<6U))&0xC0UL)          /*!< LMEM_PSCRMR.R12 Field                   */
#define LMEM_PSCRMR_R11_MASK                     (0x300U)                                            /*!< LMEM_PSCRMR.R11 Mask                    */
#define LMEM_PSCRMR_R11_SHIFT                    (8U)                                                /*!< LMEM_PSCRMR.R11 Position                */
#define LMEM_PSCRMR_R11(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0x300UL)         /*!< LMEM_PSCRMR.R11 Field                   */
#define LMEM_PSCRMR_R10_MASK                     (0xC00U)                                            /*!< LMEM_PSCRMR.R10 Mask                    */
#define LMEM_PSCRMR_R10_SHIFT                    (10U)                                               /*!< LMEM_PSCRMR.R10 Position                */
#define LMEM_PSCRMR_R10(x)                       (((uint32_t)(((uint32_t)(x))<<10U))&0xC00UL)        /*!< LMEM_PSCRMR.R10 Field                   */
#define LMEM_PSCRMR_R9_MASK                      (0x3000U)                                           /*!< LMEM_PSCRMR.R9 Mask                     */
#define LMEM_PSCRMR_R9_SHIFT                     (12U)                                               /*!< LMEM_PSCRMR.R9 Position                 */
#define LMEM_PSCRMR_R9(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0x3000UL)       /*!< LMEM_PSCRMR.R9 Field                    */
#define LMEM_PSCRMR_R8_MASK                      (0xC000U)                                           /*!< LMEM_PSCRMR.R8 Mask                     */
#define LMEM_PSCRMR_R8_SHIFT                     (14U)                                               /*!< LMEM_PSCRMR.R8 Position                 */
#define LMEM_PSCRMR_R8(x)                        (((uint32_t)(((uint32_t)(x))<<14U))&0xC000UL)       /*!< LMEM_PSCRMR.R8 Field                    */
#define LMEM_PSCRMR_R7_MASK                      (0x30000U)                                          /*!< LMEM_PSCRMR.R7 Mask                     */
#define LMEM_PSCRMR_R7_SHIFT                     (16U)                                               /*!< LMEM_PSCRMR.R7 Position                 */
#define LMEM_PSCRMR_R7(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< LMEM_PSCRMR.R7 Field                    */
#define LMEM_PSCRMR_R6_MASK                      (0xC0000U)                                          /*!< LMEM_PSCRMR.R6 Mask                     */
#define LMEM_PSCRMR_R6_SHIFT                     (18U)                                               /*!< LMEM_PSCRMR.R6 Position                 */
#define LMEM_PSCRMR_R6(x)                        (((uint32_t)(((uint32_t)(x))<<18U))&0xC0000UL)      /*!< LMEM_PSCRMR.R6 Field                    */
#define LMEM_PSCRMR_R5_MASK                      (0x300000U)                                         /*!< LMEM_PSCRMR.R5 Mask                     */
#define LMEM_PSCRMR_R5_SHIFT                     (20U)                                               /*!< LMEM_PSCRMR.R5 Position                 */
#define LMEM_PSCRMR_R5(x)                        (((uint32_t)(((uint32_t)(x))<<20U))&0x300000UL)     /*!< LMEM_PSCRMR.R5 Field                    */
#define LMEM_PSCRMR_R4_MASK                      (0xC00000U)                                         /*!< LMEM_PSCRMR.R4 Mask                     */
#define LMEM_PSCRMR_R4_SHIFT                     (22U)                                               /*!< LMEM_PSCRMR.R4 Position                 */
#define LMEM_PSCRMR_R4(x)                        (((uint32_t)(((uint32_t)(x))<<22U))&0xC00000UL)     /*!< LMEM_PSCRMR.R4 Field                    */
#define LMEM_PSCRMR_R3_MASK                      (0x3000000U)                                        /*!< LMEM_PSCRMR.R3 Mask                     */
#define LMEM_PSCRMR_R3_SHIFT                     (24U)                                               /*!< LMEM_PSCRMR.R3 Position                 */
#define LMEM_PSCRMR_R3(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< LMEM_PSCRMR.R3 Field                    */
#define LMEM_PSCRMR_R2_MASK                      (0xC000000U)                                        /*!< LMEM_PSCRMR.R2 Mask                     */
#define LMEM_PSCRMR_R2_SHIFT                     (26U)                                               /*!< LMEM_PSCRMR.R2 Position                 */
#define LMEM_PSCRMR_R2(x)                        (((uint32_t)(((uint32_t)(x))<<26U))&0xC000000UL)    /*!< LMEM_PSCRMR.R2 Field                    */
#define LMEM_PSCRMR_R1_MASK                      (0x30000000U)                                       /*!< LMEM_PSCRMR.R1 Mask                     */
#define LMEM_PSCRMR_R1_SHIFT                     (28U)                                               /*!< LMEM_PSCRMR.R1 Position                 */
#define LMEM_PSCRMR_R1(x)                        (((uint32_t)(((uint32_t)(x))<<28U))&0x30000000UL)   /*!< LMEM_PSCRMR.R1 Field                    */
#define LMEM_PSCRMR_R0_MASK                      (0xC0000000U)                                       /*!< LMEM_PSCRMR.R0 Mask                     */
#define LMEM_PSCRMR_R0_SHIFT                     (30U)                                               /*!< LMEM_PSCRMR.R0 Position                 */
#define LMEM_PSCRMR_R0(x)                        (((uint32_t)(((uint32_t)(x))<<30U))&0xC0000000UL)   /*!< LMEM_PSCRMR.R0 Field                    */
/**
 * @} */ /* End group LMEM_Register_Masks_GROUP 
 */

/* LMEM - Peripheral instance base addresses */
#define LMEM_BasePtr                   0xE0082000UL //!< Peripheral base address
#define LMEM                           ((LMEM_Type *) LMEM_BasePtr) //!< Freescale base pointer
#define LMEM_BASE_PTR                  (LMEM) //!< Freescale style base pointer
/**
 * @} */ /* End group LMEM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup LPTMR_Peripheral_access_layer_GROUP LPTMR Peripheral Access Layer
* @brief C Struct for LPTMR
* @{
*/

/* ================================================================================ */
/* ================           LPTMR0 (file:LPTMR0)                 ================ */
/* ================================================================================ */

/**
 * @brief Low Power Timer
 */
/**
* @addtogroup LPTMR_structs_GROUP LPTMR struct
* @brief Struct for LPTMR
* @{
*/
typedef struct LPTMR_Type {
   __IO uint32_t  CSR;                          /**< 0000: Control Status Register                                      */
   __IO uint32_t  PSR;                          /**< 0004: Prescale Register                                            */
   __IO uint32_t  CMR;                          /**< 0008: Compare Register                                             */
   __IO uint32_t  CNR;                          /**< 000C: Counter Register                                             */
} LPTMR_Type;

/**
 * @} */ /* End group LPTMR_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'LPTMR0' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup LPTMR_Register_Masks_GROUP LPTMR Register Masks
* @brief Register Masks for LPTMR
* @{
*/
/* ------- CSR Bit Fields                           ------ */
#define LPTMR_CSR_TEN_MASK                       (0x1U)                                              /*!< LPTMR0_CSR.TEN Mask                     */
#define LPTMR_CSR_TEN_SHIFT                      (0U)                                                /*!< LPTMR0_CSR.TEN Position                 */
#define LPTMR_CSR_TEN(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< LPTMR0_CSR.TEN Field                    */
#define LPTMR_CSR_TMS_MASK                       (0x2U)                                              /*!< LPTMR0_CSR.TMS Mask                     */
#define LPTMR_CSR_TMS_SHIFT                      (1U)                                                /*!< LPTMR0_CSR.TMS Position                 */
#define LPTMR_CSR_TMS(x)                         (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< LPTMR0_CSR.TMS Field                    */
#define LPTMR_CSR_TFC_MASK                       (0x4U)                                              /*!< LPTMR0_CSR.TFC Mask                     */
#define LPTMR_CSR_TFC_SHIFT                      (2U)                                                /*!< LPTMR0_CSR.TFC Position                 */
#define LPTMR_CSR_TFC(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< LPTMR0_CSR.TFC Field                    */
#define LPTMR_CSR_TPP_MASK                       (0x8U)                                              /*!< LPTMR0_CSR.TPP Mask                     */
#define LPTMR_CSR_TPP_SHIFT                      (3U)                                                /*!< LPTMR0_CSR.TPP Position                 */
#define LPTMR_CSR_TPP(x)                         (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< LPTMR0_CSR.TPP Field                    */
#define LPTMR_CSR_TPS_MASK                       (0x30U)                                             /*!< LPTMR0_CSR.TPS Mask                     */
#define LPTMR_CSR_TPS_SHIFT                      (4U)                                                /*!< LPTMR0_CSR.TPS Position                 */
#define LPTMR_CSR_TPS(x)                         (((uint32_t)(((uint32_t)(x))<<4U))&0x30UL)          /*!< LPTMR0_CSR.TPS Field                    */
#define LPTMR_CSR_TIE_MASK                       (0x40U)                                             /*!< LPTMR0_CSR.TIE Mask                     */
#define LPTMR_CSR_TIE_SHIFT                      (6U)                                                /*!< LPTMR0_CSR.TIE Position                 */
#define LPTMR_CSR_TIE(x)                         (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< LPTMR0_CSR.TIE Field                    */
#define LPTMR_CSR_TCF_MASK                       (0x80U)                                             /*!< LPTMR0_CSR.TCF Mask                     */
#define LPTMR_CSR_TCF_SHIFT                      (7U)                                                /*!< LPTMR0_CSR.TCF Position                 */
#define LPTMR_CSR_TCF(x)                         (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< LPTMR0_CSR.TCF Field                    */
/* ------- PSR Bit Fields                           ------ */
#define LPTMR_PSR_PCS_MASK                       (0x3U)                                              /*!< LPTMR0_PSR.PCS Mask                     */
#define LPTMR_PSR_PCS_SHIFT                      (0U)                                                /*!< LPTMR0_PSR.PCS Position                 */
#define LPTMR_PSR_PCS(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< LPTMR0_PSR.PCS Field                    */
#define LPTMR_PSR_PBYP_MASK                      (0x4U)                                              /*!< LPTMR0_PSR.PBYP Mask                    */
#define LPTMR_PSR_PBYP_SHIFT                     (2U)                                                /*!< LPTMR0_PSR.PBYP Position                */
#define LPTMR_PSR_PBYP(x)                        (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< LPTMR0_PSR.PBYP Field                   */
#define LPTMR_PSR_PRESCALE_MASK                  (0x78U)                                             /*!< LPTMR0_PSR.PRESCALE Mask                */
#define LPTMR_PSR_PRESCALE_SHIFT                 (3U)                                                /*!< LPTMR0_PSR.PRESCALE Position            */
#define LPTMR_PSR_PRESCALE(x)                    (((uint32_t)(((uint32_t)(x))<<3U))&0x78UL)          /*!< LPTMR0_PSR.PRESCALE Field               */
/* ------- CMR Bit Fields                           ------ */
#define LPTMR_CMR_COMPARE_MASK                   (0xFFFFU)                                           /*!< LPTMR0_CMR.COMPARE Mask                 */
#define LPTMR_CMR_COMPARE_SHIFT                  (0U)                                                /*!< LPTMR0_CMR.COMPARE Position             */
#define LPTMR_CMR_COMPARE(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< LPTMR0_CMR.COMPARE Field                */
/* ------- CNR Bit Fields                           ------ */
#define LPTMR_CNR_COUNTER_MASK                   (0xFFFFU)                                           /*!< LPTMR0_CNR.COUNTER Mask                 */
#define LPTMR_CNR_COUNTER_SHIFT                  (0U)                                                /*!< LPTMR0_CNR.COUNTER Position             */
#define LPTMR_CNR_COUNTER(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< LPTMR0_CNR.COUNTER Field                */
/**
 * @} */ /* End group LPTMR_Register_Masks_GROUP 
 */

/* LPTMR0 - Peripheral instance base addresses */
#define LPTMR0_BasePtr                 0x40040000UL //!< Peripheral base address
#define LPTMR0                         ((LPTMR_Type *) LPTMR0_BasePtr) //!< Freescale base pointer
#define LPTMR0_BASE_PTR                (LPTMR0) //!< Freescale style base pointer
#define LPTMR0_IRQS { LPTMR0_IRQn,  }

/**
 * @} */ /* End group LPTMR_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup MCG_Peripheral_access_layer_GROUP MCG Peripheral Access Layer
* @brief C Struct for MCG
* @{
*/

/* ================================================================================ */
/* ================           MCG (file:MCG_MK_DUALPLL)            ================ */
/* ================================================================================ */

/**
 * @brief Multipurpose Clock Generator module (3 OSC, 2 PLL)
 */
/**
* @addtogroup MCG_structs_GROUP MCG struct
* @brief Struct for MCG
* @{
*/
typedef struct MCG_Type {
   __IO uint8_t   C1;                           /**< 0000: Control 1 Register                                           */
   __IO uint8_t   C2;                           /**< 0001: Control 2 Register                                           */
   __IO uint8_t   C3;                           /**< 0002: Control 3 Register                                           */
   __IO uint8_t   C4;                           /**< 0003: Control 4 Register                                           */
   __IO uint8_t   C5;                           /**< 0004: Control 5 Register                                           */
   __IO uint8_t   C6;                           /**< 0005: Control 6 Register                                           */
   __IO uint8_t   S;                            /**< 0006: Status Register                                              */
        uint8_t   RESERVED_0;                   /**< 0007: 0x1 bytes                                                    */
   __IO uint8_t   SC;                           /**< 0008: Status and Control Register                                  */
        uint8_t   RESERVED_1;                   /**< 0009: 0x1 bytes                                                    */
   __IO uint8_t   ATCVH;                        /**< 000A: ATM Compare Value High                                       */
   __IO uint8_t   ATCVL;                        /**< 000B: ATM Compare Value Low                                        */
   __IO uint8_t   C7;                           /**< 000C: Control 7 Register                                           */
   __IO uint8_t   C8;                           /**< 000D: Control 8 Register                                           */
        uint8_t   RESERVED_2;                   /**< 000E: 0x1 bytes                                                    */
   __IO uint8_t   C10;                          /**< 000F: Control 10 Register                                          */
   __IO uint8_t   C11;                          /**< 0010: Control 11 Register                                          */
   __IO uint8_t   C12;                          /**< 0011: Control 12 Register                                          */
   __I  uint8_t   S2;                           /**< 0012: Status 2 Register                                            */
} MCG_Type;

/**
 * @} */ /* End group MCG_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'MCG' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

