podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define MCG_C11_PLLREFSEL1_SHIFT                 (7U)                                                /*!< MCG_C11.PLLREFSEL1 Position             */
#define MCG_C11_PLLREFSEL1(x)                    (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< MCG_C11.PLLREFSEL1 Field                */
/* ------- C12 Bit Fields                           ------ */
#define MCG_C12_VDIV1_MASK                       (0x1FU)                                             /*!< MCG_C12.VDIV1 Mask                      */
#define MCG_C12_VDIV1_SHIFT                      (0U)                                                /*!< MCG_C12.VDIV1 Position                  */
#define MCG_C12_VDIV1(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1FUL)            /*!< MCG_C12.VDIV1 Field                     */
#define MCG_C12_CME2_MASK                        (0x20U)                                             /*!< MCG_C12.CME2 Mask                       */
#define MCG_C12_CME2_SHIFT                       (5U)                                                /*!< MCG_C12.CME2 Position                   */
#define MCG_C12_CME2(x)                          (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< MCG_C12.CME2 Field                      */
#define MCG_C12_LOLIE1_MASK                      (0x80U)                                             /*!< MCG_C12.LOLIE1 Mask                     */
#define MCG_C12_LOLIE1_SHIFT                     (7U)                                                /*!< MCG_C12.LOLIE1 Position                 */
#define MCG_C12_LOLIE1(x)                        (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< MCG_C12.LOLIE1 Field                    */
/* ------- S2 Bit Fields                            ------ */
#define MCG_S2_LOCS2_MASK                        (0x1U)                                              /*!< MCG_S2.LOCS2 Mask                       */
#define MCG_S2_LOCS2_SHIFT                       (0U)                                                /*!< MCG_S2.LOCS2 Position                   */
#define MCG_S2_LOCS2(x)                          (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< MCG_S2.LOCS2 Field                      */
#define MCG_S2_OSCINIT1_MASK                     (0x2U)                                              /*!< MCG_S2.OSCINIT1 Mask                    */
#define MCG_S2_OSCINIT1_SHIFT                    (1U)                                                /*!< MCG_S2.OSCINIT1 Position                */
#define MCG_S2_OSCINIT1(x)                       (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< MCG_S2.OSCINIT1 Field                   */
#define MCG_S2_PLLCST_MASK                       (0x10U)                                             /*!< MCG_S2.PLLCST Mask                      */
#define MCG_S2_PLLCST_SHIFT                      (4U)                                                /*!< MCG_S2.PLLCST Position                  */
#define MCG_S2_PLLCST(x)                         (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< MCG_S2.PLLCST Field                     */
#define MCG_S2_LOCK1_MASK                        (0x40U)                                             /*!< MCG_S2.LOCK1 Mask                       */
#define MCG_S2_LOCK1_SHIFT                       (6U)                                                /*!< MCG_S2.LOCK1 Position                   */
#define MCG_S2_LOCK1(x)                          (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< MCG_S2.LOCK1 Field                      */
#define MCG_S2_LOLS1_MASK                        (0x80U)                                             /*!< MCG_S2.LOLS1 Mask                       */
#define MCG_S2_LOLS1_SHIFT                       (7U)                                                /*!< MCG_S2.LOLS1 Position                   */
#define MCG_S2_LOLS1(x)                          (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< MCG_S2.LOLS1 Field                      */
/**
 * @} */ /* End group MCG_Register_Masks_GROUP 
 */

/* MCG - Peripheral instance base addresses */
#define MCG_BasePtr                    0x40064000UL //!< Peripheral base address
#define MCG                            ((MCG_Type *) MCG_BasePtr) //!< Freescale base pointer
#define MCG_BASE_PTR                   (MCG) //!< Freescale style base pointer
/**
 * @} */ /* End group MCG_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup MCM_Peripheral_access_layer_GROUP MCM Peripheral Access Layer
* @brief C Struct for MCM
* @{
*/

/* ================================================================================ */
/* ================           MCM (file:MCM_MK61F15)               ================ */
/* ================================================================================ */

/**
 * @brief Core Platform Miscellaneous Control Module
 */
/**
* @addtogroup MCM_structs_GROUP MCM struct
* @brief Struct for MCM
* @{
*/
typedef struct MCM_Type {
        uint8_t   RESERVED_0[8];                /**< 0000: 0x8 bytes                                                    */
   __I  uint16_t  PLASC;                        /**< 0008: Crossbar Switch (AXBS) Slave Configuration                   */
   __I  uint16_t  PLAMC;                        /**< 000A: Crossbar Switch (AXBS) Master Configuration                  */
   __IO uint32_t  CR;                           /**< 000C: Control Register                                             */
   __IO uint32_t  ISCR;                         /**< 0010: Interrupt Status and Control Register                        */
   __IO uint32_t  ETBCC;                        /**< 0014: ETB Counter Control register                                 */
   __IO uint32_t  ETBRL;                        /**< 0018: ETB Reload register                                          */
   __I  uint32_t  ETBCNT;                       /**< 001C: ETB Counter Value register                                   */
   __I  uint32_t  FADR;                         /**< 0020: Fault address register                                       */
   __I  uint32_t  FATR;                         /**< 0024: Fault attributes register                                    */
   __I  uint32_t  FDR;                          /**< 0028: Fault data register                                          */
        uint8_t   RESERVED_1[4];                /**< 002C: 0x4 bytes                                                    */
   __IO uint32_t  PID;                          /**< 0030: Process ID register                                          */
} MCM_Type;

/**
 * @} */ /* End group MCM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'MCM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

