podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
* @addtogroup MCM_Register_Masks_GROUP MCM Register Masks
* @brief Register Masks for MCM
* @{
*/
/* ------- PLASC Bit Fields                         ------ */
#define MCM_PLASC_ASC_MASK                       (0xFFU)                                             /*!< MCM_PLASC.ASC Mask                      */
#define MCM_PLASC_ASC_SHIFT                      (0U)                                                /*!< MCM_PLASC.ASC Position                  */
#define MCM_PLASC_ASC(x)                         (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< MCM_PLASC.ASC Field                     */
/* ------- PLAMC Bit Fields                         ------ */
#define MCM_PLAMC_AMC_MASK                       (0xFFU)                                             /*!< MCM_PLAMC.AMC Mask                      */
#define MCM_PLAMC_AMC_SHIFT                      (0U)                                                /*!< MCM_PLAMC.AMC Position                  */
#define MCM_PLAMC_AMC(x)                         (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< MCM_PLAMC.AMC Field                     */
/* ------- CR Bit Fields                            ------ */
#define MCM_CR_DDRSIZE_MASK                      (0x300000U)                                         /*!< MCM_CR.DDRSIZE Mask                     */
#define MCM_CR_DDRSIZE_SHIFT                     (20U)                                               /*!< MCM_CR.DDRSIZE Position                 */
#define MCM_CR_DDRSIZE(x)                        (((uint32_t)(((uint32_t)(x))<<20U))&0x300000UL)     /*!< MCM_CR.DDRSIZE Field                    */
#define MCM_CR_SRAMUAP_MASK                      (0x3000000U)                                        /*!< MCM_CR.SRAMUAP Mask                     */
#define MCM_CR_SRAMUAP_SHIFT                     (24U)                                               /*!< MCM_CR.SRAMUAP Position                 */
#define MCM_CR_SRAMUAP(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< MCM_CR.SRAMUAP Field                    */
#define MCM_CR_SRAMUWP_MASK                      (0x4000000U)                                        /*!< MCM_CR.SRAMUWP Mask                     */
#define MCM_CR_SRAMUWP_SHIFT                     (26U)                                               /*!< MCM_CR.SRAMUWP Position                 */
#define MCM_CR_SRAMUWP(x)                        (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< MCM_CR.SRAMUWP Field                    */
#define MCM_CR_SRAMLAP_MASK                      (0x30000000U)                                       /*!< MCM_CR.SRAMLAP Mask                     */
#define MCM_CR_SRAMLAP_SHIFT                     (28U)                                               /*!< MCM_CR.SRAMLAP Position                 */
#define MCM_CR_SRAMLAP(x)                        (((uint32_t)(((uint32_t)(x))<<28U))&0x30000000UL)   /*!< MCM_CR.SRAMLAP Field                    */
#define MCM_CR_SRAMLWP_MASK                      (0x40000000U)                                       /*!< MCM_CR.SRAMLWP Mask                     */
#define MCM_CR_SRAMLWP_SHIFT                     (30U)                                               /*!< MCM_CR.SRAMLWP Position                 */
#define MCM_CR_SRAMLWP(x)                        (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< MCM_CR.SRAMLWP Field                    */
/* ------- ISCR Bit Fields                          ------ */
#define MCM_ISCR_IRQ_MASK                        (0x2U)                                              /*!< MCM_ISCR.IRQ Mask                       */
#define MCM_ISCR_IRQ_SHIFT                       (1U)                                                /*!< MCM_ISCR.IRQ Position                   */
#define MCM_ISCR_IRQ(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< MCM_ISCR.IRQ Field                      */
#define MCM_ISCR_NMI_MASK                        (0x4U)                                              /*!< MCM_ISCR.NMI Mask                       */
#define MCM_ISCR_NMI_SHIFT                       (2U)                                                /*!< MCM_ISCR.NMI Position                   */
#define MCM_ISCR_NMI(x)                          (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< MCM_ISCR.NMI Field                      */
#define MCM_ISCR_DHREQ_MASK                      (0x8U)                                              /*!< MCM_ISCR.DHREQ Mask                     */
#define MCM_ISCR_DHREQ_SHIFT                     (3U)                                                /*!< MCM_ISCR.DHREQ Position                 */
#define MCM_ISCR_DHREQ(x)                        (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< MCM_ISCR.DHREQ Field                    */
#define MCM_ISCR_CWBER_MASK                      (0x10U)                                             /*!< MCM_ISCR.CWBER Mask                     */
#define MCM_ISCR_CWBER_SHIFT                     (4U)                                                /*!< MCM_ISCR.CWBER Position                 */
#define MCM_ISCR_CWBER(x)                        (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< MCM_ISCR.CWBER Field                    */
#define MCM_ISCR_FIOC_MASK                       (0x100U)                                            /*!< MCM_ISCR.FIOC Mask                      */
#define MCM_ISCR_FIOC_SHIFT                      (8U)                                                /*!< MCM_ISCR.FIOC Position                  */
#define MCM_ISCR_FIOC(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< MCM_ISCR.FIOC Field                     */
#define MCM_ISCR_FDZC_MASK                       (0x200U)                                            /*!< MCM_ISCR.FDZC Mask                      */
#define MCM_ISCR_FDZC_SHIFT                      (9U)                                                /*!< MCM_ISCR.FDZC Position                  */
#define MCM_ISCR_FDZC(x)                         (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< MCM_ISCR.FDZC Field                     */
#define MCM_ISCR_FOFC_MASK                       (0x400U)                                            /*!< MCM_ISCR.FOFC Mask                      */
#define MCM_ISCR_FOFC_SHIFT                      (10U)                                               /*!< MCM_ISCR.FOFC Position                  */
#define MCM_ISCR_FOFC(x)                         (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< MCM_ISCR.FOFC Field                     */
#define MCM_ISCR_FUFC_MASK                       (0x800U)                                            /*!< MCM_ISCR.FUFC Mask                      */
#define MCM_ISCR_FUFC_SHIFT                      (11U)                                               /*!< MCM_ISCR.FUFC Position                  */
#define MCM_ISCR_FUFC(x)                         (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< MCM_ISCR.FUFC Field                     */
#define MCM_ISCR_FIXC_MASK                       (0x1000U)                                           /*!< MCM_ISCR.FIXC Mask                      */
#define MCM_ISCR_FIXC_SHIFT                      (12U)                                               /*!< MCM_ISCR.FIXC Position                  */
#define MCM_ISCR_FIXC(x)                         (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< MCM_ISCR.FIXC Field                     */
#define MCM_ISCR_FIDC_MASK                       (0x8000U)                                           /*!< MCM_ISCR.FIDC Mask                      */
#define MCM_ISCR_FIDC_SHIFT                      (15U)                                               /*!< MCM_ISCR.FIDC Position                  */
#define MCM_ISCR_FIDC(x)                         (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< MCM_ISCR.FIDC Field                     */
#define MCM_ISCR_CWBEE_MASK                      (0x100000U)                                         /*!< MCM_ISCR.CWBEE Mask                     */
#define MCM_ISCR_CWBEE_SHIFT                     (20U)                                               /*!< MCM_ISCR.CWBEE Position                 */
#define MCM_ISCR_CWBEE(x)                        (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< MCM_ISCR.CWBEE Field                    */
#define MCM_ISCR_FIOCE_MASK                      (0x1000000U)                                        /*!< MCM_ISCR.FIOCE Mask                     */
#define MCM_ISCR_FIOCE_SHIFT                     (24U)                                               /*!< MCM_ISCR.FIOCE Position                 */
#define MCM_ISCR_FIOCE(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< MCM_ISCR.FIOCE Field                    */
#define MCM_ISCR_FDZCE_MASK                      (0x2000000U)                                        /*!< MCM_ISCR.FDZCE Mask                     */
#define MCM_ISCR_FDZCE_SHIFT                     (25U)                                               /*!< MCM_ISCR.FDZCE Position                 */
#define MCM_ISCR_FDZCE(x)                        (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< MCM_ISCR.FDZCE Field                    */
#define MCM_ISCR_FOFCE_MASK                      (0x4000000U)                                        /*!< MCM_ISCR.FOFCE Mask                     */
#define MCM_ISCR_FOFCE_SHIFT                     (26U)                                               /*!< MCM_ISCR.FOFCE Position                 */
#define MCM_ISCR_FOFCE(x)                        (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< MCM_ISCR.FOFCE Field                    */
#define MCM_ISCR_FUFCE_MASK                      (0x8000000U)                                        /*!< MCM_ISCR.FUFCE Mask                     */
#define MCM_ISCR_FUFCE_SHIFT                     (27U)                                               /*!< MCM_ISCR.FUFCE Position                 */
#define MCM_ISCR_FUFCE(x)                        (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< MCM_ISCR.FUFCE Field                    */
#define MCM_ISCR_FIXCE_MASK                      (0x10000000U)                                       /*!< MCM_ISCR.FIXCE Mask                     */
#define MCM_ISCR_FIXCE_SHIFT                     (28U)                                               /*!< MCM_ISCR.FIXCE Position                 */
#define MCM_ISCR_FIXCE(x)                        (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< MCM_ISCR.FIXCE Field                    */
#define MCM_ISCR_FIDCE_MASK                      (0x80000000U)                                       /*!< MCM_ISCR.FIDCE Mask                     */
#define MCM_ISCR_FIDCE_SHIFT                     (31U)                                               /*!< MCM_ISCR.FIDCE Position                 */
#define MCM_ISCR_FIDCE(x)                        (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< MCM_ISCR.FIDCE Field                    */
/* ------- ETBCC Bit Fields                         ------ */
#define MCM_ETBCC_CNTEN_MASK                     (0x1U)                                              /*!< MCM_ETBCC.CNTEN Mask                    */
#define MCM_ETBCC_CNTEN_SHIFT                    (0U)                                                /*!< MCM_ETBCC.CNTEN Position                */
#define MCM_ETBCC_CNTEN(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< MCM_ETBCC.CNTEN Field                   */
#define MCM_ETBCC_RSPT_MASK                      (0x6U)                                              /*!< MCM_ETBCC.RSPT Mask                     */
#define MCM_ETBCC_RSPT_SHIFT                     (1U)                                                /*!< MCM_ETBCC.RSPT Position                 */
#define MCM_ETBCC_RSPT(x)                        (((uint32_t)(((uint32_t)(x))<<1U))&0x6UL)           /*!< MCM_ETBCC.RSPT Field                    */
#define MCM_ETBCC_RLRQ_MASK                      (0x8U)                                              /*!< MCM_ETBCC.RLRQ Mask                     */
#define MCM_ETBCC_RLRQ_SHIFT                     (3U)                                                /*!< MCM_ETBCC.RLRQ Position                 */
#define MCM_ETBCC_RLRQ(x)                        (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< MCM_ETBCC.RLRQ Field                    */
#define MCM_ETBCC_ETDIS_MASK                     (0x10U)                                             /*!< MCM_ETBCC.ETDIS Mask                    */
#define MCM_ETBCC_ETDIS_SHIFT                    (4U)                                                /*!< MCM_ETBCC.ETDIS Position                */
#define MCM_ETBCC_ETDIS(x)                       (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< MCM_ETBCC.ETDIS Field                   */
#define MCM_ETBCC_ITDIS_MASK                     (0x20U)                                             /*!< MCM_ETBCC.ITDIS Mask                    */
#define MCM_ETBCC_ITDIS_SHIFT                    (5U)                                                /*!< MCM_ETBCC.ITDIS Position                */
#define MCM_ETBCC_ITDIS(x)                       (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< MCM_ETBCC.ITDIS Field                   */
/* ------- ETBRL Bit Fields                         ------ */
#define MCM_ETBRL_RELOAD_MASK                    (0x7FFU)                                            /*!< MCM_ETBRL.RELOAD Mask                   */
#define MCM_ETBRL_RELOAD_SHIFT                   (0U)                                                /*!< MCM_ETBRL.RELOAD Position               */
#define MCM_ETBRL_RELOAD(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x7FFUL)         /*!< MCM_ETBRL.RELOAD Field                  */
/* ------- ETBCNT Bit Fields                        ------ */
#define MCM_ETBCNT_COUNTER_MASK                  (0x7FFU)                                            /*!< MCM_ETBCNT.COUNTER Mask                 */
#define MCM_ETBCNT_COUNTER_SHIFT                 (0U)                                                /*!< MCM_ETBCNT.COUNTER Position             */
#define MCM_ETBCNT_COUNTER(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x7FFUL)         /*!< MCM_ETBCNT.COUNTER Field                */
/* ------- FADR Bit Fields                          ------ */
#define MCM_FADR_ADDRESS_MASK                    (0xFFFFFFFFU)                                       /*!< MCM_FADR.ADDRESS Mask                   */
#define MCM_FADR_ADDRESS_SHIFT                   (0U)                                                /*!< MCM_FADR.ADDRESS Position               */
#define MCM_FADR_ADDRESS(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< MCM_FADR.ADDRESS Field                  */
/* ------- FATR Bit Fields                          ------ */
#define MCM_FATR_BEDA_MASK                       (0x1U)                                              /*!< MCM_FATR.BEDA Mask                      */
#define MCM_FATR_BEDA_SHIFT                      (0U)                                                /*!< MCM_FATR.BEDA Position                  */
#define MCM_FATR_BEDA(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< MCM_FATR.BEDA Field                     */
#define MCM_FATR_BEMD_MASK                       (0x2U)                                              /*!< MCM_FATR.BEMD Mask                      */
#define MCM_FATR_BEMD_SHIFT                      (1U)                                                /*!< MCM_FATR.BEMD Position                  */
#define MCM_FATR_BEMD(x)                         (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< MCM_FATR.BEMD Field                     */
#define MCM_FATR_BESZ_MASK                       (0x30U)                                             /*!< MCM_FATR.BESZ Mask                      */
#define MCM_FATR_BESZ_SHIFT                      (4U)                                                /*!< MCM_FATR.BESZ Position                  */
#define MCM_FATR_BESZ(x)                         (((uint32_t)(((uint32_t)(x))<<4U))&0x30UL)          /*!< MCM_FATR.BESZ Field                     */
#define MCM_FATR_BEWT_MASK                       (0x80U)                                             /*!< MCM_FATR.BEWT Mask                      */
#define MCM_FATR_BEWT_SHIFT                      (7U)                                                /*!< MCM_FATR.BEWT Position                  */
#define MCM_FATR_BEWT(x)                         (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< MCM_FATR.BEWT Field                     */
#define MCM_FATR_BEMN_MASK                       (0xF00U)                                            /*!< MCM_FATR.BEMN Mask                      */
#define MCM_FATR_BEMN_SHIFT                      (8U)                                                /*!< MCM_FATR.BEMN Position                  */
#define MCM_FATR_BEMN(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< MCM_FATR.BEMN Field                     */
#define MCM_FATR_BEOVR_MASK                      (0x80000000U)                                       /*!< MCM_FATR.BEOVR Mask                     */
#define MCM_FATR_BEOVR_SHIFT                     (31U)                                               /*!< MCM_FATR.BEOVR Position                 */
#define MCM_FATR_BEOVR(x)                        (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< MCM_FATR.BEOVR Field                    */
/* ------- FDR Bit Fields                           ------ */
#define MCM_FDR_DATA_MASK                        (0xFFFFFFFFU)                                       /*!< MCM_FDR.DATA Mask                       */
#define MCM_FDR_DATA_SHIFT                       (0U)                                                /*!< MCM_FDR.DATA Position                   */
#define MCM_FDR_DATA(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< MCM_FDR.DATA Field                      */
/* ------- PID Bit Fields                           ------ */
#define MCM_PID_PID_MASK                         (0xFFU)                                             /*!< MCM_PID.PID Mask                        */
#define MCM_PID_PID_SHIFT                        (0U)                                                /*!< MCM_PID.PID Position                    */
#define MCM_PID_PID(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< MCM_PID.PID Field                       */
/**
 * @} */ /* End group MCM_Register_Masks_GROUP 
 */

/* MCM - Peripheral instance base addresses */
#define MCM_BasePtr                    0xE0080000UL //!< Peripheral base address
#define MCM                            ((MCM_Type *) MCM_BasePtr) //!< Freescale base pointer
#define MCM_BASE_PTR                   (MCM) //!< Freescale style base pointer
/**
 * @} */ /* End group MCM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup MPU_Peripheral_access_layer_GROUP MPU Peripheral Access Layer
* @brief C Struct for MPU
* @{
*/

/* ================================================================================ */
/* ================           MPU (file:MPU_MK10F12_16R)           ================ */
/* ================================================================================ */

/**
 * @brief Memory protection unit
 */
/**
* @addtogroup MPU_structs_GROUP MPU struct
* @brief Struct for MPU
* @{
*/
typedef struct MPU_Type {
   __IO uint32_t  CESR;                         /**< 0000: Control/Error Status Register                                */
        uint8_t   RESERVED_0[12];               /**< 0004: 0xC bytes                                                    */
   struct {
      __I  uint32_t  EAR;                       /**< 0010: Error Address Register, slave port n                         */
      __I  uint32_t  EDR;                       /**< 0014: Error Detail Register, slave port n                          */
   } SP[5];                                     /**< 0010: (cluster: size=0x0028, 40)                                   */
        uint8_t   RESERVED_2[968];              /**< 0038: 0x3C8 bytes                                                  */
   struct {
      __IO uint32_t  WORD0;                     /**< 0400: Region Descriptor n, Word 0                                  */
      __IO uint32_t  WORD1;                     /**< 0404: Region Descriptor n, Word 1                                  */
      __IO uint32_t  WORD2;                     /**< 0408: Region Descriptor n, Word 2                                  */
      __IO uint32_t  WORD3;                     /**< 040C: Region Descriptor n, Word 3                                  */
   } RGD[16];                                   /**< 0400: (cluster: size=0x0100, 256)                                  */
        uint8_t   RESERVED_4[768];              /**< 0500: 0x300 bytes                                                  */
   __IO uint32_t  RGDAAC[16];                   /**< 0800: Region Descriptor Alternate Access Control n                 */
} MPU_Type;

/**
 * @} */ /* End group MPU_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'MPU' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

