podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define MPU_RGDAAC_M6WE_SHIFT                    (28U)                                               /*!< MPU_RGDAAC.M6WE Position                */
#define MPU_RGDAAC_M6WE(x)                       (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< MPU_RGDAAC.M6WE Field                   */
#define MPU_RGDAAC_M6RE_MASK                     (0x20000000U)                                       /*!< MPU_RGDAAC.M6RE Mask                    */
#define MPU_RGDAAC_M6RE_SHIFT                    (29U)                                               /*!< MPU_RGDAAC.M6RE Position                */
#define MPU_RGDAAC_M6RE(x)                       (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< MPU_RGDAAC.M6RE Field                   */
#define MPU_RGDAAC_M7WE_MASK                     (0x40000000U)                                       /*!< MPU_RGDAAC.M7WE Mask                    */
#define MPU_RGDAAC_M7WE_SHIFT                    (30U)                                               /*!< MPU_RGDAAC.M7WE Position                */
#define MPU_RGDAAC_M7WE(x)                       (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< MPU_RGDAAC.M7WE Field                   */
#define MPU_RGDAAC_M7RE_MASK                     (0x80000000U)                                       /*!< MPU_RGDAAC.M7RE Mask                    */
#define MPU_RGDAAC_M7RE_SHIFT                    (31U)                                               /*!< MPU_RGDAAC.M7RE Position                */
#define MPU_RGDAAC_M7RE(x)                       (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< MPU_RGDAAC.M7RE Field                   */
/**
 * @} */ /* End group MPU_Register_Masks_GROUP 
 */

/* MPU - Peripheral instance base addresses */
#define MPU_BasePtr                    0x4000D000UL //!< Peripheral base address
#define MPU                            ((MPU_Type *) MPU_BasePtr) //!< Freescale base pointer
#define MPU_BASE_PTR                   (MPU) //!< Freescale style base pointer
/**
 * @} */ /* End group MPU_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup NFC_Peripheral_access_layer_GROUP NFC Peripheral Access Layer
* @brief C Struct for NFC
* @{
*/

/* ================================================================================ */
/* ================           NFC (file:NFC_0)                     ================ */
/* ================================================================================ */

/**
 * @brief NAND flash controller
 */
/**
* @addtogroup NFC_structs_GROUP NFC struct
* @brief Struct for NFC
* @{
*/
typedef struct NFC_Type {
        uint8_t   RESERVED_0[16128];            /**< 0000: 0x3F00 bytes                                                 */
   __IO uint32_t  CMD1;                         /**< 3F00: Flash command 1                                              */
   __IO uint32_t  CMD2;                         /**< 3F04: Flash command 2                                              */
   __IO uint32_t  CAR;                          /**< 3F08: Column address                                               */
   __IO uint32_t  RAR;                          /**< 3F0C: Row address                                                  */
   __IO uint32_t  RPT;                          /**< 3F10: Flash command repeat                                         */
   __IO uint32_t  RAI;                          /**< 3F14: Row address increment                                        */
   __I  uint32_t  SR1;                          /**< 3F18: Flash status 1                                               */
   __I  uint32_t  SR2;                          /**< 3F1C: Flash status 2                                               */
   __IO uint32_t  DMA1;                         /**< 3F20: DMA channel 1 address                                        */
   __IO uint32_t  DMACFG;                       /**< 3F24: DMA configuration                                            */
   __IO uint32_t  SWAP;                         /**< 3F28: Cach swap                                                    */
   __IO uint32_t  SECSZ;                        /**< 3F2C: Sector size                                                  */
   __IO uint32_t  CFG;                          /**< 3F30: Flash configuration                                          */
   __IO uint32_t  DMA2;                         /**< 3F34: DMA channel 2 address                                        */
   __IO uint32_t  ISR;                          /**< 3F38: Interrupt status                                             */
} NFC_Type;

/**
 * @} */ /* End group NFC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'NFC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup NFC_Register_Masks_GROUP NFC Register Masks
* @brief Register Masks for NFC
* @{
*/
/* ------- CMD1 Bit Fields                          ------ */
#define NFC_CMD1_BYTE3_MASK                      (0xFF0000U)                                         /*!< NFC_CMD1.BYTE3 Mask                     */
#define NFC_CMD1_BYTE3_SHIFT                     (16U)                                               /*!< NFC_CMD1.BYTE3 Position                 */
#define NFC_CMD1_BYTE3(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< NFC_CMD1.BYTE3 Field                    */
#define NFC_CMD1_BYTE2_MASK                      (0xFF000000U)                                       /*!< NFC_CMD1.BYTE2 Mask                     */
#define NFC_CMD1_BYTE2_SHIFT                     (24U)                                               /*!< NFC_CMD1.BYTE2 Position                 */
#define NFC_CMD1_BYTE2(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< NFC_CMD1.BYTE2 Field                    */
/* ------- CMD2 Bit Fields                          ------ */
#define NFC_CMD2_BUSY_START_MASK                 (0x1U)                                              /*!< NFC_CMD2.BUSY_START Mask                */
#define NFC_CMD2_BUSY_START_SHIFT                (0U)                                                /*!< NFC_CMD2.BUSY_START Position            */
#define NFC_CMD2_BUSY_START(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< NFC_CMD2.BUSY_START Field               */
#define NFC_CMD2_BUFNO_MASK                      (0x6U)                                              /*!< NFC_CMD2.BUFNO Mask                     */
#define NFC_CMD2_BUFNO_SHIFT                     (1U)                                                /*!< NFC_CMD2.BUFNO Position                 */
#define NFC_CMD2_BUFNO(x)                        (((uint32_t)(((uint32_t)(x))<<1U))&0x6UL)           /*!< NFC_CMD2.BUFNO Field                    */
#define NFC_CMD2_CODE_MASK                       (0xFFFF00U)                                         /*!< NFC_CMD2.CODE Mask                      */
#define NFC_CMD2_CODE_SHIFT                      (8U)                                                /*!< NFC_CMD2.CODE Position                  */
#define NFC_CMD2_CODE(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0xFFFF00UL)      /*!< NFC_CMD2.CODE Field                     */
#define NFC_CMD2_BYTE1_MASK                      (0xFF000000U)                                       /*!< NFC_CMD2.BYTE1 Mask                     */
#define NFC_CMD2_BYTE1_SHIFT                     (24U)                                               /*!< NFC_CMD2.BYTE1 Position                 */
#define NFC_CMD2_BYTE1(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< NFC_CMD2.BYTE1 Field                    */
/* ------- CAR Bit Fields                           ------ */
#define NFC_CAR_BYTE1_MASK                       (0xFFU)                                             /*!< NFC_CAR.BYTE1 Mask                      */
#define NFC_CAR_BYTE1_SHIFT                      (0U)                                                /*!< NFC_CAR.BYTE1 Position                  */
#define NFC_CAR_BYTE1(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< NFC_CAR.BYTE1 Field                     */
#define NFC_CAR_BYTE2_MASK                       (0xFF00U)                                           /*!< NFC_CAR.BYTE2 Mask                      */
#define NFC_CAR_BYTE2_SHIFT                      (8U)                                                /*!< NFC_CAR.BYTE2 Position                  */
#define NFC_CAR_BYTE2(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< NFC_CAR.BYTE2 Field                     */
/* ------- RAR Bit Fields                           ------ */
#define NFC_RAR_BYTE1_MASK                       (0xFFU)                                             /*!< NFC_RAR.BYTE1 Mask                      */
#define NFC_RAR_BYTE1_SHIFT                      (0U)                                                /*!< NFC_RAR.BYTE1 Position                  */
#define NFC_RAR_BYTE1(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< NFC_RAR.BYTE1 Field                     */
#define NFC_RAR_BYTE2_MASK                       (0xFF00U)                                           /*!< NFC_RAR.BYTE2 Mask                      */
#define NFC_RAR_BYTE2_SHIFT                      (8U)                                                /*!< NFC_RAR.BYTE2 Position                  */
#define NFC_RAR_BYTE2(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< NFC_RAR.BYTE2 Field                     */
#define NFC_RAR_BYTE3_MASK                       (0xFF0000U)                                         /*!< NFC_RAR.BYTE3 Mask                      */
#define NFC_RAR_BYTE3_SHIFT                      (16U)                                               /*!< NFC_RAR.BYTE3 Position                  */
#define NFC_RAR_BYTE3(x)                         (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< NFC_RAR.BYTE3 Field                     */
#define NFC_RAR_RB0_MASK                         (0x1000000U)                                        /*!< NFC_RAR.RB0 Mask                        */
#define NFC_RAR_RB0_SHIFT                        (24U)                                               /*!< NFC_RAR.RB0 Position                    */
#define NFC_RAR_RB0(x)                           (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< NFC_RAR.RB0 Field                       */
#define NFC_RAR_RB1_MASK                         (0x2000000U)                                        /*!< NFC_RAR.RB1 Mask                        */
#define NFC_RAR_RB1_SHIFT                        (25U)                                               /*!< NFC_RAR.RB1 Position                    */
#define NFC_RAR_RB1(x)                           (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< NFC_RAR.RB1 Field                       */
#define NFC_RAR_CS0_MASK                         (0x10000000U)                                       /*!< NFC_RAR.CS0 Mask                        */
#define NFC_RAR_CS0_SHIFT                        (28U)                                               /*!< NFC_RAR.CS0 Position                    */
#define NFC_RAR_CS0(x)                           (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< NFC_RAR.CS0 Field                       */
#define NFC_RAR_CS1_MASK                         (0x20000000U)                                       /*!< NFC_RAR.CS1 Mask                        */
#define NFC_RAR_CS1_SHIFT                        (29U)                                               /*!< NFC_RAR.CS1 Position                    */
#define NFC_RAR_CS1(x)                           (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< NFC_RAR.CS1 Field                       */
/* ------- RPT Bit Fields                           ------ */
#define NFC_RPT_COUNT_MASK                       (0xFFFFU)                                           /*!< NFC_RPT.COUNT Mask                      */
#define NFC_RPT_COUNT_SHIFT                      (0U)                                                /*!< NFC_RPT.COUNT Position                  */
#define NFC_RPT_COUNT(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< NFC_RPT.COUNT Field                     */
/* ------- RAI Bit Fields                           ------ */
#define NFC_RAI_INC1_MASK                        (0xFFU)                                             /*!< NFC_RAI.INC1 Mask                       */
#define NFC_RAI_INC1_SHIFT                       (0U)                                                /*!< NFC_RAI.INC1 Position                   */
#define NFC_RAI_INC1(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< NFC_RAI.INC1 Field                      */
#define NFC_RAI_INC2_MASK                        (0xFF00U)                                           /*!< NFC_RAI.INC2 Mask                       */
#define NFC_RAI_INC2_SHIFT                       (8U)                                                /*!< NFC_RAI.INC2 Position                   */
#define NFC_RAI_INC2(x)                          (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< NFC_RAI.INC2 Field                      */
#define NFC_RAI_INC3_MASK                        (0xFF0000U)                                         /*!< NFC_RAI.INC3 Mask                       */
#define NFC_RAI_INC3_SHIFT                       (16U)                                               /*!< NFC_RAI.INC3 Position                   */
#define NFC_RAI_INC3(x)                          (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< NFC_RAI.INC3 Field                      */
/* ------- SR1 Bit Fields                           ------ */
#define NFC_SR1_ID4_MASK                         (0xFFU)                                             /*!< NFC_SR1.ID4 Mask                        */
#define NFC_SR1_ID4_SHIFT                        (0U)                                                /*!< NFC_SR1.ID4 Position                    */
#define NFC_SR1_ID4(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< NFC_SR1.ID4 Field                       */
#define NFC_SR1_ID3_MASK                         (0xFF00U)                                           /*!< NFC_SR1.ID3 Mask                        */
#define NFC_SR1_ID3_SHIFT                        (8U)                                                /*!< NFC_SR1.ID3 Position                    */
#define NFC_SR1_ID3(x)                           (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< NFC_SR1.ID3 Field                       */
#define NFC_SR1_ID2_MASK                         (0xFF0000U)                                         /*!< NFC_SR1.ID2 Mask                        */
#define NFC_SR1_ID2_SHIFT                        (16U)                                               /*!< NFC_SR1.ID2 Position                    */
#define NFC_SR1_ID2(x)                           (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< NFC_SR1.ID2 Field                       */
#define NFC_SR1_ID1_MASK                         (0xFF000000U)                                       /*!< NFC_SR1.ID1 Mask                        */
#define NFC_SR1_ID1_SHIFT                        (24U)                                               /*!< NFC_SR1.ID1 Position                    */
#define NFC_SR1_ID1(x)                           (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< NFC_SR1.ID1 Field                       */
/* ------- SR2 Bit Fields                           ------ */
#define NFC_SR2_STATUS1_MASK                     (0xFFU)                                             /*!< NFC_SR2.STATUS1 Mask                    */
#define NFC_SR2_STATUS1_SHIFT                    (0U)                                                /*!< NFC_SR2.STATUS1 Position                */
#define NFC_SR2_STATUS1(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< NFC_SR2.STATUS1 Field                   */
#define NFC_SR2_ID5_MASK                         (0xFF000000U)                                       /*!< NFC_SR2.ID5 Mask                        */
#define NFC_SR2_ID5_SHIFT                        (24U)                                               /*!< NFC_SR2.ID5 Position                    */
#define NFC_SR2_ID5(x)                           (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< NFC_SR2.ID5 Field                       */
/* ------- DMA1 Bit Fields                          ------ */
#define NFC_DMA1_ADDRESS_MASK                    (0xFFFFFFFFU)                                       /*!< NFC_DMA1.ADDRESS Mask                   */
#define NFC_DMA1_ADDRESS_SHIFT                   (0U)                                                /*!< NFC_DMA1.ADDRESS Position               */
#define NFC_DMA1_ADDRESS(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< NFC_DMA1.ADDRESS Field                  */
/* ------- DMACFG Bit Fields                        ------ */
#define NFC_DMACFG_ACT2_MASK                     (0x1U)                                              /*!< NFC_DMACFG.ACT2 Mask                    */
#define NFC_DMACFG_ACT2_SHIFT                    (0U)                                                /*!< NFC_DMACFG.ACT2 Position                */
#define NFC_DMACFG_ACT2(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< NFC_DMACFG.ACT2 Field                   */
#define NFC_DMACFG_ACT1_MASK                     (0x2U)                                              /*!< NFC_DMACFG.ACT1 Mask                    */
#define NFC_DMACFG_ACT1_SHIFT                    (1U)                                                /*!< NFC_DMACFG.ACT1 Position                */
#define NFC_DMACFG_ACT1(x)                       (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< NFC_DMACFG.ACT1 Field                   */
#define NFC_DMACFG_OFFSET2_MASK                  (0x1E00U)                                           /*!< NFC_DMACFG.OFFSET2 Mask                 */
#define NFC_DMACFG_OFFSET2_SHIFT                 (9U)                                                /*!< NFC_DMACFG.OFFSET2 Position             */
#define NFC_DMACFG_OFFSET2(x)                    (((uint32_t)(((uint32_t)(x))<<9U))&0x1E00UL)        /*!< NFC_DMACFG.OFFSET2 Field                */
#define NFC_DMACFG_COUNT2_MASK                   (0xFE000U)                                          /*!< NFC_DMACFG.COUNT2 Mask                  */
#define NFC_DMACFG_COUNT2_SHIFT                  (13U)                                               /*!< NFC_DMACFG.COUNT2 Position              */
#define NFC_DMACFG_COUNT2(x)                     (((uint32_t)(((uint32_t)(x))<<13U))&0xFE000UL)      /*!< NFC_DMACFG.COUNT2 Field                 */
#define NFC_DMACFG_COUNT1_MASK                   (0xFFF00000U)                                       /*!< NFC_DMACFG.COUNT1 Mask                  */
#define NFC_DMACFG_COUNT1_SHIFT                  (20U)                                               /*!< NFC_DMACFG.COUNT1 Position              */
#define NFC_DMACFG_COUNT1(x)                     (((uint32_t)(((uint32_t)(x))<<20U))&0xFFF00000UL)   /*!< NFC_DMACFG.COUNT1 Field                 */
/* ------- SWAP Bit Fields                          ------ */
#define NFC_SWAP_ADDR2_MASK                      (0xFFEU)                                            /*!< NFC_SWAP.ADDR2 Mask                     */
#define NFC_SWAP_ADDR2_SHIFT                     (1U)                                                /*!< NFC_SWAP.ADDR2 Position                 */
#define NFC_SWAP_ADDR2(x)                        (((uint32_t)(((uint32_t)(x))<<1U))&0xFFEUL)         /*!< NFC_SWAP.ADDR2 Field                    */
#define NFC_SWAP_ADDR1_MASK                      (0xFFE0000U)                                        /*!< NFC_SWAP.ADDR1 Mask                     */
#define NFC_SWAP_ADDR1_SHIFT                     (17U)                                               /*!< NFC_SWAP.ADDR1 Position                 */
#define NFC_SWAP_ADDR1(x)                        (((uint32_t)(((uint32_t)(x))<<17U))&0xFFE0000UL)    /*!< NFC_SWAP.ADDR1 Field                    */
/* ------- SECSZ Bit Fields                         ------ */
#define NFC_SECSZ_SIZE_MASK                      (0x1FFFU)                                           /*!< NFC_SECSZ.SIZE Mask                     */
#define NFC_SECSZ_SIZE_SHIFT                     (0U)                                                /*!< NFC_SECSZ.SIZE Position                 */
#define NFC_SECSZ_SIZE(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x1FFFUL)        /*!< NFC_SECSZ.SIZE Field                    */
/* ------- CFG Bit Fields                           ------ */
#define NFC_CFG_PAGECNT_MASK                     (0xFU)                                              /*!< NFC_CFG.PAGECNT Mask                    */
#define NFC_CFG_PAGECNT_SHIFT                    (0U)                                                /*!< NFC_CFG.PAGECNT Position                */
#define NFC_CFG_PAGECNT(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< NFC_CFG.PAGECNT Field                   */
#define NFC_CFG_AIBN_MASK                        (0x10U)                                             /*!< NFC_CFG.AIBN Mask                       */
#define NFC_CFG_AIBN_SHIFT                       (4U)                                                /*!< NFC_CFG.AIBN Position                   */
#define NFC_CFG_AIBN(x)                          (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< NFC_CFG.AIBN Field                      */
#define NFC_CFG_AIAD_MASK                        (0x20U)                                             /*!< NFC_CFG.AIAD Mask                       */
#define NFC_CFG_AIAD_SHIFT                       (5U)                                                /*!< NFC_CFG.AIAD Position                   */
#define NFC_CFG_AIAD(x)                          (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< NFC_CFG.AIAD Field                      */
#define NFC_CFG_BITWIDTH_MASK                    (0x80U)                                             /*!< NFC_CFG.BITWIDTH Mask                   */
#define NFC_CFG_BITWIDTH_SHIFT                   (7U)                                                /*!< NFC_CFG.BITWIDTH Position               */
#define NFC_CFG_BITWIDTH(x)                      (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< NFC_CFG.BITWIDTH Field                  */
#define NFC_CFG_TIMEOUT_MASK                     (0x1F00U)                                           /*!< NFC_CFG.TIMEOUT Mask                    */
#define NFC_CFG_TIMEOUT_SHIFT                    (8U)                                                /*!< NFC_CFG.TIMEOUT Position                */
#define NFC_CFG_TIMEOUT(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0x1F00UL)        /*!< NFC_CFG.TIMEOUT Field                   */
#define NFC_CFG_IDCNT_MASK                       (0xE000U)                                           /*!< NFC_CFG.IDCNT Mask                      */
#define NFC_CFG_IDCNT_SHIFT                      (13U)                                               /*!< NFC_CFG.IDCNT Position                  */
#define NFC_CFG_IDCNT(x)                         (((uint32_t)(((uint32_t)(x))<<13U))&0xE000UL)       /*!< NFC_CFG.IDCNT Field                     */
#define NFC_CFG_FAST_MASK                        (0x10000U)                                          /*!< NFC_CFG.FAST Mask                       */
#define NFC_CFG_FAST_SHIFT                       (16U)                                               /*!< NFC_CFG.FAST Position                   */
