podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define NFC_CFG_FAST(x)                          (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< NFC_CFG.FAST Field                      */
#define NFC_CFG_ECCMODE_MASK                     (0xE0000U)                                          /*!< NFC_CFG.ECCMODE Mask                    */
#define NFC_CFG_ECCMODE_SHIFT                    (17U)                                               /*!< NFC_CFG.ECCMODE Position                */
#define NFC_CFG_ECCMODE(x)                       (((uint32_t)(((uint32_t)(x))<<17U))&0xE0000UL)      /*!< NFC_CFG.ECCMODE Field                   */
#define NFC_CFG_DMAREQ_MASK                      (0x100000U)                                         /*!< NFC_CFG.DMAREQ Mask                     */
#define NFC_CFG_DMAREQ_SHIFT                     (20U)                                               /*!< NFC_CFG.DMAREQ Position                 */
#define NFC_CFG_DMAREQ(x)                        (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< NFC_CFG.DMAREQ Field                    */
#define NFC_CFG_ECCSRAM_MASK                     (0x200000U)                                         /*!< NFC_CFG.ECCSRAM Mask                    */
#define NFC_CFG_ECCSRAM_SHIFT                    (21U)                                               /*!< NFC_CFG.ECCSRAM Position                */
#define NFC_CFG_ECCSRAM(x)                       (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< NFC_CFG.ECCSRAM Field                   */
#define NFC_CFG_ECCAD_MASK                       (0x7FC00000U)                                       /*!< NFC_CFG.ECCAD Mask                      */
#define NFC_CFG_ECCAD_SHIFT                      (22U)                                               /*!< NFC_CFG.ECCAD Position                  */
#define NFC_CFG_ECCAD(x)                         (((uint32_t)(((uint32_t)(x))<<22U))&0x7FC00000UL)   /*!< NFC_CFG.ECCAD Field                     */
#define NFC_CFG_STOPWERR_MASK                    (0x80000000U)                                       /*!< NFC_CFG.STOPWERR Mask                   */
#define NFC_CFG_STOPWERR_SHIFT                   (31U)                                               /*!< NFC_CFG.STOPWERR Position               */
#define NFC_CFG_STOPWERR(x)                      (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< NFC_CFG.STOPWERR Field                  */
/* ------- DMA2 Bit Fields                          ------ */
#define NFC_DMA2_ADDRESS_MASK                    (0xFFFFFFFFU)                                       /*!< NFC_DMA2.ADDRESS Mask                   */
#define NFC_DMA2_ADDRESS_SHIFT                   (0U)                                                /*!< NFC_DMA2.ADDRESS Position               */
#define NFC_DMA2_ADDRESS(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< NFC_DMA2.ADDRESS Field                  */
/* ------- ISR Bit Fields                           ------ */
#define NFC_ISR_DMABN_MASK                       (0x3U)                                              /*!< NFC_ISR.DMABN Mask                      */
#define NFC_ISR_DMABN_SHIFT                      (0U)                                                /*!< NFC_ISR.DMABN Position                  */
#define NFC_ISR_DMABN(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< NFC_ISR.DMABN Field                     */
#define NFC_ISR_ECCBN_MASK                       (0xCU)                                              /*!< NFC_ISR.ECCBN Mask                      */
#define NFC_ISR_ECCBN_SHIFT                      (2U)                                                /*!< NFC_ISR.ECCBN Position                  */
#define NFC_ISR_ECCBN(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0xCUL)           /*!< NFC_ISR.ECCBN Field                     */
#define NFC_ISR_RESBN_MASK                       (0x30U)                                             /*!< NFC_ISR.RESBN Mask                      */
#define NFC_ISR_RESBN_SHIFT                      (4U)                                                /*!< NFC_ISR.RESBN Position                  */
#define NFC_ISR_RESBN(x)                         (((uint32_t)(((uint32_t)(x))<<4U))&0x30UL)          /*!< NFC_ISR.RESBN Field                     */
#define NFC_ISR_IDLECLR_MASK                     (0x20000U)                                          /*!< NFC_ISR.IDLECLR Mask                    */
#define NFC_ISR_IDLECLR_SHIFT                    (17U)                                               /*!< NFC_ISR.IDLECLR Position                */
#define NFC_ISR_IDLECLR(x)                       (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< NFC_ISR.IDLECLR Field                   */
#define NFC_ISR_DONECLR_MASK                     (0x40000U)                                          /*!< NFC_ISR.DONECLR Mask                    */
#define NFC_ISR_DONECLR_SHIFT                    (18U)                                               /*!< NFC_ISR.DONECLR Position                */
#define NFC_ISR_DONECLR(x)                       (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< NFC_ISR.DONECLR Field                   */
#define NFC_ISR_WERRCLR_MASK                     (0x80000U)                                          /*!< NFC_ISR.WERRCLR Mask                    */
#define NFC_ISR_WERRCLR_SHIFT                    (19U)                                               /*!< NFC_ISR.WERRCLR Position                */
#define NFC_ISR_WERRCLR(x)                       (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< NFC_ISR.WERRCLR Field                   */
#define NFC_ISR_IDLEEN_MASK                      (0x100000U)                                         /*!< NFC_ISR.IDLEEN Mask                     */
#define NFC_ISR_IDLEEN_SHIFT                     (20U)                                               /*!< NFC_ISR.IDLEEN Position                 */
#define NFC_ISR_IDLEEN(x)                        (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< NFC_ISR.IDLEEN Field                    */
#define NFC_ISR_DONEEN_MASK                      (0x200000U)                                         /*!< NFC_ISR.DONEEN Mask                     */
#define NFC_ISR_DONEEN_SHIFT                     (21U)                                               /*!< NFC_ISR.DONEEN Position                 */
#define NFC_ISR_DONEEN(x)                        (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< NFC_ISR.DONEEN Field                    */
#define NFC_ISR_WERREN_MASK                      (0x400000U)                                         /*!< NFC_ISR.WERREN Mask                     */
#define NFC_ISR_WERREN_SHIFT                     (22U)                                               /*!< NFC_ISR.WERREN Position                 */
#define NFC_ISR_WERREN(x)                        (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< NFC_ISR.WERREN Field                    */
#define NFC_ISR_DMABUSY_MASK                     (0x800000U)                                         /*!< NFC_ISR.DMABUSY Mask                    */
#define NFC_ISR_DMABUSY_SHIFT                    (23U)                                               /*!< NFC_ISR.DMABUSY Position                */
#define NFC_ISR_DMABUSY(x)                       (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< NFC_ISR.DMABUSY Field                   */
#define NFC_ISR_ECCBUSY_MASK                     (0x1000000U)                                        /*!< NFC_ISR.ECCBUSY Mask                    */
#define NFC_ISR_ECCBUSY_SHIFT                    (24U)                                               /*!< NFC_ISR.ECCBUSY Position                */
#define NFC_ISR_ECCBUSY(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< NFC_ISR.ECCBUSY Field                   */
#define NFC_ISR_RESBUSY_MASK                     (0x2000000U)                                        /*!< NFC_ISR.RESBUSY Mask                    */
#define NFC_ISR_RESBUSY_SHIFT                    (25U)                                               /*!< NFC_ISR.RESBUSY Position                */
#define NFC_ISR_RESBUSY(x)                       (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< NFC_ISR.RESBUSY Field                   */
#define NFC_ISR_CMDBUSY_MASK                     (0x4000000U)                                        /*!< NFC_ISR.CMDBUSY Mask                    */
#define NFC_ISR_CMDBUSY_SHIFT                    (26U)                                               /*!< NFC_ISR.CMDBUSY Position                */
#define NFC_ISR_CMDBUSY(x)                       (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< NFC_ISR.CMDBUSY Field                   */
#define NFC_ISR_WERRNS_MASK                      (0x8000000U)                                        /*!< NFC_ISR.WERRNS Mask                     */
#define NFC_ISR_WERRNS_SHIFT                     (27U)                                               /*!< NFC_ISR.WERRNS Position                 */
#define NFC_ISR_WERRNS(x)                        (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< NFC_ISR.WERRNS Field                    */
#define NFC_ISR_IDLE_MASK                        (0x20000000U)                                       /*!< NFC_ISR.IDLE Mask                       */
#define NFC_ISR_IDLE_SHIFT                       (29U)                                               /*!< NFC_ISR.IDLE Position                   */
#define NFC_ISR_IDLE(x)                          (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< NFC_ISR.IDLE Field                      */
#define NFC_ISR_DONE_MASK                        (0x40000000U)                                       /*!< NFC_ISR.DONE Mask                       */
#define NFC_ISR_DONE_SHIFT                       (30U)                                               /*!< NFC_ISR.DONE Position                   */
#define NFC_ISR_DONE(x)                          (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< NFC_ISR.DONE Field                      */
#define NFC_ISR_WERR_MASK                        (0x80000000U)                                       /*!< NFC_ISR.WERR Mask                       */
#define NFC_ISR_WERR_SHIFT                       (31U)                                               /*!< NFC_ISR.WERR Position                   */
#define NFC_ISR_WERR(x)                          (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< NFC_ISR.WERR Field                      */
/**
 * @} */ /* End group NFC_Register_Masks_GROUP 
 */

