podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
 * @brief Secured Digital Host Controller
 */
/**
* @addtogroup SDHC_structs_GROUP SDHC struct
* @brief Struct for SDHC
* @{
*/
typedef struct SDHC_Type {
   __IO uint32_t  DSADDR;                       /**< 0000: DMA System Address Register                                  */
   __IO uint32_t  BLKATTR;                      /**< 0004: Block Attributes Register                                    */
   __IO uint32_t  CMDARG;                       /**< 0008: Command Argument Register                                    */
   __IO uint32_t  XFERTYP;                      /**< 000C: Transfer Type Register                                       */
   __I  uint32_t  CMDRSP[4];                    /**< 0010: Command Response                                             */
   __IO uint32_t  DATPORT;                      /**< 0020: Buffer Data Port Register                                    */
   __I  uint32_t  PRSSTAT;                      /**< 0024: Present State Register                                       */
   __IO uint32_t  PROCTL;                       /**< 0028: Protocol Control Register                                    */
   __IO uint32_t  SYSCTL;                       /**< 002C: System Control Register                                      */
   __IO uint32_t  IRQSTAT;                      /**< 0030: Interrupt Status Register                                    */
   __IO uint32_t  IRQSTATEN;                    /**< 0034: Interrupt Status Enable Register                             */
   __IO uint32_t  IRQSIGEN;                     /**< 0038: Interrupt Signal Enable Register                             */
   __I  uint32_t  AC12ERR;                      /**< 003C: Auto CMD12 Error Status Register                             */
   __I  uint32_t  HTCAPBLT;                     /**< 0040: Host Controller Capabilities                                 */
   __IO uint32_t  WML;                          /**< 0044: Watermark Level Register                                     */
        uint8_t   RESERVED_0[8];                /**< 0048: 0x8 bytes                                                    */
   __O  uint32_t  FEVT;                         /**< 0050: Force Event Register                                         */
   __I  uint32_t  ADMAES;                       /**< 0054: ADMA Error Status Register                                   */
   __IO uint32_t  ADSADDR;                      /**< 0058: ADMA System Address Register                                 */
        uint8_t   RESERVED_1[100];              /**< 005C: 0x64 bytes                                                   */
   __IO uint32_t  VENDOR;                       /**< 00C0: Vendor Specific Register                                     */
   __IO uint32_t  MMCBOOT;                      /**< 00C4: MMC Boot Register                                            */
        uint8_t   RESERVED_2[52];               /**< 00C8: 0x34 bytes                                                   */
   __I  uint32_t  HOSTVER;                      /**< 00FC: Host Controller Version                                      */
} SDHC_Type;

/**
 * @} */ /* End group SDHC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SDHC0' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup SDHC_Register_Masks_GROUP SDHC Register Masks
* @brief Register Masks for SDHC
* @{
*/
/* ------- DSADDR Bit Fields                        ------ */
#define SDHC_DSADDR_DSADDR_MASK                  (0xFFFFFFFCU)                                       /*!< SDHC0_DSADDR.DSADDR Mask                */
#define SDHC_DSADDR_DSADDR_SHIFT                 (2U)                                                /*!< SDHC0_DSADDR.DSADDR Position            */
#define SDHC_DSADDR_DSADDR(x)                    (((uint32_t)(((uint32_t)(x))<<2U))&0xFFFFFFFCUL)    /*!< SDHC0_DSADDR.DSADDR Field               */
/* ------- BLKATTR Bit Fields                       ------ */
#define SDHC_BLKATTR_BLKSIZE_MASK                (0x1FFFU)                                           /*!< SDHC0_BLKATTR.BLKSIZE Mask              */
#define SDHC_BLKATTR_BLKSIZE_SHIFT               (0U)                                                /*!< SDHC0_BLKATTR.BLKSIZE Position          */
#define SDHC_BLKATTR_BLKSIZE(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0x1FFFUL)        /*!< SDHC0_BLKATTR.BLKSIZE Field             */
#define SDHC_BLKATTR_BLKCNT_MASK                 (0xFFFF0000U)                                       /*!< SDHC0_BLKATTR.BLKCNT Mask               */
#define SDHC_BLKATTR_BLKCNT_SHIFT                (16U)                                               /*!< SDHC0_BLKATTR.BLKCNT Position           */
#define SDHC_BLKATTR_BLKCNT(x)                   (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< SDHC0_BLKATTR.BLKCNT Field              */
/* ------- CMDARG Bit Fields                        ------ */
#define SDHC_CMDARG_CMDARG_MASK                  (0xFFFFFFFFU)                                       /*!< SDHC0_CMDARG.CMDARG Mask                */
#define SDHC_CMDARG_CMDARG_SHIFT                 (0U)                                                /*!< SDHC0_CMDARG.CMDARG Position            */
#define SDHC_CMDARG_CMDARG(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< SDHC0_CMDARG.CMDARG Field               */
/* ------- XFERTYP Bit Fields                       ------ */
#define SDHC_XFERTYP_DMAEN_MASK                  (0x1U)                                              /*!< SDHC0_XFERTYP.DMAEN Mask                */
#define SDHC_XFERTYP_DMAEN_SHIFT                 (0U)                                                /*!< SDHC0_XFERTYP.DMAEN Position            */
#define SDHC_XFERTYP_DMAEN(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SDHC0_XFERTYP.DMAEN Field               */
#define SDHC_XFERTYP_BCEN_MASK                   (0x2U)                                              /*!< SDHC0_XFERTYP.BCEN Mask                 */
#define SDHC_XFERTYP_BCEN_SHIFT                  (1U)                                                /*!< SDHC0_XFERTYP.BCEN Position             */
#define SDHC_XFERTYP_BCEN(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SDHC0_XFERTYP.BCEN Field                */
#define SDHC_XFERTYP_AC12EN_MASK                 (0x4U)                                              /*!< SDHC0_XFERTYP.AC12EN Mask               */
#define SDHC_XFERTYP_AC12EN_SHIFT                (2U)                                                /*!< SDHC0_XFERTYP.AC12EN Position           */
#define SDHC_XFERTYP_AC12EN(x)                   (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SDHC0_XFERTYP.AC12EN Field              */
#define SDHC_XFERTYP_DTDSEL_MASK                 (0x10U)                                             /*!< SDHC0_XFERTYP.DTDSEL Mask               */
#define SDHC_XFERTYP_DTDSEL_SHIFT                (4U)                                                /*!< SDHC0_XFERTYP.DTDSEL Position           */
#define SDHC_XFERTYP_DTDSEL(x)                   (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SDHC0_XFERTYP.DTDSEL Field              */
#define SDHC_XFERTYP_MSBSEL_MASK                 (0x20U)                                             /*!< SDHC0_XFERTYP.MSBSEL Mask               */
#define SDHC_XFERTYP_MSBSEL_SHIFT                (5U)                                                /*!< SDHC0_XFERTYP.MSBSEL Position           */
#define SDHC_XFERTYP_MSBSEL(x)                   (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SDHC0_XFERTYP.MSBSEL Field              */
#define SDHC_XFERTYP_RSPTYP_MASK                 (0x30000U)                                          /*!< SDHC0_XFERTYP.RSPTYP Mask               */
#define SDHC_XFERTYP_RSPTYP_SHIFT                (16U)                                               /*!< SDHC0_XFERTYP.RSPTYP Position           */
#define SDHC_XFERTYP_RSPTYP(x)                   (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< SDHC0_XFERTYP.RSPTYP Field              */
#define SDHC_XFERTYP_CCCEN_MASK                  (0x80000U)                                          /*!< SDHC0_XFERTYP.CCCEN Mask                */
#define SDHC_XFERTYP_CCCEN_SHIFT                 (19U)                                               /*!< SDHC0_XFERTYP.CCCEN Position            */
#define SDHC_XFERTYP_CCCEN(x)                    (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< SDHC0_XFERTYP.CCCEN Field               */
#define SDHC_XFERTYP_CICEN_MASK                  (0x100000U)                                         /*!< SDHC0_XFERTYP.CICEN Mask                */
#define SDHC_XFERTYP_CICEN_SHIFT                 (20U)                                               /*!< SDHC0_XFERTYP.CICEN Position            */
#define SDHC_XFERTYP_CICEN(x)                    (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< SDHC0_XFERTYP.CICEN Field               */
#define SDHC_XFERTYP_DPSEL_MASK                  (0x200000U)                                         /*!< SDHC0_XFERTYP.DPSEL Mask                */
#define SDHC_XFERTYP_DPSEL_SHIFT                 (21U)                                               /*!< SDHC0_XFERTYP.DPSEL Position            */
#define SDHC_XFERTYP_DPSEL(x)                    (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< SDHC0_XFERTYP.DPSEL Field               */
#define SDHC_XFERTYP_CMDTYP_MASK                 (0xC00000U)                                         /*!< SDHC0_XFERTYP.CMDTYP Mask               */
#define SDHC_XFERTYP_CMDTYP_SHIFT                (22U)                                               /*!< SDHC0_XFERTYP.CMDTYP Position           */
#define SDHC_XFERTYP_CMDTYP(x)                   (((uint32_t)(((uint32_t)(x))<<22U))&0xC00000UL)     /*!< SDHC0_XFERTYP.CMDTYP Field              */
#define SDHC_XFERTYP_CMDINX_MASK                 (0x3F000000U)                                       /*!< SDHC0_XFERTYP.CMDINX Mask               */
#define SDHC_XFERTYP_CMDINX_SHIFT                (24U)                                               /*!< SDHC0_XFERTYP.CMDINX Position           */
#define SDHC_XFERTYP_CMDINX(x)                   (((uint32_t)(((uint32_t)(x))<<24U))&0x3F000000UL)   /*!< SDHC0_XFERTYP.CMDINX Field              */
/* ------- CMDRSP Bit Fields                        ------ */
#define SDHC_CMDRSP_CMDRSP0_MASK                 (0xFFFFFFFFU)                                       /*!< SDHC0_CMDRSP.CMDRSP0 Mask               */
#define SDHC_CMDRSP_CMDRSP0_SHIFT                (0U)                                                /*!< SDHC0_CMDRSP.CMDRSP0 Position           */
#define SDHC_CMDRSP_CMDRSP0(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< SDHC0_CMDRSP.CMDRSP0 Field              */
/* ------- DATPORT Bit Fields                       ------ */
#define SDHC_DATPORT_DATCONT_MASK                (0xFFFFFFFFU)                                       /*!< SDHC0_DATPORT.DATCONT Mask              */
#define SDHC_DATPORT_DATCONT_SHIFT               (0U)                                                /*!< SDHC0_DATPORT.DATCONT Position          */
#define SDHC_DATPORT_DATCONT(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< SDHC0_DATPORT.DATCONT Field             */
/* ------- PRSSTAT Bit Fields                       ------ */
#define SDHC_PRSSTAT_CIHB_MASK                   (0x1U)                                              /*!< SDHC0_PRSSTAT.CIHB Mask                 */
#define SDHC_PRSSTAT_CIHB_SHIFT                  (0U)                                                /*!< SDHC0_PRSSTAT.CIHB Position             */
#define SDHC_PRSSTAT_CIHB(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SDHC0_PRSSTAT.CIHB Field                */
#define SDHC_PRSSTAT_CDIHB_MASK                  (0x2U)                                              /*!< SDHC0_PRSSTAT.CDIHB Mask                */
#define SDHC_PRSSTAT_CDIHB_SHIFT                 (1U)                                                /*!< SDHC0_PRSSTAT.CDIHB Position            */
#define SDHC_PRSSTAT_CDIHB(x)                    (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SDHC0_PRSSTAT.CDIHB Field               */
#define SDHC_PRSSTAT_DLA_MASK                    (0x4U)                                              /*!< SDHC0_PRSSTAT.DLA Mask                  */
#define SDHC_PRSSTAT_DLA_SHIFT                   (2U)                                                /*!< SDHC0_PRSSTAT.DLA Position              */
#define SDHC_PRSSTAT_DLA(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SDHC0_PRSSTAT.DLA Field                 */
#define SDHC_PRSSTAT_SDSTB_MASK                  (0x8U)                                              /*!< SDHC0_PRSSTAT.SDSTB Mask                */
#define SDHC_PRSSTAT_SDSTB_SHIFT                 (3U)                                                /*!< SDHC0_PRSSTAT.SDSTB Position            */
#define SDHC_PRSSTAT_SDSTB(x)                    (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SDHC0_PRSSTAT.SDSTB Field               */
#define SDHC_PRSSTAT_IPGOFF_MASK                 (0x10U)                                             /*!< SDHC0_PRSSTAT.IPGOFF Mask               */
#define SDHC_PRSSTAT_IPGOFF_SHIFT                (4U)                                                /*!< SDHC0_PRSSTAT.IPGOFF Position           */
#define SDHC_PRSSTAT_IPGOFF(x)                   (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SDHC0_PRSSTAT.IPGOFF Field              */
#define SDHC_PRSSTAT_HCKOFF_MASK                 (0x20U)                                             /*!< SDHC0_PRSSTAT.HCKOFF Mask               */
#define SDHC_PRSSTAT_HCKOFF_SHIFT                (5U)                                                /*!< SDHC0_PRSSTAT.HCKOFF Position           */
#define SDHC_PRSSTAT_HCKOFF(x)                   (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SDHC0_PRSSTAT.HCKOFF Field              */
#define SDHC_PRSSTAT_PEROFF_MASK                 (0x40U)                                             /*!< SDHC0_PRSSTAT.PEROFF Mask               */
#define SDHC_PRSSTAT_PEROFF_SHIFT                (6U)                                                /*!< SDHC0_PRSSTAT.PEROFF Position           */
#define SDHC_PRSSTAT_PEROFF(x)                   (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SDHC0_PRSSTAT.PEROFF Field              */
#define SDHC_PRSSTAT_SDOFF_MASK                  (0x80U)                                             /*!< SDHC0_PRSSTAT.SDOFF Mask                */
#define SDHC_PRSSTAT_SDOFF_SHIFT                 (7U)                                                /*!< SDHC0_PRSSTAT.SDOFF Position            */
#define SDHC_PRSSTAT_SDOFF(x)                    (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SDHC0_PRSSTAT.SDOFF Field               */
#define SDHC_PRSSTAT_WTA_MASK                    (0x100U)                                            /*!< SDHC0_PRSSTAT.WTA Mask                  */
#define SDHC_PRSSTAT_WTA_SHIFT                   (8U)                                                /*!< SDHC0_PRSSTAT.WTA Position              */
#define SDHC_PRSSTAT_WTA(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< SDHC0_PRSSTAT.WTA Field                 */
#define SDHC_PRSSTAT_RTA_MASK                    (0x200U)                                            /*!< SDHC0_PRSSTAT.RTA Mask                  */
#define SDHC_PRSSTAT_RTA_SHIFT                   (9U)                                                /*!< SDHC0_PRSSTAT.RTA Position              */
#define SDHC_PRSSTAT_RTA(x)                      (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< SDHC0_PRSSTAT.RTA Field                 */
#define SDHC_PRSSTAT_BWEN_MASK                   (0x400U)                                            /*!< SDHC0_PRSSTAT.BWEN Mask                 */
#define SDHC_PRSSTAT_BWEN_SHIFT                  (10U)                                               /*!< SDHC0_PRSSTAT.BWEN Position             */
#define SDHC_PRSSTAT_BWEN(x)                     (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< SDHC0_PRSSTAT.BWEN Field                */
#define SDHC_PRSSTAT_BREN_MASK                   (0x800U)                                            /*!< SDHC0_PRSSTAT.BREN Mask                 */
#define SDHC_PRSSTAT_BREN_SHIFT                  (11U)                                               /*!< SDHC0_PRSSTAT.BREN Position             */
#define SDHC_PRSSTAT_BREN(x)                     (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< SDHC0_PRSSTAT.BREN Field                */
#define SDHC_PRSSTAT_CINS_MASK                   (0x10000U)                                          /*!< SDHC0_PRSSTAT.CINS Mask                 */
#define SDHC_PRSSTAT_CINS_SHIFT                  (16U)                                               /*!< SDHC0_PRSSTAT.CINS Position             */
#define SDHC_PRSSTAT_CINS(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< SDHC0_PRSSTAT.CINS Field                */
#define SDHC_PRSSTAT_CLSL_MASK                   (0x800000U)                                         /*!< SDHC0_PRSSTAT.CLSL Mask                 */
#define SDHC_PRSSTAT_CLSL_SHIFT                  (23U)                                               /*!< SDHC0_PRSSTAT.CLSL Position             */
#define SDHC_PRSSTAT_CLSL(x)                     (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< SDHC0_PRSSTAT.CLSL Field                */
#define SDHC_PRSSTAT_DLSL_MASK                   (0xFF000000U)                                       /*!< SDHC0_PRSSTAT.DLSL Mask                 */
#define SDHC_PRSSTAT_DLSL_SHIFT                  (24U)                                               /*!< SDHC0_PRSSTAT.DLSL Position             */
#define SDHC_PRSSTAT_DLSL(x)                     (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< SDHC0_PRSSTAT.DLSL Field                */
/* ------- PROCTL Bit Fields                        ------ */
#define SDHC_PROCTL_LCTL_MASK                    (0x1U)                                              /*!< SDHC0_PROCTL.LCTL Mask                  */
#define SDHC_PROCTL_LCTL_SHIFT                   (0U)                                                /*!< SDHC0_PROCTL.LCTL Position              */
#define SDHC_PROCTL_LCTL(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SDHC0_PROCTL.LCTL Field                 */
#define SDHC_PROCTL_DTW_MASK                     (0x6U)                                              /*!< SDHC0_PROCTL.DTW Mask                   */
#define SDHC_PROCTL_DTW_SHIFT                    (1U)                                                /*!< SDHC0_PROCTL.DTW Position               */
#define SDHC_PROCTL_DTW(x)                       (((uint32_t)(((uint32_t)(x))<<1U))&0x6UL)           /*!< SDHC0_PROCTL.DTW Field                  */
#define SDHC_PROCTL_D3CD_MASK                    (0x8U)                                              /*!< SDHC0_PROCTL.D3CD Mask                  */
#define SDHC_PROCTL_D3CD_SHIFT                   (3U)                                                /*!< SDHC0_PROCTL.D3CD Position              */
#define SDHC_PROCTL_D3CD(x)                      (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SDHC0_PROCTL.D3CD Field                 */
#define SDHC_PROCTL_EMODE_MASK                   (0x30U)                                             /*!< SDHC0_PROCTL.EMODE Mask                 */
#define SDHC_PROCTL_EMODE_SHIFT                  (4U)                                                /*!< SDHC0_PROCTL.EMODE Position             */
#define SDHC_PROCTL_EMODE(x)                     (((uint32_t)(((uint32_t)(x))<<4U))&0x30UL)          /*!< SDHC0_PROCTL.EMODE Field                */
#define SDHC_PROCTL_CDTL_MASK                    (0x40U)                                             /*!< SDHC0_PROCTL.CDTL Mask                  */
#define SDHC_PROCTL_CDTL_SHIFT                   (6U)                                                /*!< SDHC0_PROCTL.CDTL Position              */
#define SDHC_PROCTL_CDTL(x)                      (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SDHC0_PROCTL.CDTL Field                 */
#define SDHC_PROCTL_CDSS_MASK                    (0x80U)                                             /*!< SDHC0_PROCTL.CDSS Mask                  */
#define SDHC_PROCTL_CDSS_SHIFT                   (7U)                                                /*!< SDHC0_PROCTL.CDSS Position              */
#define SDHC_PROCTL_CDSS(x)                      (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SDHC0_PROCTL.CDSS Field                 */
#define SDHC_PROCTL_DMAS_MASK                    (0x300U)                                            /*!< SDHC0_PROCTL.DMAS Mask                  */
#define SDHC_PROCTL_DMAS_SHIFT                   (8U)                                                /*!< SDHC0_PROCTL.DMAS Position              */
#define SDHC_PROCTL_DMAS(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x300UL)         /*!< SDHC0_PROCTL.DMAS Field                 */
#define SDHC_PROCTL_SABGREQ_MASK                 (0x10000U)                                          /*!< SDHC0_PROCTL.SABGREQ Mask               */
#define SDHC_PROCTL_SABGREQ_SHIFT                (16U)                                               /*!< SDHC0_PROCTL.SABGREQ Position           */
#define SDHC_PROCTL_SABGREQ(x)                   (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< SDHC0_PROCTL.SABGREQ Field              */
#define SDHC_PROCTL_CREQ_MASK                    (0x20000U)                                          /*!< SDHC0_PROCTL.CREQ Mask                  */
#define SDHC_PROCTL_CREQ_SHIFT                   (17U)                                               /*!< SDHC0_PROCTL.CREQ Position              */
#define SDHC_PROCTL_CREQ(x)                      (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< SDHC0_PROCTL.CREQ Field                 */
#define SDHC_PROCTL_RWCTL_MASK                   (0x40000U)                                          /*!< SDHC0_PROCTL.RWCTL Mask                 */
#define SDHC_PROCTL_RWCTL_SHIFT                  (18U)                                               /*!< SDHC0_PROCTL.RWCTL Position             */
#define SDHC_PROCTL_RWCTL(x)                     (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< SDHC0_PROCTL.RWCTL Field                */
#define SDHC_PROCTL_IABG_MASK                    (0x80000U)                                          /*!< SDHC0_PROCTL.IABG Mask                  */
#define SDHC_PROCTL_IABG_SHIFT                   (19U)                                               /*!< SDHC0_PROCTL.IABG Position              */
#define SDHC_PROCTL_IABG(x)                      (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< SDHC0_PROCTL.IABG Field                 */
#define SDHC_PROCTL_WECINT_MASK                  (0x1000000U)                                        /*!< SDHC0_PROCTL.WECINT Mask                */
#define SDHC_PROCTL_WECINT_SHIFT                 (24U)                                               /*!< SDHC0_PROCTL.WECINT Position            */
#define SDHC_PROCTL_WECINT(x)                    (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SDHC0_PROCTL.WECINT Field               */
#define SDHC_PROCTL_WECINS_MASK                  (0x2000000U)                                        /*!< SDHC0_PROCTL.WECINS Mask                */
