podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define SDHC_PROCTL_WECINS_SHIFT                 (25U)                                               /*!< SDHC0_PROCTL.WECINS Position            */
#define SDHC_PROCTL_WECINS(x)                    (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< SDHC0_PROCTL.WECINS Field               */
#define SDHC_PROCTL_WECRM_MASK                   (0x4000000U)                                        /*!< SDHC0_PROCTL.WECRM Mask                 */
#define SDHC_PROCTL_WECRM_SHIFT                  (26U)                                               /*!< SDHC0_PROCTL.WECRM Position             */
#define SDHC_PROCTL_WECRM(x)                     (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< SDHC0_PROCTL.WECRM Field                */
/* ------- SYSCTL Bit Fields                        ------ */
#define SDHC_SYSCTL_IPGEN_MASK                   (0x1U)                                              /*!< SDHC0_SYSCTL.IPGEN Mask                 */
#define SDHC_SYSCTL_IPGEN_SHIFT                  (0U)                                                /*!< SDHC0_SYSCTL.IPGEN Position             */
#define SDHC_SYSCTL_IPGEN(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SDHC0_SYSCTL.IPGEN Field                */
#define SDHC_SYSCTL_HCKEN_MASK                   (0x2U)                                              /*!< SDHC0_SYSCTL.HCKEN Mask                 */
#define SDHC_SYSCTL_HCKEN_SHIFT                  (1U)                                                /*!< SDHC0_SYSCTL.HCKEN Position             */
#define SDHC_SYSCTL_HCKEN(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SDHC0_SYSCTL.HCKEN Field                */
#define SDHC_SYSCTL_PEREN_MASK                   (0x4U)                                              /*!< SDHC0_SYSCTL.PEREN Mask                 */
#define SDHC_SYSCTL_PEREN_SHIFT                  (2U)                                                /*!< SDHC0_SYSCTL.PEREN Position             */
#define SDHC_SYSCTL_PEREN(x)                     (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SDHC0_SYSCTL.PEREN Field                */
#define SDHC_SYSCTL_SDCLKEN_MASK                 (0x8U)                                              /*!< SDHC0_SYSCTL.SDCLKEN Mask               */
#define SDHC_SYSCTL_SDCLKEN_SHIFT                (3U)                                                /*!< SDHC0_SYSCTL.SDCLKEN Position           */
#define SDHC_SYSCTL_SDCLKEN(x)                   (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SDHC0_SYSCTL.SDCLKEN Field              */
#define SDHC_SYSCTL_DVS_MASK                     (0xF0U)                                             /*!< SDHC0_SYSCTL.DVS Mask                   */
#define SDHC_SYSCTL_DVS_SHIFT                    (4U)                                                /*!< SDHC0_SYSCTL.DVS Position               */
#define SDHC_SYSCTL_DVS(x)                       (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< SDHC0_SYSCTL.DVS Field                  */
#define SDHC_SYSCTL_SDCLKFS_MASK                 (0xFF00U)                                           /*!< SDHC0_SYSCTL.SDCLKFS Mask               */
#define SDHC_SYSCTL_SDCLKFS_SHIFT                (8U)                                                /*!< SDHC0_SYSCTL.SDCLKFS Position           */
#define SDHC_SYSCTL_SDCLKFS(x)                   (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< SDHC0_SYSCTL.SDCLKFS Field              */
#define SDHC_SYSCTL_DTOCV_MASK                   (0xF0000U)                                          /*!< SDHC0_SYSCTL.DTOCV Mask                 */
#define SDHC_SYSCTL_DTOCV_SHIFT                  (16U)                                               /*!< SDHC0_SYSCTL.DTOCV Position             */
#define SDHC_SYSCTL_DTOCV(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< SDHC0_SYSCTL.DTOCV Field                */
#define SDHC_SYSCTL_RSTA_MASK                    (0x1000000U)                                        /*!< SDHC0_SYSCTL.RSTA Mask                  */
#define SDHC_SYSCTL_RSTA_SHIFT                   (24U)                                               /*!< SDHC0_SYSCTL.RSTA Position              */
#define SDHC_SYSCTL_RSTA(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SDHC0_SYSCTL.RSTA Field                 */
#define SDHC_SYSCTL_RSTC_MASK                    (0x2000000U)                                        /*!< SDHC0_SYSCTL.RSTC Mask                  */
#define SDHC_SYSCTL_RSTC_SHIFT                   (25U)                                               /*!< SDHC0_SYSCTL.RSTC Position              */
#define SDHC_SYSCTL_RSTC(x)                      (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< SDHC0_SYSCTL.RSTC Field                 */
#define SDHC_SYSCTL_RSTD_MASK                    (0x4000000U)                                        /*!< SDHC0_SYSCTL.RSTD Mask                  */
#define SDHC_SYSCTL_RSTD_SHIFT                   (26U)                                               /*!< SDHC0_SYSCTL.RSTD Position              */
#define SDHC_SYSCTL_RSTD(x)                      (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< SDHC0_SYSCTL.RSTD Field                 */
#define SDHC_SYSCTL_INITA_MASK                   (0x8000000U)                                        /*!< SDHC0_SYSCTL.INITA Mask                 */
#define SDHC_SYSCTL_INITA_SHIFT                  (27U)                                               /*!< SDHC0_SYSCTL.INITA Position             */
#define SDHC_SYSCTL_INITA(x)                     (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< SDHC0_SYSCTL.INITA Field                */
/* ------- IRQSTAT Bit Fields                       ------ */
#define SDHC_IRQSTAT_CC_MASK                     (0x1U)                                              /*!< SDHC0_IRQSTAT.CC Mask                   */
#define SDHC_IRQSTAT_CC_SHIFT                    (0U)                                                /*!< SDHC0_IRQSTAT.CC Position               */
#define SDHC_IRQSTAT_CC(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SDHC0_IRQSTAT.CC Field                  */
#define SDHC_IRQSTAT_TC_MASK                     (0x2U)                                              /*!< SDHC0_IRQSTAT.TC Mask                   */
#define SDHC_IRQSTAT_TC_SHIFT                    (1U)                                                /*!< SDHC0_IRQSTAT.TC Position               */
#define SDHC_IRQSTAT_TC(x)                       (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SDHC0_IRQSTAT.TC Field                  */
#define SDHC_IRQSTAT_BGE_MASK                    (0x4U)                                              /*!< SDHC0_IRQSTAT.BGE Mask                  */
#define SDHC_IRQSTAT_BGE_SHIFT                   (2U)                                                /*!< SDHC0_IRQSTAT.BGE Position              */
#define SDHC_IRQSTAT_BGE(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SDHC0_IRQSTAT.BGE Field                 */
#define SDHC_IRQSTAT_DINT_MASK                   (0x8U)                                              /*!< SDHC0_IRQSTAT.DINT Mask                 */
#define SDHC_IRQSTAT_DINT_SHIFT                  (3U)                                                /*!< SDHC0_IRQSTAT.DINT Position             */
#define SDHC_IRQSTAT_DINT(x)                     (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SDHC0_IRQSTAT.DINT Field                */
#define SDHC_IRQSTAT_BWR_MASK                    (0x10U)                                             /*!< SDHC0_IRQSTAT.BWR Mask                  */
#define SDHC_IRQSTAT_BWR_SHIFT                   (4U)                                                /*!< SDHC0_IRQSTAT.BWR Position              */
#define SDHC_IRQSTAT_BWR(x)                      (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SDHC0_IRQSTAT.BWR Field                 */
#define SDHC_IRQSTAT_BRR_MASK                    (0x20U)                                             /*!< SDHC0_IRQSTAT.BRR Mask                  */
#define SDHC_IRQSTAT_BRR_SHIFT                   (5U)                                                /*!< SDHC0_IRQSTAT.BRR Position              */
#define SDHC_IRQSTAT_BRR(x)                      (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SDHC0_IRQSTAT.BRR Field                 */
#define SDHC_IRQSTAT_CINS_MASK                   (0x40U)                                             /*!< SDHC0_IRQSTAT.CINS Mask                 */
#define SDHC_IRQSTAT_CINS_SHIFT                  (6U)                                                /*!< SDHC0_IRQSTAT.CINS Position             */
#define SDHC_IRQSTAT_CINS(x)                     (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SDHC0_IRQSTAT.CINS Field                */
#define SDHC_IRQSTAT_CRM_MASK                    (0x80U)                                             /*!< SDHC0_IRQSTAT.CRM Mask                  */
#define SDHC_IRQSTAT_CRM_SHIFT                   (7U)                                                /*!< SDHC0_IRQSTAT.CRM Position              */
#define SDHC_IRQSTAT_CRM(x)                      (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SDHC0_IRQSTAT.CRM Field                 */
#define SDHC_IRQSTAT_CINT_MASK                   (0x100U)                                            /*!< SDHC0_IRQSTAT.CINT Mask                 */
#define SDHC_IRQSTAT_CINT_SHIFT                  (8U)                                                /*!< SDHC0_IRQSTAT.CINT Position             */
#define SDHC_IRQSTAT_CINT(x)                     (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< SDHC0_IRQSTAT.CINT Field                */
#define SDHC_IRQSTAT_CTOE_MASK                   (0x10000U)                                          /*!< SDHC0_IRQSTAT.CTOE Mask                 */
#define SDHC_IRQSTAT_CTOE_SHIFT                  (16U)                                               /*!< SDHC0_IRQSTAT.CTOE Position             */
#define SDHC_IRQSTAT_CTOE(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< SDHC0_IRQSTAT.CTOE Field                */
#define SDHC_IRQSTAT_CCE_MASK                    (0x20000U)                                          /*!< SDHC0_IRQSTAT.CCE Mask                  */
#define SDHC_IRQSTAT_CCE_SHIFT                   (17U)                                               /*!< SDHC0_IRQSTAT.CCE Position              */
#define SDHC_IRQSTAT_CCE(x)                      (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< SDHC0_IRQSTAT.CCE Field                 */
#define SDHC_IRQSTAT_CEBE_MASK                   (0x40000U)                                          /*!< SDHC0_IRQSTAT.CEBE Mask                 */
#define SDHC_IRQSTAT_CEBE_SHIFT                  (18U)                                               /*!< SDHC0_IRQSTAT.CEBE Position             */
#define SDHC_IRQSTAT_CEBE(x)                     (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< SDHC0_IRQSTAT.CEBE Field                */
#define SDHC_IRQSTAT_CIE_MASK                    (0x80000U)                                          /*!< SDHC0_IRQSTAT.CIE Mask                  */
#define SDHC_IRQSTAT_CIE_SHIFT                   (19U)                                               /*!< SDHC0_IRQSTAT.CIE Position              */
#define SDHC_IRQSTAT_CIE(x)                      (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< SDHC0_IRQSTAT.CIE Field                 */
#define SDHC_IRQSTAT_DTOE_MASK                   (0x100000U)                                         /*!< SDHC0_IRQSTAT.DTOE Mask                 */
#define SDHC_IRQSTAT_DTOE_SHIFT                  (20U)                                               /*!< SDHC0_IRQSTAT.DTOE Position             */
#define SDHC_IRQSTAT_DTOE(x)                     (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< SDHC0_IRQSTAT.DTOE Field                */
#define SDHC_IRQSTAT_DCE_MASK                    (0x200000U)                                         /*!< SDHC0_IRQSTAT.DCE Mask                  */
#define SDHC_IRQSTAT_DCE_SHIFT                   (21U)                                               /*!< SDHC0_IRQSTAT.DCE Position              */
#define SDHC_IRQSTAT_DCE(x)                      (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< SDHC0_IRQSTAT.DCE Field                 */
#define SDHC_IRQSTAT_DEBE_MASK                   (0x400000U)                                         /*!< SDHC0_IRQSTAT.DEBE Mask                 */
#define SDHC_IRQSTAT_DEBE_SHIFT                  (22U)                                               /*!< SDHC0_IRQSTAT.DEBE Position             */
#define SDHC_IRQSTAT_DEBE(x)                     (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< SDHC0_IRQSTAT.DEBE Field                */
#define SDHC_IRQSTAT_AC12E_MASK                  (0x1000000U)                                        /*!< SDHC0_IRQSTAT.AC12E Mask                */
#define SDHC_IRQSTAT_AC12E_SHIFT                 (24U)                                               /*!< SDHC0_IRQSTAT.AC12E Position            */
#define SDHC_IRQSTAT_AC12E(x)                    (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SDHC0_IRQSTAT.AC12E Field               */
#define SDHC_IRQSTAT_DMAE_MASK                   (0x10000000U)                                       /*!< SDHC0_IRQSTAT.DMAE Mask                 */
#define SDHC_IRQSTAT_DMAE_SHIFT                  (28U)                                               /*!< SDHC0_IRQSTAT.DMAE Position             */
#define SDHC_IRQSTAT_DMAE(x)                     (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< SDHC0_IRQSTAT.DMAE Field                */
/* ------- IRQSTATEN Bit Fields                     ------ */
#define SDHC_IRQSTATEN_CCSEN_MASK                (0x1U)                                              /*!< SDHC0_IRQSTATEN.CCSEN Mask              */
#define SDHC_IRQSTATEN_CCSEN_SHIFT               (0U)                                                /*!< SDHC0_IRQSTATEN.CCSEN Position          */
#define SDHC_IRQSTATEN_CCSEN(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SDHC0_IRQSTATEN.CCSEN Field             */
#define SDHC_IRQSTATEN_TCSEN_MASK                (0x2U)                                              /*!< SDHC0_IRQSTATEN.TCSEN Mask              */
#define SDHC_IRQSTATEN_TCSEN_SHIFT               (1U)                                                /*!< SDHC0_IRQSTATEN.TCSEN Position          */
#define SDHC_IRQSTATEN_TCSEN(x)                  (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SDHC0_IRQSTATEN.TCSEN Field             */
#define SDHC_IRQSTATEN_BGESEN_MASK               (0x4U)                                              /*!< SDHC0_IRQSTATEN.BGESEN Mask             */
#define SDHC_IRQSTATEN_BGESEN_SHIFT              (2U)                                                /*!< SDHC0_IRQSTATEN.BGESEN Position         */
#define SDHC_IRQSTATEN_BGESEN(x)                 (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SDHC0_IRQSTATEN.BGESEN Field            */
#define SDHC_IRQSTATEN_DINTSEN_MASK              (0x8U)                                              /*!< SDHC0_IRQSTATEN.DINTSEN Mask            */
#define SDHC_IRQSTATEN_DINTSEN_SHIFT             (3U)                                                /*!< SDHC0_IRQSTATEN.DINTSEN Position        */
#define SDHC_IRQSTATEN_DINTSEN(x)                (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SDHC0_IRQSTATEN.DINTSEN Field           */
#define SDHC_IRQSTATEN_BWRSEN_MASK               (0x10U)                                             /*!< SDHC0_IRQSTATEN.BWRSEN Mask             */
#define SDHC_IRQSTATEN_BWRSEN_SHIFT              (4U)                                                /*!< SDHC0_IRQSTATEN.BWRSEN Position         */
#define SDHC_IRQSTATEN_BWRSEN(x)                 (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SDHC0_IRQSTATEN.BWRSEN Field            */
#define SDHC_IRQSTATEN_BRRSEN_MASK               (0x20U)                                             /*!< SDHC0_IRQSTATEN.BRRSEN Mask             */
#define SDHC_IRQSTATEN_BRRSEN_SHIFT              (5U)                                                /*!< SDHC0_IRQSTATEN.BRRSEN Position         */
#define SDHC_IRQSTATEN_BRRSEN(x)                 (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SDHC0_IRQSTATEN.BRRSEN Field            */
#define SDHC_IRQSTATEN_CINSEN_MASK               (0x40U)                                             /*!< SDHC0_IRQSTATEN.CINSEN Mask             */
#define SDHC_IRQSTATEN_CINSEN_SHIFT              (6U)                                                /*!< SDHC0_IRQSTATEN.CINSEN Position         */
#define SDHC_IRQSTATEN_CINSEN(x)                 (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SDHC0_IRQSTATEN.CINSEN Field            */
#define SDHC_IRQSTATEN_CRMSEN_MASK               (0x80U)                                             /*!< SDHC0_IRQSTATEN.CRMSEN Mask             */
#define SDHC_IRQSTATEN_CRMSEN_SHIFT              (7U)                                                /*!< SDHC0_IRQSTATEN.CRMSEN Position         */
#define SDHC_IRQSTATEN_CRMSEN(x)                 (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SDHC0_IRQSTATEN.CRMSEN Field            */
#define SDHC_IRQSTATEN_CINTSEN_MASK              (0x100U)                                            /*!< SDHC0_IRQSTATEN.CINTSEN Mask            */
#define SDHC_IRQSTATEN_CINTSEN_SHIFT             (8U)                                                /*!< SDHC0_IRQSTATEN.CINTSEN Position        */
#define SDHC_IRQSTATEN_CINTSEN(x)                (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< SDHC0_IRQSTATEN.CINTSEN Field           */
#define SDHC_IRQSTATEN_CTOESEN_MASK              (0x10000U)                                          /*!< SDHC0_IRQSTATEN.CTOESEN Mask            */
#define SDHC_IRQSTATEN_CTOESEN_SHIFT             (16U)                                               /*!< SDHC0_IRQSTATEN.CTOESEN Position        */
#define SDHC_IRQSTATEN_CTOESEN(x)                (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< SDHC0_IRQSTATEN.CTOESEN Field           */
#define SDHC_IRQSTATEN_CCESEN_MASK               (0x20000U)                                          /*!< SDHC0_IRQSTATEN.CCESEN Mask             */
#define SDHC_IRQSTATEN_CCESEN_SHIFT              (17U)                                               /*!< SDHC0_IRQSTATEN.CCESEN Position         */
#define SDHC_IRQSTATEN_CCESEN(x)                 (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< SDHC0_IRQSTATEN.CCESEN Field            */
#define SDHC_IRQSTATEN_CEBESEN_MASK              (0x40000U)                                          /*!< SDHC0_IRQSTATEN.CEBESEN Mask            */
#define SDHC_IRQSTATEN_CEBESEN_SHIFT             (18U)                                               /*!< SDHC0_IRQSTATEN.CEBESEN Position        */
#define SDHC_IRQSTATEN_CEBESEN(x)                (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< SDHC0_IRQSTATEN.CEBESEN Field           */
#define SDHC_IRQSTATEN_CIESEN_MASK               (0x80000U)                                          /*!< SDHC0_IRQSTATEN.CIESEN Mask             */
#define SDHC_IRQSTATEN_CIESEN_SHIFT              (19U)                                               /*!< SDHC0_IRQSTATEN.CIESEN Position         */
#define SDHC_IRQSTATEN_CIESEN(x)                 (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< SDHC0_IRQSTATEN.CIESEN Field            */
#define SDHC_IRQSTATEN_DTOESEN_MASK              (0x100000U)                                         /*!< SDHC0_IRQSTATEN.DTOESEN Mask            */
#define SDHC_IRQSTATEN_DTOESEN_SHIFT             (20U)                                               /*!< SDHC0_IRQSTATEN.DTOESEN Position        */
#define SDHC_IRQSTATEN_DTOESEN(x)                (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< SDHC0_IRQSTATEN.DTOESEN Field           */
#define SDHC_IRQSTATEN_DCESEN_MASK               (0x200000U)                                         /*!< SDHC0_IRQSTATEN.DCESEN Mask             */
#define SDHC_IRQSTATEN_DCESEN_SHIFT              (21U)                                               /*!< SDHC0_IRQSTATEN.DCESEN Position         */
#define SDHC_IRQSTATEN_DCESEN(x)                 (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< SDHC0_IRQSTATEN.DCESEN Field            */
#define SDHC_IRQSTATEN_DEBESEN_MASK              (0x400000U)                                         /*!< SDHC0_IRQSTATEN.DEBESEN Mask            */
#define SDHC_IRQSTATEN_DEBESEN_SHIFT             (22U)                                               /*!< SDHC0_IRQSTATEN.DEBESEN Position        */
#define SDHC_IRQSTATEN_DEBESEN(x)                (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< SDHC0_IRQSTATEN.DEBESEN Field           */
#define SDHC_IRQSTATEN_AC12ESEN_MASK             (0x1000000U)                                        /*!< SDHC0_IRQSTATEN.AC12ESEN Mask           */
#define SDHC_IRQSTATEN_AC12ESEN_SHIFT            (24U)                                               /*!< SDHC0_IRQSTATEN.AC12ESEN Position       */
#define SDHC_IRQSTATEN_AC12ESEN(x)               (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SDHC0_IRQSTATEN.AC12ESEN Field          */
#define SDHC_IRQSTATEN_DMAESEN_MASK              (0x10000000U)                                       /*!< SDHC0_IRQSTATEN.DMAESEN Mask            */
#define SDHC_IRQSTATEN_DMAESEN_SHIFT             (28U)                                               /*!< SDHC0_IRQSTATEN.DMAESEN Position        */
#define SDHC_IRQSTATEN_DMAESEN(x)                (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< SDHC0_IRQSTATEN.DMAESEN Field           */
/* ------- IRQSIGEN Bit Fields                      ------ */
#define SDHC_IRQSIGEN_CCIEN_MASK                 (0x1U)                                              /*!< SDHC0_IRQSIGEN.CCIEN Mask               */
#define SDHC_IRQSIGEN_CCIEN_SHIFT                (0U)                                                /*!< SDHC0_IRQSIGEN.CCIEN Position           */
#define SDHC_IRQSIGEN_CCIEN(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SDHC0_IRQSIGEN.CCIEN Field              */
#define SDHC_IRQSIGEN_TCIEN_MASK                 (0x2U)                                              /*!< SDHC0_IRQSIGEN.TCIEN Mask               */
#define SDHC_IRQSIGEN_TCIEN_SHIFT                (1U)                                                /*!< SDHC0_IRQSIGEN.TCIEN Position           */
#define SDHC_IRQSIGEN_TCIEN(x)                   (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SDHC0_IRQSIGEN.TCIEN Field              */
#define SDHC_IRQSIGEN_BGEIEN_MASK                (0x4U)                                              /*!< SDHC0_IRQSIGEN.BGEIEN Mask              */
#define SDHC_IRQSIGEN_BGEIEN_SHIFT               (2U)                                                /*!< SDHC0_IRQSIGEN.BGEIEN Position          */
#define SDHC_IRQSIGEN_BGEIEN(x)                  (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SDHC0_IRQSIGEN.BGEIEN Field             */
#define SDHC_IRQSIGEN_DINTIEN_MASK               (0x8U)                                              /*!< SDHC0_IRQSIGEN.DINTIEN Mask             */
#define SDHC_IRQSIGEN_DINTIEN_SHIFT              (3U)                                                /*!< SDHC0_IRQSIGEN.DINTIEN Position         */
#define SDHC_IRQSIGEN_DINTIEN(x)                 (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SDHC0_IRQSIGEN.DINTIEN Field            */
#define SDHC_IRQSIGEN_BWRIEN_MASK                (0x10U)                                             /*!< SDHC0_IRQSIGEN.BWRIEN Mask              */
