podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define SDHC_IRQSIGEN_BWRIEN_SHIFT               (4U)                                                /*!< SDHC0_IRQSIGEN.BWRIEN Position          */
#define SDHC_IRQSIGEN_BWRIEN(x)                  (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SDHC0_IRQSIGEN.BWRIEN Field             */
#define SDHC_IRQSIGEN_BRRIEN_MASK                (0x20U)                                             /*!< SDHC0_IRQSIGEN.BRRIEN Mask              */
#define SDHC_IRQSIGEN_BRRIEN_SHIFT               (5U)                                                /*!< SDHC0_IRQSIGEN.BRRIEN Position          */
#define SDHC_IRQSIGEN_BRRIEN(x)                  (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SDHC0_IRQSIGEN.BRRIEN Field             */
#define SDHC_IRQSIGEN_CINSIEN_MASK               (0x40U)                                             /*!< SDHC0_IRQSIGEN.CINSIEN Mask             */
#define SDHC_IRQSIGEN_CINSIEN_SHIFT              (6U)                                                /*!< SDHC0_IRQSIGEN.CINSIEN Position         */
#define SDHC_IRQSIGEN_CINSIEN(x)                 (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SDHC0_IRQSIGEN.CINSIEN Field            */
#define SDHC_IRQSIGEN_CRMIEN_MASK                (0x80U)                                             /*!< SDHC0_IRQSIGEN.CRMIEN Mask              */
#define SDHC_IRQSIGEN_CRMIEN_SHIFT               (7U)                                                /*!< SDHC0_IRQSIGEN.CRMIEN Position          */
#define SDHC_IRQSIGEN_CRMIEN(x)                  (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SDHC0_IRQSIGEN.CRMIEN Field             */
#define SDHC_IRQSIGEN_CINTIEN_MASK               (0x100U)                                            /*!< SDHC0_IRQSIGEN.CINTIEN Mask             */
#define SDHC_IRQSIGEN_CINTIEN_SHIFT              (8U)                                                /*!< SDHC0_IRQSIGEN.CINTIEN Position         */
#define SDHC_IRQSIGEN_CINTIEN(x)                 (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< SDHC0_IRQSIGEN.CINTIEN Field            */
#define SDHC_IRQSIGEN_CTOEIEN_MASK               (0x10000U)                                          /*!< SDHC0_IRQSIGEN.CTOEIEN Mask             */
#define SDHC_IRQSIGEN_CTOEIEN_SHIFT              (16U)                                               /*!< SDHC0_IRQSIGEN.CTOEIEN Position         */
#define SDHC_IRQSIGEN_CTOEIEN(x)                 (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< SDHC0_IRQSIGEN.CTOEIEN Field            */
#define SDHC_IRQSIGEN_CCEIEN_MASK                (0x20000U)                                          /*!< SDHC0_IRQSIGEN.CCEIEN Mask              */
#define SDHC_IRQSIGEN_CCEIEN_SHIFT               (17U)                                               /*!< SDHC0_IRQSIGEN.CCEIEN Position          */
#define SDHC_IRQSIGEN_CCEIEN(x)                  (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< SDHC0_IRQSIGEN.CCEIEN Field             */
#define SDHC_IRQSIGEN_CEBEIEN_MASK               (0x40000U)                                          /*!< SDHC0_IRQSIGEN.CEBEIEN Mask             */
#define SDHC_IRQSIGEN_CEBEIEN_SHIFT              (18U)                                               /*!< SDHC0_IRQSIGEN.CEBEIEN Position         */
#define SDHC_IRQSIGEN_CEBEIEN(x)                 (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< SDHC0_IRQSIGEN.CEBEIEN Field            */
#define SDHC_IRQSIGEN_CIEIEN_MASK                (0x80000U)                                          /*!< SDHC0_IRQSIGEN.CIEIEN Mask              */
#define SDHC_IRQSIGEN_CIEIEN_SHIFT               (19U)                                               /*!< SDHC0_IRQSIGEN.CIEIEN Position          */
#define SDHC_IRQSIGEN_CIEIEN(x)                  (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< SDHC0_IRQSIGEN.CIEIEN Field             */
#define SDHC_IRQSIGEN_DTOEIEN_MASK               (0x100000U)                                         /*!< SDHC0_IRQSIGEN.DTOEIEN Mask             */
#define SDHC_IRQSIGEN_DTOEIEN_SHIFT              (20U)                                               /*!< SDHC0_IRQSIGEN.DTOEIEN Position         */
#define SDHC_IRQSIGEN_DTOEIEN(x)                 (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< SDHC0_IRQSIGEN.DTOEIEN Field            */
#define SDHC_IRQSIGEN_DCEIEN_MASK                (0x200000U)                                         /*!< SDHC0_IRQSIGEN.DCEIEN Mask              */
#define SDHC_IRQSIGEN_DCEIEN_SHIFT               (21U)                                               /*!< SDHC0_IRQSIGEN.DCEIEN Position          */
#define SDHC_IRQSIGEN_DCEIEN(x)                  (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< SDHC0_IRQSIGEN.DCEIEN Field             */
#define SDHC_IRQSIGEN_DEBEIEN_MASK               (0x400000U)                                         /*!< SDHC0_IRQSIGEN.DEBEIEN Mask             */
#define SDHC_IRQSIGEN_DEBEIEN_SHIFT              (22U)                                               /*!< SDHC0_IRQSIGEN.DEBEIEN Position         */
#define SDHC_IRQSIGEN_DEBEIEN(x)                 (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< SDHC0_IRQSIGEN.DEBEIEN Field            */
#define SDHC_IRQSIGEN_AC12EIEN_MASK              (0x1000000U)                                        /*!< SDHC0_IRQSIGEN.AC12EIEN Mask            */
#define SDHC_IRQSIGEN_AC12EIEN_SHIFT             (24U)                                               /*!< SDHC0_IRQSIGEN.AC12EIEN Position        */
#define SDHC_IRQSIGEN_AC12EIEN(x)                (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SDHC0_IRQSIGEN.AC12EIEN Field           */
#define SDHC_IRQSIGEN_DMAEIEN_MASK               (0x10000000U)                                       /*!< SDHC0_IRQSIGEN.DMAEIEN Mask             */
#define SDHC_IRQSIGEN_DMAEIEN_SHIFT              (28U)                                               /*!< SDHC0_IRQSIGEN.DMAEIEN Position         */
#define SDHC_IRQSIGEN_DMAEIEN(x)                 (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< SDHC0_IRQSIGEN.DMAEIEN Field            */
/* ------- AC12ERR Bit Fields                       ------ */
#define SDHC_AC12ERR_AC12NE_MASK                 (0x1U)                                              /*!< SDHC0_AC12ERR.AC12NE Mask               */
#define SDHC_AC12ERR_AC12NE_SHIFT                (0U)                                                /*!< SDHC0_AC12ERR.AC12NE Position           */
#define SDHC_AC12ERR_AC12NE(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SDHC0_AC12ERR.AC12NE Field              */
#define SDHC_AC12ERR_AC12TOE_MASK                (0x2U)                                              /*!< SDHC0_AC12ERR.AC12TOE Mask              */
#define SDHC_AC12ERR_AC12TOE_SHIFT               (1U)                                                /*!< SDHC0_AC12ERR.AC12TOE Position          */
#define SDHC_AC12ERR_AC12TOE(x)                  (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SDHC0_AC12ERR.AC12TOE Field             */
#define SDHC_AC12ERR_AC12EBE_MASK                (0x4U)                                              /*!< SDHC0_AC12ERR.AC12EBE Mask              */
#define SDHC_AC12ERR_AC12EBE_SHIFT               (2U)                                                /*!< SDHC0_AC12ERR.AC12EBE Position          */
#define SDHC_AC12ERR_AC12EBE(x)                  (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SDHC0_AC12ERR.AC12EBE Field             */
#define SDHC_AC12ERR_AC12CE_MASK                 (0x8U)                                              /*!< SDHC0_AC12ERR.AC12CE Mask               */
#define SDHC_AC12ERR_AC12CE_SHIFT                (3U)                                                /*!< SDHC0_AC12ERR.AC12CE Position           */
#define SDHC_AC12ERR_AC12CE(x)                   (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SDHC0_AC12ERR.AC12CE Field              */
#define SDHC_AC12ERR_AC12IE_MASK                 (0x10U)                                             /*!< SDHC0_AC12ERR.AC12IE Mask               */
#define SDHC_AC12ERR_AC12IE_SHIFT                (4U)                                                /*!< SDHC0_AC12ERR.AC12IE Position           */
#define SDHC_AC12ERR_AC12IE(x)                   (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SDHC0_AC12ERR.AC12IE Field              */
#define SDHC_AC12ERR_CNIBAC12E_MASK              (0x80U)                                             /*!< SDHC0_AC12ERR.CNIBAC12E Mask            */
#define SDHC_AC12ERR_CNIBAC12E_SHIFT             (7U)                                                /*!< SDHC0_AC12ERR.CNIBAC12E Position        */
#define SDHC_AC12ERR_CNIBAC12E(x)                (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SDHC0_AC12ERR.CNIBAC12E Field           */
/* ------- HTCAPBLT Bit Fields                      ------ */
#define SDHC_HTCAPBLT_MBL_MASK                   (0x70000U)                                          /*!< SDHC0_HTCAPBLT.MBL Mask                 */
#define SDHC_HTCAPBLT_MBL_SHIFT                  (16U)                                               /*!< SDHC0_HTCAPBLT.MBL Position             */
#define SDHC_HTCAPBLT_MBL(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x70000UL)      /*!< SDHC0_HTCAPBLT.MBL Field                */
#define SDHC_HTCAPBLT_ADMAS_MASK                 (0x100000U)                                         /*!< SDHC0_HTCAPBLT.ADMAS Mask               */
#define SDHC_HTCAPBLT_ADMAS_SHIFT                (20U)                                               /*!< SDHC0_HTCAPBLT.ADMAS Position           */
#define SDHC_HTCAPBLT_ADMAS(x)                   (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< SDHC0_HTCAPBLT.ADMAS Field              */
#define SDHC_HTCAPBLT_HSS_MASK                   (0x200000U)                                         /*!< SDHC0_HTCAPBLT.HSS Mask                 */
#define SDHC_HTCAPBLT_HSS_SHIFT                  (21U)                                               /*!< SDHC0_HTCAPBLT.HSS Position             */
#define SDHC_HTCAPBLT_HSS(x)                     (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< SDHC0_HTCAPBLT.HSS Field                */
#define SDHC_HTCAPBLT_DMAS_MASK                  (0x400000U)                                         /*!< SDHC0_HTCAPBLT.DMAS Mask                */
#define SDHC_HTCAPBLT_DMAS_SHIFT                 (22U)                                               /*!< SDHC0_HTCAPBLT.DMAS Position            */
#define SDHC_HTCAPBLT_DMAS(x)                    (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< SDHC0_HTCAPBLT.DMAS Field               */
#define SDHC_HTCAPBLT_SRS_MASK                   (0x800000U)                                         /*!< SDHC0_HTCAPBLT.SRS Mask                 */
#define SDHC_HTCAPBLT_SRS_SHIFT                  (23U)                                               /*!< SDHC0_HTCAPBLT.SRS Position             */
#define SDHC_HTCAPBLT_SRS(x)                     (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< SDHC0_HTCAPBLT.SRS Field                */
#define SDHC_HTCAPBLT_VS33_MASK                  (0x1000000U)                                        /*!< SDHC0_HTCAPBLT.VS33 Mask                */
#define SDHC_HTCAPBLT_VS33_SHIFT                 (24U)                                               /*!< SDHC0_HTCAPBLT.VS33 Position            */
#define SDHC_HTCAPBLT_VS33(x)                    (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SDHC0_HTCAPBLT.VS33 Field               */
#define SDHC_HTCAPBLT_VS30_MASK                  (0x2000000U)                                        /*!< SDHC0_HTCAPBLT.VS30 Mask                */
#define SDHC_HTCAPBLT_VS30_SHIFT                 (25U)                                               /*!< SDHC0_HTCAPBLT.VS30 Position            */
#define SDHC_HTCAPBLT_VS30(x)                    (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< SDHC0_HTCAPBLT.VS30 Field               */
#define SDHC_HTCAPBLT_VS18_MASK                  (0x4000000U)                                        /*!< SDHC0_HTCAPBLT.VS18 Mask                */
#define SDHC_HTCAPBLT_VS18_SHIFT                 (26U)                                               /*!< SDHC0_HTCAPBLT.VS18 Position            */
#define SDHC_HTCAPBLT_VS18(x)                    (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< SDHC0_HTCAPBLT.VS18 Field               */
/* ------- WML Bit Fields                           ------ */
#define SDHC_WML_RDWML_MASK                      (0xFFU)                                             /*!< SDHC0_WML.RDWML Mask                    */
#define SDHC_WML_RDWML_SHIFT                     (0U)                                                /*!< SDHC0_WML.RDWML Position                */
#define SDHC_WML_RDWML(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< SDHC0_WML.RDWML Field                   */
#define SDHC_WML_WRWML_MASK                      (0xFF0000U)                                         /*!< SDHC0_WML.WRWML Mask                    */
#define SDHC_WML_WRWML_SHIFT                     (16U)                                               /*!< SDHC0_WML.WRWML Position                */
#define SDHC_WML_WRWML(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< SDHC0_WML.WRWML Field                   */
#define SDHC_WML_WRBRSTLEN_MASK                  (0x1F000000U)                                       /*!< SDHC0_WML.WRBRSTLEN Mask                */
#define SDHC_WML_WRBRSTLEN_SHIFT                 (24U)                                               /*!< SDHC0_WML.WRBRSTLEN Position            */
#define SDHC_WML_WRBRSTLEN(x)                    (((uint32_t)(((uint32_t)(x))<<24U))&0x1F000000UL)   /*!< SDHC0_WML.WRBRSTLEN Field               */
/* ------- FEVT Bit Fields                          ------ */
#define SDHC_FEVT_AC12NE_MASK                    (0x1U)                                              /*!< SDHC0_FEVT.AC12NE Mask                  */
#define SDHC_FEVT_AC12NE_SHIFT                   (0U)                                                /*!< SDHC0_FEVT.AC12NE Position              */
#define SDHC_FEVT_AC12NE(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SDHC0_FEVT.AC12NE Field                 */
#define SDHC_FEVT_AC12TOE_MASK                   (0x2U)                                              /*!< SDHC0_FEVT.AC12TOE Mask                 */
#define SDHC_FEVT_AC12TOE_SHIFT                  (1U)                                                /*!< SDHC0_FEVT.AC12TOE Position             */
#define SDHC_FEVT_AC12TOE(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SDHC0_FEVT.AC12TOE Field                */
#define SDHC_FEVT_AC12CE_MASK                    (0x4U)                                              /*!< SDHC0_FEVT.AC12CE Mask                  */
#define SDHC_FEVT_AC12CE_SHIFT                   (2U)                                                /*!< SDHC0_FEVT.AC12CE Position              */
#define SDHC_FEVT_AC12CE(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SDHC0_FEVT.AC12CE Field                 */
#define SDHC_FEVT_AC12EBE_MASK                   (0x8U)                                              /*!< SDHC0_FEVT.AC12EBE Mask                 */
#define SDHC_FEVT_AC12EBE_SHIFT                  (3U)                                                /*!< SDHC0_FEVT.AC12EBE Position             */
#define SDHC_FEVT_AC12EBE(x)                     (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SDHC0_FEVT.AC12EBE Field                */
#define SDHC_FEVT_AC12IE_MASK                    (0x10U)                                             /*!< SDHC0_FEVT.AC12IE Mask                  */
#define SDHC_FEVT_AC12IE_SHIFT                   (4U)                                                /*!< SDHC0_FEVT.AC12IE Position              */
#define SDHC_FEVT_AC12IE(x)                      (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SDHC0_FEVT.AC12IE Field                 */
#define SDHC_FEVT_CNIBAC12E_MASK                 (0x80U)                                             /*!< SDHC0_FEVT.CNIBAC12E Mask               */
#define SDHC_FEVT_CNIBAC12E_SHIFT                (7U)                                                /*!< SDHC0_FEVT.CNIBAC12E Position           */
#define SDHC_FEVT_CNIBAC12E(x)                   (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SDHC0_FEVT.CNIBAC12E Field              */
#define SDHC_FEVT_CTOE_MASK                      (0x10000U)                                          /*!< SDHC0_FEVT.CTOE Mask                    */
#define SDHC_FEVT_CTOE_SHIFT                     (16U)                                               /*!< SDHC0_FEVT.CTOE Position                */
#define SDHC_FEVT_CTOE(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< SDHC0_FEVT.CTOE Field                   */
#define SDHC_FEVT_CCE_MASK                       (0x20000U)                                          /*!< SDHC0_FEVT.CCE Mask                     */
#define SDHC_FEVT_CCE_SHIFT                      (17U)                                               /*!< SDHC0_FEVT.CCE Position                 */
#define SDHC_FEVT_CCE(x)                         (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< SDHC0_FEVT.CCE Field                    */
#define SDHC_FEVT_CEBE_MASK                      (0x40000U)                                          /*!< SDHC0_FEVT.CEBE Mask                    */
#define SDHC_FEVT_CEBE_SHIFT                     (18U)                                               /*!< SDHC0_FEVT.CEBE Position                */
#define SDHC_FEVT_CEBE(x)                        (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< SDHC0_FEVT.CEBE Field                   */
#define SDHC_FEVT_CIE_MASK                       (0x80000U)                                          /*!< SDHC0_FEVT.CIE Mask                     */
#define SDHC_FEVT_CIE_SHIFT                      (19U)                                               /*!< SDHC0_FEVT.CIE Position                 */
#define SDHC_FEVT_CIE(x)                         (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< SDHC0_FEVT.CIE Field                    */
#define SDHC_FEVT_DTOE_MASK                      (0x100000U)                                         /*!< SDHC0_FEVT.DTOE Mask                    */
#define SDHC_FEVT_DTOE_SHIFT                     (20U)                                               /*!< SDHC0_FEVT.DTOE Position                */
#define SDHC_FEVT_DTOE(x)                        (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< SDHC0_FEVT.DTOE Field                   */
#define SDHC_FEVT_DCE_MASK                       (0x200000U)                                         /*!< SDHC0_FEVT.DCE Mask                     */
#define SDHC_FEVT_DCE_SHIFT                      (21U)                                               /*!< SDHC0_FEVT.DCE Position                 */
#define SDHC_FEVT_DCE(x)                         (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< SDHC0_FEVT.DCE Field                    */
#define SDHC_FEVT_DEBE_MASK                      (0x400000U)                                         /*!< SDHC0_FEVT.DEBE Mask                    */
#define SDHC_FEVT_DEBE_SHIFT                     (22U)                                               /*!< SDHC0_FEVT.DEBE Position                */
#define SDHC_FEVT_DEBE(x)                        (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< SDHC0_FEVT.DEBE Field                   */
#define SDHC_FEVT_AC12E_MASK                     (0x1000000U)                                        /*!< SDHC0_FEVT.AC12E Mask                   */
#define SDHC_FEVT_AC12E_SHIFT                    (24U)                                               /*!< SDHC0_FEVT.AC12E Position               */
#define SDHC_FEVT_AC12E(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SDHC0_FEVT.AC12E Field                  */
#define SDHC_FEVT_DMAE_MASK                      (0x10000000U)                                       /*!< SDHC0_FEVT.DMAE Mask                    */
#define SDHC_FEVT_DMAE_SHIFT                     (28U)                                               /*!< SDHC0_FEVT.DMAE Position                */
#define SDHC_FEVT_DMAE(x)                        (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< SDHC0_FEVT.DMAE Field                   */
#define SDHC_FEVT_CINT_MASK                      (0x80000000U)                                       /*!< SDHC0_FEVT.CINT Mask                    */
#define SDHC_FEVT_CINT_SHIFT                     (31U)                                               /*!< SDHC0_FEVT.CINT Position                */
#define SDHC_FEVT_CINT(x)                        (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< SDHC0_FEVT.CINT Field                   */
/* ------- ADMAES Bit Fields                        ------ */
#define SDHC_ADMAES_ADMAES_MASK                  (0x3U)                                              /*!< SDHC0_ADMAES.ADMAES Mask                */
#define SDHC_ADMAES_ADMAES_SHIFT                 (0U)                                                /*!< SDHC0_ADMAES.ADMAES Position            */
#define SDHC_ADMAES_ADMAES(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< SDHC0_ADMAES.ADMAES Field               */
#define SDHC_ADMAES_ADMALME_MASK                 (0x4U)                                              /*!< SDHC0_ADMAES.ADMALME Mask               */
#define SDHC_ADMAES_ADMALME_SHIFT                (2U)                                                /*!< SDHC0_ADMAES.ADMALME Position           */
#define SDHC_ADMAES_ADMALME(x)                   (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SDHC0_ADMAES.ADMALME Field              */
#define SDHC_ADMAES_ADMADCE_MASK                 (0x8U)                                              /*!< SDHC0_ADMAES.ADMADCE Mask               */
#define SDHC_ADMAES_ADMADCE_SHIFT                (3U)                                                /*!< SDHC0_ADMAES.ADMADCE Position           */
#define SDHC_ADMAES_ADMADCE(x)                   (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SDHC0_ADMAES.ADMADCE Field              */
/* ------- ADSADDR Bit Fields                       ------ */
#define SDHC_ADSADDR_ADSADDR_MASK                (0xFFFFFFFCU)                                       /*!< SDHC0_ADSADDR.ADSADDR Mask              */
#define SDHC_ADSADDR_ADSADDR_SHIFT               (2U)                                                /*!< SDHC0_ADSADDR.ADSADDR Position          */
#define SDHC_ADSADDR_ADSADDR(x)                  (((uint32_t)(((uint32_t)(x))<<2U))&0xFFFFFFFCUL)    /*!< SDHC0_ADSADDR.ADSADDR Field             */
/* ------- VENDOR Bit Fields                        ------ */
#define SDHC_VENDOR_EXTDMAEN_MASK                (0x1U)                                              /*!< SDHC0_VENDOR.EXTDMAEN Mask              */
#define SDHC_VENDOR_EXTDMAEN_SHIFT               (0U)                                                /*!< SDHC0_VENDOR.EXTDMAEN Position          */
#define SDHC_VENDOR_EXTDMAEN(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SDHC0_VENDOR.EXTDMAEN Field             */
#define SDHC_VENDOR_EXBLKNU_MASK                 (0x2U)                                              /*!< SDHC0_VENDOR.EXBLKNU Mask               */
#define SDHC_VENDOR_EXBLKNU_SHIFT                (1U)                                                /*!< SDHC0_VENDOR.EXBLKNU Position           */
#define SDHC_VENDOR_EXBLKNU(x)                   (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SDHC0_VENDOR.EXBLKNU Field              */
