podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define SDHC_VENDOR_INTSTVAL_MASK                (0xFF0000U)                                         /*!< SDHC0_VENDOR.INTSTVAL Mask              */
#define SDHC_VENDOR_INTSTVAL_SHIFT               (16U)                                               /*!< SDHC0_VENDOR.INTSTVAL Position          */
#define SDHC_VENDOR_INTSTVAL(x)                  (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< SDHC0_VENDOR.INTSTVAL Field             */
/* ------- MMCBOOT Bit Fields                       ------ */
#define SDHC_MMCBOOT_DTOCVACK_MASK               (0xFU)                                              /*!< SDHC0_MMCBOOT.DTOCVACK Mask             */
#define SDHC_MMCBOOT_DTOCVACK_SHIFT              (0U)                                                /*!< SDHC0_MMCBOOT.DTOCVACK Position         */
#define SDHC_MMCBOOT_DTOCVACK(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< SDHC0_MMCBOOT.DTOCVACK Field            */
#define SDHC_MMCBOOT_BOOTACK_MASK                (0x10U)                                             /*!< SDHC0_MMCBOOT.BOOTACK Mask              */
#define SDHC_MMCBOOT_BOOTACK_SHIFT               (4U)                                                /*!< SDHC0_MMCBOOT.BOOTACK Position          */
#define SDHC_MMCBOOT_BOOTACK(x)                  (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SDHC0_MMCBOOT.BOOTACK Field             */
#define SDHC_MMCBOOT_BOOTMODE_MASK               (0x20U)                                             /*!< SDHC0_MMCBOOT.BOOTMODE Mask             */
#define SDHC_MMCBOOT_BOOTMODE_SHIFT              (5U)                                                /*!< SDHC0_MMCBOOT.BOOTMODE Position         */
#define SDHC_MMCBOOT_BOOTMODE(x)                 (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SDHC0_MMCBOOT.BOOTMODE Field            */
#define SDHC_MMCBOOT_BOOTEN_MASK                 (0x40U)                                             /*!< SDHC0_MMCBOOT.BOOTEN Mask               */
#define SDHC_MMCBOOT_BOOTEN_SHIFT                (6U)                                                /*!< SDHC0_MMCBOOT.BOOTEN Position           */
#define SDHC_MMCBOOT_BOOTEN(x)                   (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SDHC0_MMCBOOT.BOOTEN Field              */
#define SDHC_MMCBOOT_AUTOSABGEN_MASK             (0x80U)                                             /*!< SDHC0_MMCBOOT.AUTOSABGEN Mask           */
#define SDHC_MMCBOOT_AUTOSABGEN_SHIFT            (7U)                                                /*!< SDHC0_MMCBOOT.AUTOSABGEN Position       */
#define SDHC_MMCBOOT_AUTOSABGEN(x)               (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SDHC0_MMCBOOT.AUTOSABGEN Field          */
#define SDHC_MMCBOOT_BOOTBLKCNT_MASK             (0xFFFF0000U)                                       /*!< SDHC0_MMCBOOT.BOOTBLKCNT Mask           */
#define SDHC_MMCBOOT_BOOTBLKCNT_SHIFT            (16U)                                               /*!< SDHC0_MMCBOOT.BOOTBLKCNT Position       */
#define SDHC_MMCBOOT_BOOTBLKCNT(x)               (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< SDHC0_MMCBOOT.BOOTBLKCNT Field          */
/* ------- HOSTVER Bit Fields                       ------ */
#define SDHC_HOSTVER_SVN_MASK                    (0xFFU)                                             /*!< SDHC0_HOSTVER.SVN Mask                  */
#define SDHC_HOSTVER_SVN_SHIFT                   (0U)                                                /*!< SDHC0_HOSTVER.SVN Position              */
#define SDHC_HOSTVER_SVN(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< SDHC0_HOSTVER.SVN Field                 */
#define SDHC_HOSTVER_VVN_MASK                    (0xFF00U)                                           /*!< SDHC0_HOSTVER.VVN Mask                  */
#define SDHC_HOSTVER_VVN_SHIFT                   (8U)                                                /*!< SDHC0_HOSTVER.VVN Position              */
#define SDHC_HOSTVER_VVN(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< SDHC0_HOSTVER.VVN Field                 */
/**
 * @} */ /* End group SDHC_Register_Masks_GROUP 
 */

/* SDHC0 - Peripheral instance base addresses */
#define SDHC0_BasePtr                  0x400B1000UL //!< Peripheral base address
#define SDHC0                          ((SDHC_Type *) SDHC0_BasePtr) //!< Freescale base pointer
#define SDHC0_BASE_PTR                 (SDHC0) //!< Freescale style base pointer
#define SDHC0_IRQS { SDHC0_IRQn,  }

/**
 * @} */ /* End group SDHC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SIM_Peripheral_access_layer_GROUP SIM Peripheral Access Layer
* @brief C Struct for SIM
* @{
*/

/* ================================================================================ */
/* ================           SIM (file:SIM_MK70F15)               ================ */
/* ================================================================================ */

/**
 * @brief System Integration Module
 */
/**
* @addtogroup SIM_structs_GROUP SIM struct
* @brief Struct for SIM
* @{
*/
typedef struct SIM_Type {
   __IO uint32_t  SOPT1;                        /**< 0000: System Options Register 1                                    */
   __IO uint32_t  SOPT1CFG;                     /**< 0004: SOPT1 Configuration Register                                 */
        uint8_t   RESERVED_0[4092];             /**< 0008: 0xFFC bytes                                                  */
   __IO uint32_t  SOPT2;                        /**< 1004: System Options Register 2                                    */
        uint8_t   RESERVED_1[4];                /**< 1008: 0x4 bytes                                                    */
   __IO uint32_t  SOPT4;                        /**< 100C: System Options Register 4                                    */
   __IO uint32_t  SOPT5;                        /**< 1010: System Options Register 5                                    */
   __IO uint32_t  SOPT6;                        /**< 1014: System Options Register 6                                    */
   __IO uint32_t  SOPT7;                        /**< 1018: System Options Register 7                                    */
        uint8_t   RESERVED_2[8];                /**< 101C: 0x8 bytes                                                    */
   __I  uint32_t  SDID;                         /**< 1024: System Device Identification Register                        */
   __IO uint32_t  SCGC1;                        /**< 1028: System Clock Gating Control Register 1                       */
   __IO uint32_t  SCGC2;                        /**< 102C: System Clock Gating Control Register 2                       */
   __IO uint32_t  SCGC3;                        /**< 1030: System Clock Gating Control Register 3                       */
   __IO uint32_t  SCGC4;                        /**< 1034: System Clock Gating Control Register 4                       */
   __IO uint32_t  SCGC5;                        /**< 1038: System Clock Gating Control Register 5                       */
   __IO uint32_t  SCGC6;                        /**< 103C: System Clock Gating Control Register 6                       */
   __IO uint32_t  SCGC7;                        /**< 1040: System Clock Gating Control Register 7                       */
   __IO uint32_t  CLKDIV1;                      /**< 1044: System Clock Divider Register 1                              */
   __IO uint32_t  CLKDIV2;                      /**< 1048: System Clock Divider Register 2                              */
   __IO uint32_t  FCFG1;                        /**< 104C: Flash Configuration Register 1                               */
   __I  uint32_t  FCFG2;                        /**< 1050: Flash Configuration Register 2                               */
   __I  uint32_t  UIDH;                         /**< 1054: Unique Identification Register High                          */
   __I  uint32_t  UIDMH;                        /**< 1058: Unique Identification Register Mid-High                      */
   __I  uint32_t  UIDML;                        /**< 105C: Unique Identification Register Mid Low                       */
   __I  uint32_t  UIDL;                         /**< 1060: Unique Identification Register Low                           */
   __IO uint32_t  CLKDIV3;                      /**< 1064: System Clock Divider Register 3                              */
   __IO uint32_t  CLKDIV4;                      /**< 1068: System Clock Divider Register 4                              */
   __IO uint32_t  MCR;                          /**< 106C: Misc Control Register                                        */
} SIM_Type;

/**
 * @} */ /* End group SIM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SIM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

