podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define SIM_SOPT7_ADC2TRGSEL_SHIFT               (16U)                                               /*!< SIM_SOPT7.ADC2TRGSEL Position           */
#define SIM_SOPT7_ADC2TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< SIM_SOPT7.ADC2TRGSEL Field              */
#define SIM_SOPT7_ADC2PRETRGSEL_MASK             (0x100000U)                                         /*!< SIM_SOPT7.ADC2PRETRGSEL Mask            */
#define SIM_SOPT7_ADC2PRETRGSEL_SHIFT            (20U)                                               /*!< SIM_SOPT7.ADC2PRETRGSEL Position        */
#define SIM_SOPT7_ADC2PRETRGSEL(x)               (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< SIM_SOPT7.ADC2PRETRGSEL Field           */
#define SIM_SOPT7_ADC2ALTTRGEN_MASK              (0x800000U)                                         /*!< SIM_SOPT7.ADC2ALTTRGEN Mask             */
#define SIM_SOPT7_ADC2ALTTRGEN_SHIFT             (23U)                                               /*!< SIM_SOPT7.ADC2ALTTRGEN Position         */
#define SIM_SOPT7_ADC2ALTTRGEN(x)                (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< SIM_SOPT7.ADC2ALTTRGEN Field            */
#define SIM_SOPT7_ADC3TRGSEL_MASK                (0xF000000U)                                        /*!< SIM_SOPT7.ADC3TRGSEL Mask               */
#define SIM_SOPT7_ADC3TRGSEL_SHIFT               (24U)                                               /*!< SIM_SOPT7.ADC3TRGSEL Position           */
#define SIM_SOPT7_ADC3TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< SIM_SOPT7.ADC3TRGSEL Field              */
#define SIM_SOPT7_ADC3PRETRGSEL_MASK             (0x10000000U)                                       /*!< SIM_SOPT7.ADC3PRETRGSEL Mask            */
#define SIM_SOPT7_ADC3PRETRGSEL_SHIFT            (28U)                                               /*!< SIM_SOPT7.ADC3PRETRGSEL Position        */
#define SIM_SOPT7_ADC3PRETRGSEL(x)               (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< SIM_SOPT7.ADC3PRETRGSEL Field           */
#define SIM_SOPT7_ADC3ALTTRGEN_MASK              (0x80000000U)                                       /*!< SIM_SOPT7.ADC3ALTTRGEN Mask             */
#define SIM_SOPT7_ADC3ALTTRGEN_SHIFT             (31U)                                               /*!< SIM_SOPT7.ADC3ALTTRGEN Position         */
#define SIM_SOPT7_ADC3ALTTRGEN(x)                (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< SIM_SOPT7.ADC3ALTTRGEN Field            */
/* ------- SDID Bit Fields                          ------ */
#define SIM_SDID_PINID_MASK                      (0xFU)                                              /*!< SIM_SDID.PINID Mask                     */
#define SIM_SDID_PINID_SHIFT                     (0U)                                                /*!< SIM_SDID.PINID Position                 */
#define SIM_SDID_PINID(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< SIM_SDID.PINID Field                    */
#define SIM_SDID_FAMID_MASK                      (0x70U)                                             /*!< SIM_SDID.FAMID Mask                     */
#define SIM_SDID_FAMID_SHIFT                     (4U)                                                /*!< SIM_SDID.FAMID Position                 */
#define SIM_SDID_FAMID(x)                        (((uint32_t)(((uint32_t)(x))<<4U))&0x70UL)          /*!< SIM_SDID.FAMID Field                    */
#define SIM_SDID_REVID_MASK                      (0xF000U)                                           /*!< SIM_SDID.REVID Mask                     */
#define SIM_SDID_REVID_SHIFT                     (12U)                                               /*!< SIM_SDID.REVID Position                 */
#define SIM_SDID_REVID(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0xF000UL)       /*!< SIM_SDID.REVID Field                    */
/* ------- SCGC1 Bit Fields                         ------ */
#define SIM_SCGC1_OSC1_MASK                      (0x20U)                                             /*!< SIM_SCGC1.OSC1 Mask                     */
#define SIM_SCGC1_OSC1_SHIFT                     (5U)                                                /*!< SIM_SCGC1.OSC1 Position                 */
#define SIM_SCGC1_OSC1(x)                        (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SIM_SCGC1.OSC1 Field                    */
#define SIM_SCGC1_UART4_MASK                     (0x400U)                                            /*!< SIM_SCGC1.UART4 Mask                    */
#define SIM_SCGC1_UART4_SHIFT                    (10U)                                               /*!< SIM_SCGC1.UART4 Position                */
#define SIM_SCGC1_UART4(x)                       (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< SIM_SCGC1.UART4 Field                   */
#define SIM_SCGC1_UART5_MASK                     (0x800U)                                            /*!< SIM_SCGC1.UART5 Mask                    */
#define SIM_SCGC1_UART5_SHIFT                    (11U)                                               /*!< SIM_SCGC1.UART5 Position                */
#define SIM_SCGC1_UART5(x)                       (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< SIM_SCGC1.UART5 Field                   */
/* ------- SCGC2 Bit Fields                         ------ */
#define SIM_SCGC2_ENET_MASK                      (0x1U)                                              /*!< SIM_SCGC2.ENET Mask                     */
#define SIM_SCGC2_ENET_SHIFT                     (0U)                                                /*!< SIM_SCGC2.ENET Position                 */
#define SIM_SCGC2_ENET(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_SCGC2.ENET Field                    */
#define SIM_SCGC2_DAC0_MASK                      (0x1000U)                                           /*!< SIM_SCGC2.DAC0 Mask                     */
#define SIM_SCGC2_DAC0_SHIFT                     (12U)                                               /*!< SIM_SCGC2.DAC0 Position                 */
#define SIM_SCGC2_DAC0(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< SIM_SCGC2.DAC0 Field                    */
#define SIM_SCGC2_DAC1_MASK                      (0x2000U)                                           /*!< SIM_SCGC2.DAC1 Mask                     */
#define SIM_SCGC2_DAC1_SHIFT                     (13U)                                               /*!< SIM_SCGC2.DAC1 Position                 */
#define SIM_SCGC2_DAC1(x)                        (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< SIM_SCGC2.DAC1 Field                    */
/* ------- SCGC3 Bit Fields                         ------ */
#define SIM_SCGC3_RNGA_MASK                      (0x1U)                                              /*!< SIM_SCGC3.RNGA Mask                     */
#define SIM_SCGC3_RNGA_SHIFT                     (0U)                                                /*!< SIM_SCGC3.RNGA Position                 */
#define SIM_SCGC3_RNGA(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_SCGC3.RNGA Field                    */
#define SIM_SCGC3_CAN1_MASK                      (0x10U)                                             /*!< SIM_SCGC3.CAN1 Mask                     */
#define SIM_SCGC3_CAN1_SHIFT                     (4U)                                                /*!< SIM_SCGC3.CAN1 Position                 */
#define SIM_SCGC3_CAN1(x)                        (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SIM_SCGC3.CAN1 Field                    */
#define SIM_SCGC3_NFC_MASK                       (0x100U)                                            /*!< SIM_SCGC3.NFC Mask                      */
#define SIM_SCGC3_NFC_SHIFT                      (8U)                                                /*!< SIM_SCGC3.NFC Position                  */
#define SIM_SCGC3_NFC(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< SIM_SCGC3.NFC Field                     */
#define SIM_SCGC3_SPI2_MASK                      (0x1000U)                                           /*!< SIM_SCGC3.SPI2 Mask                     */
#define SIM_SCGC3_SPI2_SHIFT                     (12U)                                               /*!< SIM_SCGC3.SPI2 Position                 */
#define SIM_SCGC3_SPI2(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< SIM_SCGC3.SPI2 Field                    */
#define SIM_SCGC3_DDR_MASK                       (0x4000U)                                           /*!< SIM_SCGC3.DDR Mask                      */
#define SIM_SCGC3_DDR_SHIFT                      (14U)                                               /*!< SIM_SCGC3.DDR Position                  */
#define SIM_SCGC3_DDR(x)                         (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< SIM_SCGC3.DDR Field                     */
#define SIM_SCGC3_SAI1_MASK                      (0x8000U)                                           /*!< SIM_SCGC3.SAI1 Mask                     */
#define SIM_SCGC3_SAI1_SHIFT                     (15U)                                               /*!< SIM_SCGC3.SAI1 Position                 */
#define SIM_SCGC3_SAI1(x)                        (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< SIM_SCGC3.SAI1 Field                    */
#define SIM_SCGC3_ESDHC_MASK                     (0x20000U)                                          /*!< SIM_SCGC3.ESDHC Mask                    */
#define SIM_SCGC3_ESDHC_SHIFT                    (17U)                                               /*!< SIM_SCGC3.ESDHC Position                */
#define SIM_SCGC3_ESDHC(x)                       (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< SIM_SCGC3.ESDHC Field                   */
#define SIM_SCGC3_LCDC_MASK                      (0x400000U)                                         /*!< SIM_SCGC3.LCDC Mask                     */
#define SIM_SCGC3_LCDC_SHIFT                     (22U)                                               /*!< SIM_SCGC3.LCDC Position                 */
#define SIM_SCGC3_LCDC(x)                        (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< SIM_SCGC3.LCDC Field                    */
#define SIM_SCGC3_FTM2_MASK                      (0x1000000U)                                        /*!< SIM_SCGC3.FTM2 Mask                     */
#define SIM_SCGC3_FTM2_SHIFT                     (24U)                                               /*!< SIM_SCGC3.FTM2 Position                 */
#define SIM_SCGC3_FTM2(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SIM_SCGC3.FTM2 Field                    */
#define SIM_SCGC3_FTM3_MASK                      (0x2000000U)                                        /*!< SIM_SCGC3.FTM3 Mask                     */
#define SIM_SCGC3_FTM3_SHIFT                     (25U)                                               /*!< SIM_SCGC3.FTM3 Position                 */
#define SIM_SCGC3_FTM3(x)                        (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< SIM_SCGC3.FTM3 Field                    */
#define SIM_SCGC3_ADC1_MASK                      (0x8000000U)                                        /*!< SIM_SCGC3.ADC1 Mask                     */
#define SIM_SCGC3_ADC1_SHIFT                     (27U)                                               /*!< SIM_SCGC3.ADC1 Position                 */
#define SIM_SCGC3_ADC1(x)                        (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< SIM_SCGC3.ADC1 Field                    */
#define SIM_SCGC3_ADC3_MASK                      (0x10000000U)                                       /*!< SIM_SCGC3.ADC3 Mask                     */
#define SIM_SCGC3_ADC3_SHIFT                     (28U)                                               /*!< SIM_SCGC3.ADC3 Position                 */
#define SIM_SCGC3_ADC3(x)                        (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< SIM_SCGC3.ADC3 Field                    */
/* ------- SCGC4 Bit Fields                         ------ */
#define SIM_SCGC4_EWM_MASK                       (0x2U)                                              /*!< SIM_SCGC4.EWM Mask                      */
#define SIM_SCGC4_EWM_SHIFT                      (1U)                                                /*!< SIM_SCGC4.EWM Position                  */
#define SIM_SCGC4_EWM(x)                         (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_SCGC4.EWM Field                     */
#define SIM_SCGC4_CMT_MASK                       (0x4U)                                              /*!< SIM_SCGC4.CMT Mask                      */
#define SIM_SCGC4_CMT_SHIFT                      (2U)                                                /*!< SIM_SCGC4.CMT Position                  */
#define SIM_SCGC4_CMT(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SIM_SCGC4.CMT Field                     */
#define SIM_SCGC4_IIC0_MASK                      (0x40U)                                             /*!< SIM_SCGC4.IIC0 Mask                     */
#define SIM_SCGC4_IIC0_SHIFT                     (6U)                                                /*!< SIM_SCGC4.IIC0 Position                 */
#define SIM_SCGC4_IIC0(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SIM_SCGC4.IIC0 Field                    */
#define SIM_SCGC4_IIC1_MASK                      (0x80U)                                             /*!< SIM_SCGC4.IIC1 Mask                     */
#define SIM_SCGC4_IIC1_SHIFT                     (7U)                                                /*!< SIM_SCGC4.IIC1 Position                 */
#define SIM_SCGC4_IIC1(x)                        (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SIM_SCGC4.IIC1 Field                    */
#define SIM_SCGC4_UART0_MASK                     (0x400U)                                            /*!< SIM_SCGC4.UART0 Mask                    */
#define SIM_SCGC4_UART0_SHIFT                    (10U)                                               /*!< SIM_SCGC4.UART0 Position                */
#define SIM_SCGC4_UART0(x)                       (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< SIM_SCGC4.UART0 Field                   */
#define SIM_SCGC4_UART1_MASK                     (0x800U)                                            /*!< SIM_SCGC4.UART1 Mask                    */
#define SIM_SCGC4_UART1_SHIFT                    (11U)                                               /*!< SIM_SCGC4.UART1 Position                */
#define SIM_SCGC4_UART1(x)                       (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< SIM_SCGC4.UART1 Field                   */
#define SIM_SCGC4_UART2_MASK                     (0x1000U)                                           /*!< SIM_SCGC4.UART2 Mask                    */
#define SIM_SCGC4_UART2_SHIFT                    (12U)                                               /*!< SIM_SCGC4.UART2 Position                */
#define SIM_SCGC4_UART2(x)                       (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< SIM_SCGC4.UART2 Field                   */
#define SIM_SCGC4_UART3_MASK                     (0x2000U)                                           /*!< SIM_SCGC4.UART3 Mask                    */
#define SIM_SCGC4_UART3_SHIFT                    (13U)                                               /*!< SIM_SCGC4.UART3 Position                */
#define SIM_SCGC4_UART3(x)                       (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< SIM_SCGC4.UART3 Field                   */
#define SIM_SCGC4_USBFS_MASK                     (0x40000U)                                          /*!< SIM_SCGC4.USBFS Mask                    */
#define SIM_SCGC4_USBFS_SHIFT                    (18U)                                               /*!< SIM_SCGC4.USBFS Position                */
#define SIM_SCGC4_USBFS(x)                       (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< SIM_SCGC4.USBFS Field                   */
#define SIM_SCGC4_CMP_MASK                       (0x80000U)                                          /*!< SIM_SCGC4.CMP Mask                      */
#define SIM_SCGC4_CMP_SHIFT                      (19U)                                               /*!< SIM_SCGC4.CMP Position                  */
#define SIM_SCGC4_CMP(x)                         (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< SIM_SCGC4.CMP Field                     */
#define SIM_SCGC4_VREF_MASK                      (0x100000U)                                         /*!< SIM_SCGC4.VREF Mask                     */
#define SIM_SCGC4_VREF_SHIFT                     (20U)                                               /*!< SIM_SCGC4.VREF Position                 */
#define SIM_SCGC4_VREF(x)                        (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< SIM_SCGC4.VREF Field                    */
#define SIM_SCGC4_LLWU_MASK                      (0x10000000U)                                       /*!< SIM_SCGC4.LLWU Mask                     */
#define SIM_SCGC4_LLWU_SHIFT                     (28U)                                               /*!< SIM_SCGC4.LLWU Position                 */
#define SIM_SCGC4_LLWU(x)                        (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< SIM_SCGC4.LLWU Field                    */
/* ------- SCGC5 Bit Fields                         ------ */
#define SIM_SCGC5_LPTIMER_MASK                   (0x1U)                                              /*!< SIM_SCGC5.LPTIMER Mask                  */
#define SIM_SCGC5_LPTIMER_SHIFT                  (0U)                                                /*!< SIM_SCGC5.LPTIMER Position              */
#define SIM_SCGC5_LPTIMER(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_SCGC5.LPTIMER Field                 */
#define SIM_SCGC5_REGFILE_MASK                   (0x2U)                                              /*!< SIM_SCGC5.REGFILE Mask                  */
#define SIM_SCGC5_REGFILE_SHIFT                  (1U)                                                /*!< SIM_SCGC5.REGFILE Position              */
#define SIM_SCGC5_REGFILE(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_SCGC5.REGFILE Field                 */
#define SIM_SCGC5_DRYICE_MASK                    (0x4U)                                              /*!< SIM_SCGC5.DRYICE Mask                   */
#define SIM_SCGC5_DRYICE_SHIFT                   (2U)                                                /*!< SIM_SCGC5.DRYICE Position               */
#define SIM_SCGC5_DRYICE(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SIM_SCGC5.DRYICE Field                  */
#define SIM_SCGC5_DRYICESECREG_MASK              (0x8U)                                              /*!< SIM_SCGC5.DRYICESECREG Mask             */
#define SIM_SCGC5_DRYICESECREG_SHIFT             (3U)                                                /*!< SIM_SCGC5.DRYICESECREG Position         */
#define SIM_SCGC5_DRYICESECREG(x)                (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SIM_SCGC5.DRYICESECREG Field            */
#define SIM_SCGC5_TSI0_MASK                      (0x20U)                                             /*!< SIM_SCGC5.TSI0 Mask                     */
#define SIM_SCGC5_TSI0_SHIFT                     (5U)                                                /*!< SIM_SCGC5.TSI0 Position                 */
#define SIM_SCGC5_TSI0(x)                        (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SIM_SCGC5.TSI0 Field                    */
#define SIM_SCGC5_PORTA_MASK                     (0x200U)                                            /*!< SIM_SCGC5.PORTA Mask                    */
#define SIM_SCGC5_PORTA_SHIFT                    (9U)                                                /*!< SIM_SCGC5.PORTA Position                */
#define SIM_SCGC5_PORTA(x)                       (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< SIM_SCGC5.PORTA Field                   */
#define SIM_SCGC5_PORTB_MASK                     (0x400U)                                            /*!< SIM_SCGC5.PORTB Mask                    */
#define SIM_SCGC5_PORTB_SHIFT                    (10U)                                               /*!< SIM_SCGC5.PORTB Position                */
#define SIM_SCGC5_PORTB(x)                       (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< SIM_SCGC5.PORTB Field                   */
#define SIM_SCGC5_PORTC_MASK                     (0x800U)                                            /*!< SIM_SCGC5.PORTC Mask                    */
#define SIM_SCGC5_PORTC_SHIFT                    (11U)                                               /*!< SIM_SCGC5.PORTC Position                */
#define SIM_SCGC5_PORTC(x)                       (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< SIM_SCGC5.PORTC Field                   */
#define SIM_SCGC5_PORTD_MASK                     (0x1000U)                                           /*!< SIM_SCGC5.PORTD Mask                    */
#define SIM_SCGC5_PORTD_SHIFT                    (12U)                                               /*!< SIM_SCGC5.PORTD Position                */
#define SIM_SCGC5_PORTD(x)                       (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< SIM_SCGC5.PORTD Field                   */
#define SIM_SCGC5_PORTE_MASK                     (0x2000U)                                           /*!< SIM_SCGC5.PORTE Mask                    */
#define SIM_SCGC5_PORTE_SHIFT                    (13U)                                               /*!< SIM_SCGC5.PORTE Position                */
#define SIM_SCGC5_PORTE(x)                       (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< SIM_SCGC5.PORTE Field                   */
#define SIM_SCGC5_PORTF_MASK                     (0x4000U)                                           /*!< SIM_SCGC5.PORTF Mask                    */
#define SIM_SCGC5_PORTF_SHIFT                    (14U)                                               /*!< SIM_SCGC5.PORTF Position                */
#define SIM_SCGC5_PORTF(x)                       (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< SIM_SCGC5.PORTF Field                   */
/* ------- SCGC6 Bit Fields                         ------ */
#define SIM_SCGC6_DMAMUX0_MASK                   (0x2U)                                              /*!< SIM_SCGC6.DMAMUX0 Mask                  */
#define SIM_SCGC6_DMAMUX0_SHIFT                  (1U)                                                /*!< SIM_SCGC6.DMAMUX0 Position              */
#define SIM_SCGC6_DMAMUX0(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_SCGC6.DMAMUX0 Field                 */
#define SIM_SCGC6_DMAMUX1_MASK                   (0x4U)                                              /*!< SIM_SCGC6.DMAMUX1 Mask                  */
#define SIM_SCGC6_DMAMUX1_SHIFT                  (2U)                                                /*!< SIM_SCGC6.DMAMUX1 Position              */
#define SIM_SCGC6_DMAMUX1(x)                     (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SIM_SCGC6.DMAMUX1 Field                 */
#define SIM_SCGC6_CAN0_MASK                      (0x10U)                                             /*!< SIM_SCGC6.CAN0 Mask                     */
#define SIM_SCGC6_CAN0_SHIFT                     (4U)                                                /*!< SIM_SCGC6.CAN0 Position                 */
#define SIM_SCGC6_CAN0(x)                        (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SIM_SCGC6.CAN0 Field                    */
