podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define SIM_SCGC6_SPI0_MASK                      (0x1000U)                                           /*!< SIM_SCGC6.SPI0 Mask                     */
#define SIM_SCGC6_SPI0_SHIFT                     (12U)                                               /*!< SIM_SCGC6.SPI0 Position                 */
#define SIM_SCGC6_SPI0(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< SIM_SCGC6.SPI0 Field                    */
#define SIM_SCGC6_SPI1_MASK                      (0x2000U)                                           /*!< SIM_SCGC6.SPI1 Mask                     */
#define SIM_SCGC6_SPI1_SHIFT                     (13U)                                               /*!< SIM_SCGC6.SPI1 Position                 */
#define SIM_SCGC6_SPI1(x)                        (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< SIM_SCGC6.SPI1 Field                    */
#define SIM_SCGC6_SAI0_MASK                      (0x8000U)                                           /*!< SIM_SCGC6.SAI0 Mask                     */
#define SIM_SCGC6_SAI0_SHIFT                     (15U)                                               /*!< SIM_SCGC6.SAI0 Position                 */
#define SIM_SCGC6_SAI0(x)                        (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< SIM_SCGC6.SAI0 Field                    */
#define SIM_SCGC6_CRC_MASK                       (0x40000U)                                          /*!< SIM_SCGC6.CRC Mask                      */
#define SIM_SCGC6_CRC_SHIFT                      (18U)                                               /*!< SIM_SCGC6.CRC Position                  */
#define SIM_SCGC6_CRC(x)                         (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< SIM_SCGC6.CRC Field                     */
#define SIM_SCGC6_USBHS_MASK                     (0x100000U)                                         /*!< SIM_SCGC6.USBHS Mask                    */
#define SIM_SCGC6_USBHS_SHIFT                    (20U)                                               /*!< SIM_SCGC6.USBHS Position                */
#define SIM_SCGC6_USBHS(x)                       (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< SIM_SCGC6.USBHS Field                   */
#define SIM_SCGC6_USBDCD_MASK                    (0x200000U)                                         /*!< SIM_SCGC6.USBDCD Mask                   */
#define SIM_SCGC6_USBDCD_SHIFT                   (21U)                                               /*!< SIM_SCGC6.USBDCD Position               */
#define SIM_SCGC6_USBDCD(x)                      (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< SIM_SCGC6.USBDCD Field                  */
#define SIM_SCGC6_PDB_MASK                       (0x400000U)                                         /*!< SIM_SCGC6.PDB Mask                      */
#define SIM_SCGC6_PDB_SHIFT                      (22U)                                               /*!< SIM_SCGC6.PDB Position                  */
#define SIM_SCGC6_PDB(x)                         (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< SIM_SCGC6.PDB Field                     */
#define SIM_SCGC6_PIT_MASK                       (0x800000U)                                         /*!< SIM_SCGC6.PIT Mask                      */
#define SIM_SCGC6_PIT_SHIFT                      (23U)                                               /*!< SIM_SCGC6.PIT Position                  */
#define SIM_SCGC6_PIT(x)                         (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< SIM_SCGC6.PIT Field                     */
#define SIM_SCGC6_FTM0_MASK                      (0x1000000U)                                        /*!< SIM_SCGC6.FTM0 Mask                     */
#define SIM_SCGC6_FTM0_SHIFT                     (24U)                                               /*!< SIM_SCGC6.FTM0 Position                 */
#define SIM_SCGC6_FTM0(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SIM_SCGC6.FTM0 Field                    */
#define SIM_SCGC6_FTM1_MASK                      (0x2000000U)                                        /*!< SIM_SCGC6.FTM1 Mask                     */
#define SIM_SCGC6_FTM1_SHIFT                     (25U)                                               /*!< SIM_SCGC6.FTM1 Position                 */
#define SIM_SCGC6_FTM1(x)                        (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< SIM_SCGC6.FTM1 Field                    */
#define SIM_SCGC6_ADC0_MASK                      (0x8000000U)                                        /*!< SIM_SCGC6.ADC0 Mask                     */
#define SIM_SCGC6_ADC0_SHIFT                     (27U)                                               /*!< SIM_SCGC6.ADC0 Position                 */
#define SIM_SCGC6_ADC0(x)                        (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< SIM_SCGC6.ADC0 Field                    */
#define SIM_SCGC6_ADC2_MASK                      (0x10000000U)                                       /*!< SIM_SCGC6.ADC2 Mask                     */
#define SIM_SCGC6_ADC2_SHIFT                     (28U)                                               /*!< SIM_SCGC6.ADC2 Position                 */
#define SIM_SCGC6_ADC2(x)                        (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< SIM_SCGC6.ADC2 Field                    */
#define SIM_SCGC6_RTC_MASK                       (0x20000000U)                                       /*!< SIM_SCGC6.RTC Mask                      */
#define SIM_SCGC6_RTC_SHIFT                      (29U)                                               /*!< SIM_SCGC6.RTC Position                  */
#define SIM_SCGC6_RTC(x)                         (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< SIM_SCGC6.RTC Field                     */
/* ------- SCGC7 Bit Fields                         ------ */
#define SIM_SCGC7_FLEXBUS_MASK                   (0x1U)                                              /*!< SIM_SCGC7.FLEXBUS Mask                  */
#define SIM_SCGC7_FLEXBUS_SHIFT                  (0U)                                                /*!< SIM_SCGC7.FLEXBUS Position              */
#define SIM_SCGC7_FLEXBUS(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_SCGC7.FLEXBUS Field                 */
#define SIM_SCGC7_DMA_MASK                       (0x2U)                                              /*!< SIM_SCGC7.DMA Mask                      */
#define SIM_SCGC7_DMA_SHIFT                      (1U)                                                /*!< SIM_SCGC7.DMA Position                  */
#define SIM_SCGC7_DMA(x)                         (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_SCGC7.DMA Field                     */
#define SIM_SCGC7_MPU_MASK                       (0x4U)                                              /*!< SIM_SCGC7.MPU Mask                      */
#define SIM_SCGC7_MPU_SHIFT                      (2U)                                                /*!< SIM_SCGC7.MPU Position                  */
#define SIM_SCGC7_MPU(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SIM_SCGC7.MPU Field                     */
/* ------- CLKDIV1 Bit Fields                       ------ */
#define SIM_CLKDIV1_OUTDIV4_MASK                 (0xF0000U)                                          /*!< SIM_CLKDIV1.OUTDIV4 Mask                */
#define SIM_CLKDIV1_OUTDIV4_SHIFT                (16U)                                               /*!< SIM_CLKDIV1.OUTDIV4 Position            */
#define SIM_CLKDIV1_OUTDIV4(x)                   (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< SIM_CLKDIV1.OUTDIV4 Field               */
#define SIM_CLKDIV1_OUTDIV3_MASK                 (0xF00000U)                                         /*!< SIM_CLKDIV1.OUTDIV3 Mask                */
#define SIM_CLKDIV1_OUTDIV3_SHIFT                (20U)                                               /*!< SIM_CLKDIV1.OUTDIV3 Position            */
#define SIM_CLKDIV1_OUTDIV3(x)                   (((uint32_t)(((uint32_t)(x))<<20U))&0xF00000UL)     /*!< SIM_CLKDIV1.OUTDIV3 Field               */
#define SIM_CLKDIV1_OUTDIV2_MASK                 (0xF000000U)                                        /*!< SIM_CLKDIV1.OUTDIV2 Mask                */
#define SIM_CLKDIV1_OUTDIV2_SHIFT                (24U)                                               /*!< SIM_CLKDIV1.OUTDIV2 Position            */
#define SIM_CLKDIV1_OUTDIV2(x)                   (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< SIM_CLKDIV1.OUTDIV2 Field               */
#define SIM_CLKDIV1_OUTDIV1_MASK                 (0xF0000000U)                                       /*!< SIM_CLKDIV1.OUTDIV1 Mask                */
#define SIM_CLKDIV1_OUTDIV1_SHIFT                (28U)                                               /*!< SIM_CLKDIV1.OUTDIV1 Position            */
#define SIM_CLKDIV1_OUTDIV1(x)                   (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< SIM_CLKDIV1.OUTDIV1 Field               */
/* ------- CLKDIV2 Bit Fields                       ------ */
#define SIM_CLKDIV2_USBFRAC_MASK                 (0x1U)                                              /*!< SIM_CLKDIV2.USBFRAC Mask                */
#define SIM_CLKDIV2_USBFRAC_SHIFT                (0U)                                                /*!< SIM_CLKDIV2.USBFRAC Position            */
#define SIM_CLKDIV2_USBFRAC(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_CLKDIV2.USBFRAC Field               */
#define SIM_CLKDIV2_USBFSDIV_MASK                (0xEU)                                              /*!< SIM_CLKDIV2.USBFSDIV Mask               */
#define SIM_CLKDIV2_USBFSDIV_SHIFT               (1U)                                                /*!< SIM_CLKDIV2.USBFSDIV Position           */
#define SIM_CLKDIV2_USBFSDIV(x)                  (((uint32_t)(((uint32_t)(x))<<1U))&0xEUL)           /*!< SIM_CLKDIV2.USBFSDIV Field              */
#define SIM_CLKDIV2_USBHSFRAC_MASK               (0x100U)                                            /*!< SIM_CLKDIV2.USBHSFRAC Mask              */
#define SIM_CLKDIV2_USBHSFRAC_SHIFT              (8U)                                                /*!< SIM_CLKDIV2.USBHSFRAC Position          */
#define SIM_CLKDIV2_USBHSFRAC(x)                 (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< SIM_CLKDIV2.USBHSFRAC Field             */
#define SIM_CLKDIV2_USBHSDIV_MASK                (0xE00U)                                            /*!< SIM_CLKDIV2.USBHSDIV Mask               */
#define SIM_CLKDIV2_USBHSDIV_SHIFT               (9U)                                                /*!< SIM_CLKDIV2.USBHSDIV Position           */
#define SIM_CLKDIV2_USBHSDIV(x)                  (((uint32_t)(((uint32_t)(x))<<9U))&0xE00UL)         /*!< SIM_CLKDIV2.USBHSDIV Field              */
/* ------- FCFG1 Bit Fields                         ------ */
#define SIM_FCFG1_FTFDIS_MASK                    (0x1U)                                              /*!< SIM_FCFG1.FTFDIS Mask                   */
#define SIM_FCFG1_FTFDIS_SHIFT                   (0U)                                                /*!< SIM_FCFG1.FTFDIS Position               */
#define SIM_FCFG1_FTFDIS(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_FCFG1.FTFDIS Field                  */
#define SIM_FCFG1_DEPART_MASK                    (0xF00U)                                            /*!< SIM_FCFG1.DEPART Mask                   */
#define SIM_FCFG1_DEPART_SHIFT                   (8U)                                                /*!< SIM_FCFG1.DEPART Position               */
#define SIM_FCFG1_DEPART(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< SIM_FCFG1.DEPART Field                  */
#define SIM_FCFG1_EESIZE_MASK                    (0xF0000U)                                          /*!< SIM_FCFG1.EESIZE Mask                   */
#define SIM_FCFG1_EESIZE_SHIFT                   (16U)                                               /*!< SIM_FCFG1.EESIZE Position               */
#define SIM_FCFG1_EESIZE(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< SIM_FCFG1.EESIZE Field                  */
#define SIM_FCFG1_PFSIZE_MASK                    (0xF000000U)                                        /*!< SIM_FCFG1.PFSIZE Mask                   */
#define SIM_FCFG1_PFSIZE_SHIFT                   (24U)                                               /*!< SIM_FCFG1.PFSIZE Position               */
#define SIM_FCFG1_PFSIZE(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< SIM_FCFG1.PFSIZE Field                  */
#define SIM_FCFG1_NVMSIZE_MASK                   (0xF0000000U)                                       /*!< SIM_FCFG1.NVMSIZE Mask                  */
#define SIM_FCFG1_NVMSIZE_SHIFT                  (28U)                                               /*!< SIM_FCFG1.NVMSIZE Position              */
#define SIM_FCFG1_NVMSIZE(x)                     (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< SIM_FCFG1.NVMSIZE Field                 */
/* ------- FCFG2 Bit Fields                         ------ */
#define SIM_FCFG2_MAXADDR23_MASK                 (0x3F0000U)                                         /*!< SIM_FCFG2.MAXADDR23 Mask                */
#define SIM_FCFG2_MAXADDR23_SHIFT                (16U)                                               /*!< SIM_FCFG2.MAXADDR23 Position            */
#define SIM_FCFG2_MAXADDR23(x)                   (((uint32_t)(((uint32_t)(x))<<16U))&0x3F0000UL)     /*!< SIM_FCFG2.MAXADDR23 Field               */
#define SIM_FCFG2_MAXADDR01_MASK                 (0x3F000000U)                                       /*!< SIM_FCFG2.MAXADDR01 Mask                */
#define SIM_FCFG2_MAXADDR01_SHIFT                (24U)                                               /*!< SIM_FCFG2.MAXADDR01 Position            */
#define SIM_FCFG2_MAXADDR01(x)                   (((uint32_t)(((uint32_t)(x))<<24U))&0x3F000000UL)   /*!< SIM_FCFG2.MAXADDR01 Field               */
/* ------- UIDH Bit Fields                          ------ */
#define SIM_UIDH_UID_MASK                        (0xFFFFFFFFU)                                       /*!< SIM_UIDH.UID Mask                       */
#define SIM_UIDH_UID_SHIFT                       (0U)                                                /*!< SIM_UIDH.UID Position                   */
#define SIM_UIDH_UID(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< SIM_UIDH.UID Field                      */
/* ------- UIDMH Bit Fields                         ------ */
#define SIM_UIDMH_UID_MASK                       (0xFFFFFFFFU)                                       /*!< SIM_UIDMH.UID Mask                      */
#define SIM_UIDMH_UID_SHIFT                      (0U)                                                /*!< SIM_UIDMH.UID Position                  */
#define SIM_UIDMH_UID(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< SIM_UIDMH.UID Field                     */
/* ------- UIDML Bit Fields                         ------ */
#define SIM_UIDML_UID_MASK                       (0xFFFFFFFFU)                                       /*!< SIM_UIDML.UID Mask                      */
#define SIM_UIDML_UID_SHIFT                      (0U)                                                /*!< SIM_UIDML.UID Position                  */
#define SIM_UIDML_UID(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< SIM_UIDML.UID Field                     */
/* ------- UIDL Bit Fields                          ------ */
#define SIM_UIDL_UID_MASK                        (0xFFFFFFFFU)                                       /*!< SIM_UIDL.UID Mask                       */
#define SIM_UIDL_UID_SHIFT                       (0U)                                                /*!< SIM_UIDL.UID Position                   */
#define SIM_UIDL_UID(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< SIM_UIDL.UID Field                      */
/* ------- CLKDIV3 Bit Fields                       ------ */
#define SIM_CLKDIV3_LCDCFRAC_MASK                (0xFF00U)                                           /*!< SIM_CLKDIV3.LCDCFRAC Mask               */
#define SIM_CLKDIV3_LCDCFRAC_SHIFT               (8U)                                                /*!< SIM_CLKDIV3.LCDCFRAC Position           */
#define SIM_CLKDIV3_LCDCFRAC(x)                  (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< SIM_CLKDIV3.LCDCFRAC Field              */
#define SIM_CLKDIV3_LCDCDIV_MASK                 (0xFFF0000U)                                        /*!< SIM_CLKDIV3.LCDCDIV Mask                */
#define SIM_CLKDIV3_LCDCDIV_SHIFT                (16U)                                               /*!< SIM_CLKDIV3.LCDCDIV Position            */
#define SIM_CLKDIV3_LCDCDIV(x)                   (((uint32_t)(((uint32_t)(x))<<16U))&0xFFF0000UL)    /*!< SIM_CLKDIV3.LCDCDIV Field               */
/* ------- CLKDIV4 Bit Fields                       ------ */
#define SIM_CLKDIV4_TRACEFRAC_MASK               (0x1U)                                              /*!< SIM_CLKDIV4.TRACEFRAC Mask              */
#define SIM_CLKDIV4_TRACEFRAC_SHIFT              (0U)                                                /*!< SIM_CLKDIV4.TRACEFRAC Position          */
#define SIM_CLKDIV4_TRACEFRAC(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_CLKDIV4.TRACEFRAC Field             */
#define SIM_CLKDIV4_TRACEDIV_MASK                (0xEU)                                              /*!< SIM_CLKDIV4.TRACEDIV Mask               */
#define SIM_CLKDIV4_TRACEDIV_SHIFT               (1U)                                                /*!< SIM_CLKDIV4.TRACEDIV Position           */
#define SIM_CLKDIV4_TRACEDIV(x)                  (((uint32_t)(((uint32_t)(x))<<1U))&0xEUL)           /*!< SIM_CLKDIV4.TRACEDIV Field              */
#define SIM_CLKDIV4_NFCFRAC_MASK                 (0x7000000U)                                        /*!< SIM_CLKDIV4.NFCFRAC Mask                */
#define SIM_CLKDIV4_NFCFRAC_SHIFT                (24U)                                               /*!< SIM_CLKDIV4.NFCFRAC Position            */
#define SIM_CLKDIV4_NFCFRAC(x)                   (((uint32_t)(((uint32_t)(x))<<24U))&0x7000000UL)    /*!< SIM_CLKDIV4.NFCFRAC Field               */
#define SIM_CLKDIV4_NFCDIV_MASK                  (0xF8000000U)                                       /*!< SIM_CLKDIV4.NFCDIV Mask                 */
#define SIM_CLKDIV4_NFCDIV_SHIFT                 (27U)                                               /*!< SIM_CLKDIV4.NFCDIV Position             */
#define SIM_CLKDIV4_NFCDIV(x)                    (((uint32_t)(((uint32_t)(x))<<27U))&0xF8000000UL)   /*!< SIM_CLKDIV4.NFCDIV Field                */
/* ------- MCR Bit Fields                           ------ */
#define SIM_MCR_DDRSREN_MASK                     (0x1U)                                              /*!< SIM_MCR.DDRSREN Mask                    */
#define SIM_MCR_DDRSREN_SHIFT                    (0U)                                                /*!< SIM_MCR.DDRSREN Position                */
#define SIM_MCR_DDRSREN(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_MCR.DDRSREN Field                   */
#define SIM_MCR_DDRS_MASK                        (0x2U)                                              /*!< SIM_MCR.DDRS Mask                       */
#define SIM_MCR_DDRS_SHIFT                       (1U)                                                /*!< SIM_MCR.DDRS Position                   */
#define SIM_MCR_DDRS(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_MCR.DDRS Field                      */
#define SIM_MCR_DDRPEN_MASK                      (0x4U)                                              /*!< SIM_MCR.DDRPEN Mask                     */
#define SIM_MCR_DDRPEN_SHIFT                     (2U)                                                /*!< SIM_MCR.DDRPEN Position                 */
#define SIM_MCR_DDRPEN(x)                        (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SIM_MCR.DDRPEN Field                    */
#define SIM_MCR_DDRDQSDIS_MASK                   (0x8U)                                              /*!< SIM_MCR.DDRDQSDIS Mask                  */
#define SIM_MCR_DDRDQSDIS_SHIFT                  (3U)                                                /*!< SIM_MCR.DDRDQSDIS Position              */
#define SIM_MCR_DDRDQSDIS(x)                     (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SIM_MCR.DDRDQSDIS Field                 */
#define SIM_MCR_DDRCFG_MASK                      (0xE0U)                                             /*!< SIM_MCR.DDRCFG Mask                     */
#define SIM_MCR_DDRCFG_SHIFT                     (5U)                                                /*!< SIM_MCR.DDRCFG Position                 */
#define SIM_MCR_DDRCFG(x)                        (((uint32_t)(((uint32_t)(x))<<5U))&0xE0UL)          /*!< SIM_MCR.DDRCFG Field                    */
#define SIM_MCR_RCRRSTEN_MASK                    (0x100U)                                            /*!< SIM_MCR.RCRRSTEN Mask                   */
#define SIM_MCR_RCRRSTEN_SHIFT                   (8U)                                                /*!< SIM_MCR.RCRRSTEN Position               */
#define SIM_MCR_RCRRSTEN(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< SIM_MCR.RCRRSTEN Field                  */
#define SIM_MCR_RCRRST_MASK                      (0x200U)                                            /*!< SIM_MCR.RCRRST Mask                     */
#define SIM_MCR_RCRRST_SHIFT                     (9U)                                                /*!< SIM_MCR.RCRRST Position                 */
#define SIM_MCR_RCRRST(x)                        (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< SIM_MCR.RCRRST Field                    */
#define SIM_MCR_LCDSTART_MASK                    (0x10000U)                                          /*!< SIM_MCR.LCDSTART Mask                   */
#define SIM_MCR_LCDSTART_SHIFT                   (16U)                                               /*!< SIM_MCR.LCDSTART Position               */
#define SIM_MCR_LCDSTART(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< SIM_MCR.LCDSTART Field                  */
#define SIM_MCR_PDBLOOP_MASK                     (0x20000000U)                                       /*!< SIM_MCR.PDBLOOP Mask                    */
#define SIM_MCR_PDBLOOP_SHIFT                    (29U)                                               /*!< SIM_MCR.PDBLOOP Position                */
#define SIM_MCR_PDBLOOP(x)                       (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< SIM_MCR.PDBLOOP Field                   */
#define SIM_MCR_ULPICLKOBE_MASK                  (0x40000000U)                                       /*!< SIM_MCR.ULPICLKOBE Mask                 */
#define SIM_MCR_ULPICLKOBE_SHIFT                 (30U)                                               /*!< SIM_MCR.ULPICLKOBE Position             */
#define SIM_MCR_ULPICLKOBE(x)                    (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< SIM_MCR.ULPICLKOBE Field                */
#define SIM_MCR_TRACECLKDIS_MASK                 (0x80000000U)                                       /*!< SIM_MCR.TRACECLKDIS Mask                */
#define SIM_MCR_TRACECLKDIS_SHIFT                (31U)                                               /*!< SIM_MCR.TRACECLKDIS Position            */
#define SIM_MCR_TRACECLKDIS(x)                   (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< SIM_MCR.TRACECLKDIS Field               */
/**
