podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define UART_ET7816_RXTHRESHOLD(x)               (((uint8_t)(((uint8_t)(x))<<0U))&0xFUL)             /*!< UART0_ET7816.RXTHRESHOLD Field          */
#define UART_ET7816_TXTHRESHOLD_MASK             (0xF0U)                                             /*!< UART0_ET7816.TXTHRESHOLD Mask           */
#define UART_ET7816_TXTHRESHOLD_SHIFT            (4U)                                                /*!< UART0_ET7816.TXTHRESHOLD Position       */
#define UART_ET7816_TXTHRESHOLD(x)               (((uint8_t)(((uint8_t)(x))<<4U))&0xF0UL)            /*!< UART0_ET7816.TXTHRESHOLD Field          */
/* ------- TL7816 Bit Fields                        ------ */
#define UART_TL7816_TLEN_MASK                    (0xFFU)                                             /*!< UART0_TL7816.TLEN Mask                  */
#define UART_TL7816_TLEN_SHIFT                   (0U)                                                /*!< UART0_TL7816.TLEN Position              */
#define UART_TL7816_TLEN(x)                      (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_TL7816.TLEN Field                 */
/* ------- C6 Bit Fields                            ------ */
#define UART_C6_CP_MASK                          (0x10U)                                             /*!< UART0_C6.CP Mask                        */
#define UART_C6_CP_SHIFT                         (4U)                                                /*!< UART0_C6.CP Position                    */
#define UART_C6_CP(x)                            (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< UART0_C6.CP Field                       */
#define UART_C6_CE_MASK                          (0x20U)                                             /*!< UART0_C6.CE Mask                        */
#define UART_C6_CE_SHIFT                         (5U)                                                /*!< UART0_C6.CE Position                    */
#define UART_C6_CE(x)                            (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< UART0_C6.CE Field                       */
#define UART_C6_TX709_MASK                       (0x40U)                                             /*!< UART0_C6.TX709 Mask                     */
#define UART_C6_TX709_SHIFT                      (6U)                                                /*!< UART0_C6.TX709 Position                 */
#define UART_C6_TX709(x)                         (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< UART0_C6.TX709 Field                    */
#define UART_C6_EN709_MASK                       (0x80U)                                             /*!< UART0_C6.EN709 Mask                     */
#define UART_C6_EN709_SHIFT                      (7U)                                                /*!< UART0_C6.EN709 Position                 */
#define UART_C6_EN709(x)                         (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< UART0_C6.EN709 Field                    */
/* ------- PCTH Bit Fields                          ------ */
#define UART_PCTH_PCTH_MASK                      (0xFFU)                                             /*!< UART0_PCTH.PCTH Mask                    */
#define UART_PCTH_PCTH_SHIFT                     (0U)                                                /*!< UART0_PCTH.PCTH Position                */
#define UART_PCTH_PCTH(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_PCTH.PCTH Field                   */
/* ------- PCTL Bit Fields                          ------ */
#define UART_PCTL_PCTL_MASK                      (0xFFU)                                             /*!< UART0_PCTL.PCTL Mask                    */
#define UART_PCTL_PCTL_SHIFT                     (0U)                                                /*!< UART0_PCTL.PCTL Position                */
#define UART_PCTL_PCTL(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_PCTL.PCTL Field                   */
/* ------- B1T Bit Fields                           ------ */
#define UART_B1T_B1T_MASK                        (0xFFU)                                             /*!< UART0_B1T.B1T Mask                      */
#define UART_B1T_B1T_SHIFT                       (0U)                                                /*!< UART0_B1T.B1T Position                  */
#define UART_B1T_B1T(x)                          (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_B1T.B1T Field                     */
/* ------- SDTH Bit Fields                          ------ */
#define UART_SDTH_SDTH_MASK                      (0xFFU)                                             /*!< UART0_SDTH.SDTH Mask                    */
#define UART_SDTH_SDTH_SHIFT                     (0U)                                                /*!< UART0_SDTH.SDTH Position                */
#define UART_SDTH_SDTH(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_SDTH.SDTH Field                   */
/* ------- SDTL Bit Fields                          ------ */
#define UART_SDTL_SDTL_MASK                      (0xFFU)                                             /*!< UART0_SDTL.SDTL Mask                    */
#define UART_SDTL_SDTL_SHIFT                     (0U)                                                /*!< UART0_SDTL.SDTL Position                */
#define UART_SDTL_SDTL(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_SDTL.SDTL Field                   */
/* ------- PRE Bit Fields                           ------ */
#define UART_PRE_PREAMBLE_MASK                   (0xFFU)                                             /*!< UART0_PRE.PREAMBLE Mask                 */
#define UART_PRE_PREAMBLE_SHIFT                  (0U)                                                /*!< UART0_PRE.PREAMBLE Position             */
#define UART_PRE_PREAMBLE(x)                     (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_PRE.PREAMBLE Field                */
/* ------- TPL Bit Fields                           ------ */
#define UART_TPL_TPL_MASK                        (0xFFU)                                             /*!< UART0_TPL.TPL Mask                      */
#define UART_TPL_TPL_SHIFT                       (0U)                                                /*!< UART0_TPL.TPL Position                  */
#define UART_TPL_TPL(x)                          (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_TPL.TPL Field                     */
/* ------- IE Bit Fields                            ------ */
#define UART_IE_TXFIE_MASK                       (0x1U)                                              /*!< UART0_IE.TXFIE Mask                     */
#define UART_IE_TXFIE_SHIFT                      (0U)                                                /*!< UART0_IE.TXFIE Position                 */
#define UART_IE_TXFIE(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< UART0_IE.TXFIE Field                    */
#define UART_IE_PSIE_MASK                        (0x2U)                                              /*!< UART0_IE.PSIE Mask                      */
#define UART_IE_PSIE_SHIFT                       (1U)                                                /*!< UART0_IE.PSIE Position                  */
#define UART_IE_PSIE(x)                          (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< UART0_IE.PSIE Field                     */
#define UART_IE_PCTEIE_MASK                      (0x4U)                                              /*!< UART0_IE.PCTEIE Mask                    */
#define UART_IE_PCTEIE_SHIFT                     (2U)                                                /*!< UART0_IE.PCTEIE Position                */
#define UART_IE_PCTEIE(x)                        (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< UART0_IE.PCTEIE Field                   */
#define UART_IE_PTXIE_MASK                       (0x8U)                                              /*!< UART0_IE.PTXIE Mask                     */
#define UART_IE_PTXIE_SHIFT                      (3U)                                                /*!< UART0_IE.PTXIE Position                 */
#define UART_IE_PTXIE(x)                         (((uint8_t)(((uint8_t)(x))<<3U))&0x8UL)             /*!< UART0_IE.PTXIE Field                    */
#define UART_IE_PRXIE_MASK                       (0x10U)                                             /*!< UART0_IE.PRXIE Mask                     */
#define UART_IE_PRXIE_SHIFT                      (4U)                                                /*!< UART0_IE.PRXIE Position                 */
#define UART_IE_PRXIE(x)                         (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< UART0_IE.PRXIE Field                    */
#define UART_IE_ISDIE_MASK                       (0x20U)                                             /*!< UART0_IE.ISDIE Mask                     */
#define UART_IE_ISDIE_SHIFT                      (5U)                                                /*!< UART0_IE.ISDIE Position                 */
#define UART_IE_ISDIE(x)                         (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< UART0_IE.ISDIE Field                    */
#define UART_IE_WBEIE_MASK                       (0x40U)                                             /*!< UART0_IE.WBEIE Mask                     */
#define UART_IE_WBEIE_SHIFT                      (6U)                                                /*!< UART0_IE.WBEIE Position                 */
#define UART_IE_WBEIE(x)                         (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< UART0_IE.WBEIE Field                    */
/* ------- WB Bit Fields                            ------ */
#define UART_WB_WBASE_MASK                       (0xFFU)                                             /*!< UART0_WB.WBASE Mask                     */
#define UART_WB_WBASE_SHIFT                      (0U)                                                /*!< UART0_WB.WBASE Position                 */
#define UART_WB_WBASE(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_WB.WBASE Field                    */
/* ------- S3 Bit Fields                            ------ */
#define UART_S3_TXFF_MASK                        (0x1U)                                              /*!< UART0_S3.TXFF Mask                      */
#define UART_S3_TXFF_SHIFT                       (0U)                                                /*!< UART0_S3.TXFF Position                  */
#define UART_S3_TXFF(x)                          (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< UART0_S3.TXFF Field                     */
#define UART_S3_PSF_MASK                         (0x2U)                                              /*!< UART0_S3.PSF Mask                       */
#define UART_S3_PSF_SHIFT                        (1U)                                                /*!< UART0_S3.PSF Position                   */
#define UART_S3_PSF(x)                           (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< UART0_S3.PSF Field                      */
#define UART_S3_PCTEF_MASK                       (0x4U)                                              /*!< UART0_S3.PCTEF Mask                     */
#define UART_S3_PCTEF_SHIFT                      (2U)                                                /*!< UART0_S3.PCTEF Position                 */
#define UART_S3_PCTEF(x)                         (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< UART0_S3.PCTEF Field                    */
#define UART_S3_PTXF_MASK                        (0x8U)                                              /*!< UART0_S3.PTXF Mask                      */
#define UART_S3_PTXF_SHIFT                       (3U)                                                /*!< UART0_S3.PTXF Position                  */
#define UART_S3_PTXF(x)                          (((uint8_t)(((uint8_t)(x))<<3U))&0x8UL)             /*!< UART0_S3.PTXF Field                     */
#define UART_S3_PRXF_MASK                        (0x10U)                                             /*!< UART0_S3.PRXF Mask                      */
#define UART_S3_PRXF_SHIFT                       (4U)                                                /*!< UART0_S3.PRXF Position                  */
#define UART_S3_PRXF(x)                          (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< UART0_S3.PRXF Field                     */
#define UART_S3_ISD_MASK                         (0x20U)                                             /*!< UART0_S3.ISD Mask                       */
#define UART_S3_ISD_SHIFT                        (5U)                                                /*!< UART0_S3.ISD Position                   */
#define UART_S3_ISD(x)                           (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< UART0_S3.ISD Field                      */
#define UART_S3_WBEF_MASK                        (0x40U)                                             /*!< UART0_S3.WBEF Mask                      */
#define UART_S3_WBEF_SHIFT                       (6U)                                                /*!< UART0_S3.WBEF Position                  */
#define UART_S3_WBEF(x)                          (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< UART0_S3.WBEF Field                     */
#define UART_S3_PEF_MASK                         (0x80U)                                             /*!< UART0_S3.PEF Mask                       */
#define UART_S3_PEF_SHIFT                        (7U)                                                /*!< UART0_S3.PEF Position                   */
#define UART_S3_PEF(x)                           (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< UART0_S3.PEF Field                      */
/* ------- S4 Bit Fields                            ------ */
#define UART_S4_FE_MASK                          (0x1U)                                              /*!< UART0_S4.FE Mask                        */
#define UART_S4_FE_SHIFT                         (0U)                                                /*!< UART0_S4.FE Position                    */
#define UART_S4_FE(x)                            (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< UART0_S4.FE Field                       */
#define UART_S4_ILCV_MASK                        (0x2U)                                              /*!< UART0_S4.ILCV Mask                      */
#define UART_S4_ILCV_SHIFT                       (1U)                                                /*!< UART0_S4.ILCV Position                  */
#define UART_S4_ILCV(x)                          (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< UART0_S4.ILCV Field                     */
#define UART_S4_CDET_MASK                        (0xCU)                                              /*!< UART0_S4.CDET Mask                      */
#define UART_S4_CDET_SHIFT                       (2U)                                                /*!< UART0_S4.CDET Position                  */
#define UART_S4_CDET(x)                          (((uint8_t)(((uint8_t)(x))<<2U))&0xCUL)             /*!< UART0_S4.CDET Field                     */
#define UART_S4_INITF_MASK                       (0x10U)                                             /*!< UART0_S4.INITF Mask                     */
#define UART_S4_INITF_SHIFT                      (4U)                                                /*!< UART0_S4.INITF Position                 */
#define UART_S4_INITF(x)                         (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< UART0_S4.INITF Field                    */
/* ------- RPL Bit Fields                           ------ */
#define UART_RPL_RPL_MASK                        (0xFFU)                                             /*!< UART0_RPL.RPL Mask                      */
#define UART_RPL_RPL_SHIFT                       (0U)                                                /*!< UART0_RPL.RPL Position                  */
#define UART_RPL_RPL(x)                          (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_RPL.RPL Field                     */
/* ------- RPREL Bit Fields                         ------ */
#define UART_RPREL_RPREL_MASK                    (0xFFU)                                             /*!< UART0_RPREL.RPREL Mask                  */
#define UART_RPREL_RPREL_SHIFT                   (0U)                                                /*!< UART0_RPREL.RPREL Position              */
#define UART_RPREL_RPREL(x)                      (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_RPREL.RPREL Field                 */
/* ------- CPW Bit Fields                           ------ */
#define UART_CPW_CPW_MASK                        (0xFFU)                                             /*!< UART0_CPW.CPW Mask                      */
#define UART_CPW_CPW_SHIFT                       (0U)                                                /*!< UART0_CPW.CPW Position                  */
#define UART_CPW_CPW(x)                          (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_CPW.CPW Field                     */
/* ------- RIDT Bit Fields                          ------ */
#define UART_RIDT_RIDT_MASK                      (0xFFU)                                             /*!< UART0_RIDT.RIDT Mask                    */
#define UART_RIDT_RIDT_SHIFT                     (0U)                                                /*!< UART0_RIDT.RIDT Position                */
#define UART_RIDT_RIDT(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_RIDT.RIDT Field                   */
/* ------- TIDT Bit Fields                          ------ */
#define UART_TIDT_TIDT_MASK                      (0xFFU)                                             /*!< UART0_TIDT.TIDT Mask                    */
#define UART_TIDT_TIDT_SHIFT                     (0U)                                                /*!< UART0_TIDT.TIDT Position                */
#define UART_TIDT_TIDT(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< UART0_TIDT.TIDT Field                   */
/**
 * @} */ /* End group UART_Register_Masks_GROUP 
 */

/* UART0 - Peripheral instance base addresses */
#define UART0_BasePtr                  0x4006A000UL //!< Peripheral base address
#define UART0                          ((UART_Type *) UART0_BasePtr) //!< Freescale base pointer
#define UART0_BASE_PTR                 (UART0) //!< Freescale style base pointer
#define UART0_IRQS { UART0_Lon_IRQn, UART0_RxTx_IRQn, UART0_Error_IRQn,  }

/**
 * @} */ /* End group UART_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup UART_Peripheral_access_layer_GROUP UART Peripheral Access Layer
* @brief C Struct for UART
* @{
*/

/* ================================================================================ */
/* ================           UART1 (file:UART1_MK10F12_C7816)       ================ */
/* ================================================================================ */

/**
 * @brief Universal Asynchronous Receiver/Transmitter
 */
/**
* @addtogroup UART_structs_GROUP UART struct
* @brief Struct for UART
* @{
*/
typedef struct UART1_Type {
   __IO uint8_t   BDH;                          /**< 0000: Baud Rate Register: High                                     */
   __IO uint8_t   BDL;                          /**< 0001: Baud Rate Register: Low                                      */
   __IO uint8_t   C1;                           /**< 0002: Control Register 1                                           */
   __IO uint8_t   C2;                           /**< 0003: Control Register 2                                           */
   __I  uint8_t   S1;                           /**< 0004: Status Register 1                                            */
   __IO uint8_t   S2;                           /**< 0005: Status Register 2                                            */
   __IO uint8_t   C3;                           /**< 0006: Control Register 3                                           */
   __IO uint8_t   D;                            /**< 0007: Data Register                                                */
   __IO uint8_t   MA1;                          /**< 0008: Match Address Registers 1                                    */
   __IO uint8_t   MA2;                          /**< 0009: Match Address Registers 2                                    */
   __IO uint8_t   C4;                           /**< 000A: Control Register 4                                           */
   __IO uint8_t   C5;                           /**< 000B: Control Register 5                                           */
   __I  uint8_t   ED;                           /**< 000C: Extended Data Register                                       */
   __IO uint8_t   MODEM;                        /**< 000D: Modem Register                                               */
   __IO uint8_t   IR;                           /**< 000E: Infrared Register                                            */
        uint8_t   RESERVED_0;                   /**< 000F: 0x1 bytes                                                    */
   __IO uint8_t   PFIFO;                        /**< 0010: FIFO Parameters                                              */
   __IO uint8_t   CFIFO;                        /**< 0011: FIFO Control Register                                        */
   __IO uint8_t   SFIFO;                        /**< 0012: FIFO Status Register                                         */
   __IO uint8_t   TWFIFO;                       /**< 0013: FIFO Transmit Watermark                                      */
   __I  uint8_t   TCFIFO;                       /**< 0014: FIFO Transmit Count                                          */
   __IO uint8_t   RWFIFO;                       /**< 0015: FIFO Receive Watermark                                       */
   __I  uint8_t   RCFIFO;                       /**< 0016: FIFO Receive Count                                           */
        uint8_t   RESERVED_1;                   /**< 0017: 0x1 bytes                                                    */
   __IO uint8_t   C7816;                        /**< 0018: 7816 Control Register                                        */
   __IO uint8_t   IE7816;                       /**< 0019: 7816 Interrupt Enable Register                               */
   __IO uint8_t   IS7816;                       /**< 001A: 7816 Interrupt Status Register                               */
   union {                                      /**< 001B: (size=0001)                                                  */
      __IO uint8_t   WP7816T0;                  /**< 001B: 7816 Wait Parameter Register                                 */
      __IO uint8_t   WP7816T1;                  /**< 001B: 7816 Wait Parameter Register                                 */
   };
   __IO uint8_t   WN7816;                       /**< 001C: 7816 Wait N Register                                         */
   __IO uint8_t   WF7816;                       /**< 001D: 7816 Wait FD Register                                        */
   __IO uint8_t   ET7816;                       /**< 001E: 7816 Error Threshold Register                                */
   __IO uint8_t   TL7816;                       /**< 001F: 7816 Transmit Length Register                                */
} UART1_Type;

/**
 * @} */ /* End group UART_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'UART1' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

