podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
* @addtogroup USBDCD_Register_Masks_GROUP USBDCD Register Masks
* @brief Register Masks for USBDCD
* @{
*/
/* ------- CONTROL Bit Fields                       ------ */
#define USBDCD_CONTROL_IACK_MASK                 (0x1U)                                              /*!< USBDCD0_CONTROL.IACK Mask               */
#define USBDCD_CONTROL_IACK_SHIFT                (0U)                                                /*!< USBDCD0_CONTROL.IACK Position           */
#define USBDCD_CONTROL_IACK(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBDCD0_CONTROL.IACK Field              */
#define USBDCD_CONTROL_IF_MASK                   (0x100U)                                            /*!< USBDCD0_CONTROL.IF Mask                 */
#define USBDCD_CONTROL_IF_SHIFT                  (8U)                                                /*!< USBDCD0_CONTROL.IF Position             */
#define USBDCD_CONTROL_IF(x)                     (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< USBDCD0_CONTROL.IF Field                */
#define USBDCD_CONTROL_IE_MASK                   (0x10000U)                                          /*!< USBDCD0_CONTROL.IE Mask                 */
#define USBDCD_CONTROL_IE_SHIFT                  (16U)                                               /*!< USBDCD0_CONTROL.IE Position             */
#define USBDCD_CONTROL_IE(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< USBDCD0_CONTROL.IE Field                */
#define USBDCD_CONTROL_START_MASK                (0x1000000U)                                        /*!< USBDCD0_CONTROL.START Mask              */
#define USBDCD_CONTROL_START_SHIFT               (24U)                                               /*!< USBDCD0_CONTROL.START Position          */
#define USBDCD_CONTROL_START(x)                  (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< USBDCD0_CONTROL.START Field             */
#define USBDCD_CONTROL_SR_MASK                   (0x2000000U)                                        /*!< USBDCD0_CONTROL.SR Mask                 */
#define USBDCD_CONTROL_SR_SHIFT                  (25U)                                               /*!< USBDCD0_CONTROL.SR Position             */
#define USBDCD_CONTROL_SR(x)                     (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< USBDCD0_CONTROL.SR Field                */
/* ------- CLOCK Bit Fields                         ------ */
#define USBDCD_CLOCK_CLOCK_UNIT_MASK             (0x1U)                                              /*!< USBDCD0_CLOCK.CLOCK_UNIT Mask           */
#define USBDCD_CLOCK_CLOCK_UNIT_SHIFT            (0U)                                                /*!< USBDCD0_CLOCK.CLOCK_UNIT Position       */
#define USBDCD_CLOCK_CLOCK_UNIT(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBDCD0_CLOCK.CLOCK_UNIT Field          */
#define USBDCD_CLOCK_CLOCK_SPEED_MASK            (0xFFCU)                                            /*!< USBDCD0_CLOCK.CLOCK_SPEED Mask          */
#define USBDCD_CLOCK_CLOCK_SPEED_SHIFT           (2U)                                                /*!< USBDCD0_CLOCK.CLOCK_SPEED Position      */
#define USBDCD_CLOCK_CLOCK_SPEED(x)              (((uint32_t)(((uint32_t)(x))<<2U))&0xFFCUL)         /*!< USBDCD0_CLOCK.CLOCK_SPEED Field         */
/* ------- STATUS Bit Fields                        ------ */
#define USBDCD_STATUS_SEQ_RES_MASK               (0x30000U)                                          /*!< USBDCD0_STATUS.SEQ_RES Mask             */
#define USBDCD_STATUS_SEQ_RES_SHIFT              (16U)                                               /*!< USBDCD0_STATUS.SEQ_RES Position         */
#define USBDCD_STATUS_SEQ_RES(x)                 (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< USBDCD0_STATUS.SEQ_RES Field            */
#define USBDCD_STATUS_SEQ_STAT_MASK              (0xC0000U)                                          /*!< USBDCD0_STATUS.SEQ_STAT Mask            */
#define USBDCD_STATUS_SEQ_STAT_SHIFT             (18U)                                               /*!< USBDCD0_STATUS.SEQ_STAT Position        */
#define USBDCD_STATUS_SEQ_STAT(x)                (((uint32_t)(((uint32_t)(x))<<18U))&0xC0000UL)      /*!< USBDCD0_STATUS.SEQ_STAT Field           */
#define USBDCD_STATUS_ERR_MASK                   (0x100000U)                                         /*!< USBDCD0_STATUS.ERR Mask                 */
#define USBDCD_STATUS_ERR_SHIFT                  (20U)                                               /*!< USBDCD0_STATUS.ERR Position             */
#define USBDCD_STATUS_ERR(x)                     (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< USBDCD0_STATUS.ERR Field                */
#define USBDCD_STATUS_TO_MASK                    (0x200000U)                                         /*!< USBDCD0_STATUS.TO Mask                  */
#define USBDCD_STATUS_TO_SHIFT                   (21U)                                               /*!< USBDCD0_STATUS.TO Position              */
#define USBDCD_STATUS_TO(x)                      (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< USBDCD0_STATUS.TO Field                 */
#define USBDCD_STATUS_ACTIVE_MASK                (0x400000U)                                         /*!< USBDCD0_STATUS.ACTIVE Mask              */
#define USBDCD_STATUS_ACTIVE_SHIFT               (22U)                                               /*!< USBDCD0_STATUS.ACTIVE Position          */
#define USBDCD_STATUS_ACTIVE(x)                  (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< USBDCD0_STATUS.ACTIVE Field             */
/* ------- TIMER0 Bit Fields                        ------ */
#define USBDCD_TIMER0_TUNITCON_MASK              (0xFFFU)                                            /*!< USBDCD0_TIMER0.TUNITCON Mask            */
#define USBDCD_TIMER0_TUNITCON_SHIFT             (0U)                                                /*!< USBDCD0_TIMER0.TUNITCON Position        */
#define USBDCD_TIMER0_TUNITCON(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFUL)         /*!< USBDCD0_TIMER0.TUNITCON Field           */
#define USBDCD_TIMER0_TSEQ_INIT_MASK             (0x3FF0000U)                                        /*!< USBDCD0_TIMER0.TSEQ_INIT Mask           */
#define USBDCD_TIMER0_TSEQ_INIT_SHIFT            (16U)                                               /*!< USBDCD0_TIMER0.TSEQ_INIT Position       */
#define USBDCD_TIMER0_TSEQ_INIT(x)               (((uint32_t)(((uint32_t)(x))<<16U))&0x3FF0000UL)    /*!< USBDCD0_TIMER0.TSEQ_INIT Field          */
/* ------- TIMER1 Bit Fields                        ------ */
#define USBDCD_TIMER1_TVDPSRC_ON_MASK            (0x3FFU)                                            /*!< USBDCD0_TIMER1.TVDPSRC_ON Mask          */
#define USBDCD_TIMER1_TVDPSRC_ON_SHIFT           (0U)                                                /*!< USBDCD0_TIMER1.TVDPSRC_ON Position      */
#define USBDCD_TIMER1_TVDPSRC_ON(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFUL)         /*!< USBDCD0_TIMER1.TVDPSRC_ON Field         */
#define USBDCD_TIMER1_TDCD_DBNC_MASK             (0x3FF0000U)                                        /*!< USBDCD0_TIMER1.TDCD_DBNC Mask           */
#define USBDCD_TIMER1_TDCD_DBNC_SHIFT            (16U)                                               /*!< USBDCD0_TIMER1.TDCD_DBNC Position       */
#define USBDCD_TIMER1_TDCD_DBNC(x)               (((uint32_t)(((uint32_t)(x))<<16U))&0x3FF0000UL)    /*!< USBDCD0_TIMER1.TDCD_DBNC Field          */
/* ------- TIMER2 Bit Fields                        ------ */
#define USBDCD_TIMER2_CHECK_DM_MASK              (0xFU)                                              /*!< USBDCD0_TIMER2.CHECK_DM Mask            */
#define USBDCD_TIMER2_CHECK_DM_SHIFT             (0U)                                                /*!< USBDCD0_TIMER2.CHECK_DM Position        */
#define USBDCD_TIMER2_CHECK_DM(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< USBDCD0_TIMER2.CHECK_DM Field           */
#define USBDCD_TIMER2_TVDPSRC_CON_MASK           (0x3FF0000U)                                        /*!< USBDCD0_TIMER2.TVDPSRC_CON Mask         */
#define USBDCD_TIMER2_TVDPSRC_CON_SHIFT          (16U)                                               /*!< USBDCD0_TIMER2.TVDPSRC_CON Position     */
#define USBDCD_TIMER2_TVDPSRC_CON(x)             (((uint32_t)(((uint32_t)(x))<<16U))&0x3FF0000UL)    /*!< USBDCD0_TIMER2.TVDPSRC_CON Field        */
/**
 * @} */ /* End group USBDCD_Register_Masks_GROUP 
 */

/* USBDCD0 - Peripheral instance base addresses */
#define USBDCD0_BasePtr                0x40035000UL //!< Peripheral base address
#define USBDCD0                        ((USBDCD_Type *) USBDCD0_BasePtr) //!< Freescale base pointer
#define USBDCD0_BASE_PTR               (USBDCD0) //!< Freescale style base pointer
#define USBDCD0_IRQS { USBDCD0_IRQn,  }

/**
 * @} */ /* End group USBDCD_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup USBHS0_Peripheral_access_layer_GROUP USBHS0 Peripheral Access Layer
* @brief C Struct for USBHS0
* @{
*/

/* ================================================================================ */
/* ================           USBHS0 (file:USBHS0_4ENDPT)          ================ */
/* ================================================================================ */

/**
 * @brief USB HS/FS/LS OTG Controller
 */
/**
* @addtogroup USBHS0_structs_GROUP USBHS0 struct
* @brief Struct for USBHS0
* @{
*/
typedef struct USBHS_Type {
   __I  uint32_t  ID;                           /**< 0000: Identification Register                                      */
   __I  uint32_t  HWGENERAL;                    /**< 0004: General Hardware Parameters Register                         */
   __I  uint32_t  HWHOST;                       /**< 0008: Host Hardware Parameters Register                            */
   __I  uint32_t  HWDEVICE;                     /**< 000C: Device Hardware Parameters Register                          */
   __I  uint32_t  HWTXBUF;                      /**< 0010: Transmit Buffer Hardware Parameters Register                 */
   __I  uint32_t  HWRXBUF;                      /**< 0014: Receive Buffer Hardware Parameters Register                  */
        uint8_t   RESERVED_0[104];              /**< 0018: 0x68 bytes                                                   */
   __IO uint32_t  GPTIMER0LD;                   /**< 0080: General Purpose Timer n Load Register                        */
   __IO uint32_t  GPTIMER0CTL;                  /**< 0084: General Purpose Timer n Control Register                     */
   __IO uint32_t  GPTIMER1LD;                   /**< 0088: General Purpose Timer n Load Register                        */
   __IO uint32_t  GPTIMER1CTL;                  /**< 008C: General Purpose Timer n Control Register                     */
   __IO uint32_t  USB_SBUSCFG;                  /**< 0090: System Bus Interface Configuration Register                  */
        uint8_t   RESERVED_1[108];              /**< 0094: 0x6C bytes                                                   */
   __I  uint32_t  HCIVERSION;                   /**< 0100: Host Controller Interface Version and Capability Registers Length Register */
   __I  uint32_t  HCSPARAMS;                    /**< 0104: Host Controller Structural Parameters Register               */
   __I  uint32_t  HCCPARAMS;                    /**< 0108: Host Controller Capability Parameters Register               */
        uint8_t   RESERVED_2[22];               /**< 010C: 0x16 bytes                                                   */
   __I  uint16_t  DCIVERSION;                   /**< 0122: Device Controller Interface Version                          */
   __I  uint32_t  DCCPARAMS;                    /**< 0124: Device Controller Capability Parameters                      */
        uint8_t   RESERVED_3[24];               /**< 0128: 0x18 bytes                                                   */
   __IO uint32_t  USBCMD;                       /**< 0140: USB Command Register                                         */
   __IO uint32_t  USBSTS;                       /**< 0144: USB Status Register                                          */
   __IO uint32_t  USBINTR;                      /**< 0148: USB Interrupt Enable Register                                */
   __IO uint32_t  FRINDEX;                      /**< 014C: Frame Index Register                                         */
        uint8_t   RESERVED_4[4];                /**< 0150: 0x4 bytes                                                    */
   union {                                      /**< 0154: (size=0004)                                                  */
      __IO uint32_t  DEVICEADDR;                /**< 0154: Device Address Register                                      */
      __IO uint32_t  PERIODICLISTBASE;          /**< 0154: Periodic Frame List Base Address Register                    */
   };
   union {                                      /**< 0158: (size=0004)                                                  */
      __IO uint32_t  ASYNCLISTADDR;             /**< 0158: Current Asynchronous List Address Register                   */
      __IO uint32_t  EPLISTADDR;                /**< 0158: Endpoint List Address Register                               */
   };
   __I  uint32_t  TTCTRL;                       /**< 015C: Host TT Asynchronous Buffer Control                          */
   __IO uint32_t  BURSTSIZE;                    /**< 0160: Master Interface Data Burst Size Register                    */
   __IO uint32_t  TXFILLTUNING;                 /**< 0164: Transmit FIFO Tuning Control Register                        */
        uint8_t   RESERVED_5[8];                /**< 0168: 0x8 bytes                                                    */
   __IO uint32_t  ULPI_VIEWPORT;                /**< 0170: ULPI Register Access                                         */
        uint8_t   RESERVED_6[4];                /**< 0174: 0x4 bytes                                                    */
   __IO uint32_t  ENDPTNAK;                     /**< 0178: Endpoint NAK Register                                        */
   __IO uint32_t  ENDPTNAKEN;                   /**< 017C: Endpoint NAK Enable Register                                 */
   __I  uint32_t  CONFIGFLAG;                   /**< 0180: Configure Flag Register                                      */
   __IO uint32_t  PORTSC1;                      /**< 0184: Port Status and Control                                      */
        uint8_t   RESERVED_7[28];               /**< 0188: 0x1C bytes                                                   */
   __IO uint32_t  OTGSC;                        /**< 01A4: On-the-Go Status and Control Register                        */
   __IO uint32_t  USBMODE;                      /**< 01A8: USB Mode Register                                            */
   __IO uint32_t  EPSETUPSR;                    /**< 01AC: Endpoint Setup Status Register                               */
   __IO uint32_t  EPPRIME;                      /**< 01B0: Endpoint Initialization Register                             */
   __IO uint32_t  EPFLUSH;                      /**< 01B4: Endpoint Flush Register                                      */
   __I  uint32_t  EPSR;                         /**< 01B8: Endpoint Status Register                                     */
   __IO uint32_t  EPCOMPLETE;                   /**< 01BC: Endpoint Complete Register                                   */
   __IO uint32_t  EPCR0;                        /**< 01C0: Endpoint Control Register 0                                  */
   __IO uint32_t  EPCR1;                        /**< 01C4: Endpoint Control Register n                                  */
   __IO uint32_t  EPCR2;                        /**< 01C8: Endpoint Control Register n                                  */
   __IO uint32_t  EPCR3;                        /**< 01CC: Endpoint Control Register n                                  */
        uint8_t   RESERVED_8[48];               /**< 01D0: 0x30 bytes                                                   */
   __IO uint32_t  USBGENCTRL;                   /**< 0200: USB General Control Register                                 */
} USBHS_Type;

/**
 * @} */ /* End group USBHS0_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'USBHS0' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

