podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
/**
* @addtogroup USBHS0_Register_Masks_GROUP USBHS0 Register Masks
* @brief Register Masks for USBHS0
* @{
*/
/* ------- ID Bit Fields                            ------ */
#define USBHS_ID_ID_MASK                         (0x3FU)                                             /*!< USBHS0_ID.ID Mask                       */
#define USBHS_ID_ID_SHIFT                        (0U)                                                /*!< USBHS0_ID.ID Position                   */
#define USBHS_ID_ID(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0x3FUL)          /*!< USBHS0_ID.ID Field                      */
#define USBHS_ID_NID_MASK                        (0x3F00U)                                           /*!< USBHS0_ID.NID Mask                      */
#define USBHS_ID_NID_SHIFT                       (8U)                                                /*!< USBHS0_ID.NID Position                  */
#define USBHS_ID_NID(x)                          (((uint32_t)(((uint32_t)(x))<<8U))&0x3F00UL)        /*!< USBHS0_ID.NID Field                     */
#define USBHS_ID_TAG_MASK                        (0x1F0000U)                                         /*!< USBHS0_ID.TAG Mask                      */
#define USBHS_ID_TAG_SHIFT                       (16U)                                               /*!< USBHS0_ID.TAG Position                  */
#define USBHS_ID_TAG(x)                          (((uint32_t)(((uint32_t)(x))<<16U))&0x1F0000UL)     /*!< USBHS0_ID.TAG Field                     */
#define USBHS_ID_REVISION_MASK                   (0x1E00000U)                                        /*!< USBHS0_ID.REVISION Mask                 */
#define USBHS_ID_REVISION_SHIFT                  (21U)                                               /*!< USBHS0_ID.REVISION Position             */
#define USBHS_ID_REVISION(x)                     (((uint32_t)(((uint32_t)(x))<<21U))&0x1E00000UL)    /*!< USBHS0_ID.REVISION Field                */
#define USBHS_ID_VERSION_MASK                    (0x1E000000U)                                       /*!< USBHS0_ID.VERSION Mask                  */
#define USBHS_ID_VERSION_SHIFT                   (25U)                                               /*!< USBHS0_ID.VERSION Position              */
#define USBHS_ID_VERSION(x)                      (((uint32_t)(((uint32_t)(x))<<25U))&0x1E000000UL)   /*!< USBHS0_ID.VERSION Field                 */
#define USBHS_ID_VERSIONID_MASK                  (0xE0000000U)                                       /*!< USBHS0_ID.VERSIONID Mask                */
#define USBHS_ID_VERSIONID_SHIFT                 (29U)                                               /*!< USBHS0_ID.VERSIONID Position            */
#define USBHS_ID_VERSIONID(x)                    (((uint32_t)(((uint32_t)(x))<<29U))&0xE0000000UL)   /*!< USBHS0_ID.VERSIONID Field               */
/* ------- HWGENERAL Bit Fields                     ------ */
#define USBHS_HWGENERAL_PHYM_MASK                (0x1C0U)                                            /*!< USBHS0_HWGENERAL.PHYM Mask              */
#define USBHS_HWGENERAL_PHYM_SHIFT               (6U)                                                /*!< USBHS0_HWGENERAL.PHYM Position          */
#define USBHS_HWGENERAL_PHYM(x)                  (((uint32_t)(((uint32_t)(x))<<6U))&0x1C0UL)         /*!< USBHS0_HWGENERAL.PHYM Field             */
#define USBHS_HWGENERAL_SM_MASK                  (0x600U)                                            /*!< USBHS0_HWGENERAL.SM Mask                */
#define USBHS_HWGENERAL_SM_SHIFT                 (9U)                                                /*!< USBHS0_HWGENERAL.SM Position            */
#define USBHS_HWGENERAL_SM(x)                    (((uint32_t)(((uint32_t)(x))<<9U))&0x600UL)         /*!< USBHS0_HWGENERAL.SM Field               */
/* ------- HWHOST Bit Fields                        ------ */
#define USBHS_HWHOST_HC_MASK                     (0x1U)                                              /*!< USBHS0_HWHOST.HC Mask                   */
#define USBHS_HWHOST_HC_SHIFT                    (0U)                                                /*!< USBHS0_HWHOST.HC Position               */
#define USBHS_HWHOST_HC(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBHS0_HWHOST.HC Field                  */
#define USBHS_HWHOST_NPORT_MASK                  (0xEU)                                              /*!< USBHS0_HWHOST.NPORT Mask                */
#define USBHS_HWHOST_NPORT_SHIFT                 (1U)                                                /*!< USBHS0_HWHOST.NPORT Position            */
#define USBHS_HWHOST_NPORT(x)                    (((uint32_t)(((uint32_t)(x))<<1U))&0xEUL)           /*!< USBHS0_HWHOST.NPORT Field               */
#define USBHS_HWHOST_TTASY_MASK                  (0xFF0000U)                                         /*!< USBHS0_HWHOST.TTASY Mask                */
#define USBHS_HWHOST_TTASY_SHIFT                 (16U)                                               /*!< USBHS0_HWHOST.TTASY Position            */
#define USBHS_HWHOST_TTASY(x)                    (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< USBHS0_HWHOST.TTASY Field               */
#define USBHS_HWHOST_TTPER_MASK                  (0xFF000000U)                                       /*!< USBHS0_HWHOST.TTPER Mask                */
#define USBHS_HWHOST_TTPER_SHIFT                 (24U)                                               /*!< USBHS0_HWHOST.TTPER Position            */
#define USBHS_HWHOST_TTPER(x)                    (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< USBHS0_HWHOST.TTPER Field               */
/* ------- HWDEVICE Bit Fields                      ------ */
#define USBHS_HWDEVICE_DC_MASK                   (0x1U)                                              /*!< USBHS0_HWDEVICE.DC Mask                 */
#define USBHS_HWDEVICE_DC_SHIFT                  (0U)                                                /*!< USBHS0_HWDEVICE.DC Position             */
#define USBHS_HWDEVICE_DC(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBHS0_HWDEVICE.DC Field                */
#define USBHS_HWDEVICE_DEVEP_MASK                (0x3EU)                                             /*!< USBHS0_HWDEVICE.DEVEP Mask              */
#define USBHS_HWDEVICE_DEVEP_SHIFT               (1U)                                                /*!< USBHS0_HWDEVICE.DEVEP Position          */
#define USBHS_HWDEVICE_DEVEP(x)                  (((uint32_t)(((uint32_t)(x))<<1U))&0x3EUL)          /*!< USBHS0_HWDEVICE.DEVEP Field             */
/* ------- HWTXBUF Bit Fields                       ------ */
#define USBHS_HWTXBUF_TXBURST_MASK               (0xFFU)                                             /*!< USBHS0_HWTXBUF.TXBURST Mask             */
#define USBHS_HWTXBUF_TXBURST_SHIFT              (0U)                                                /*!< USBHS0_HWTXBUF.TXBURST Position         */
#define USBHS_HWTXBUF_TXBURST(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< USBHS0_HWTXBUF.TXBURST Field            */
#define USBHS_HWTXBUF_TXADD_MASK                 (0xFF00U)                                           /*!< USBHS0_HWTXBUF.TXADD Mask               */
#define USBHS_HWTXBUF_TXADD_SHIFT                (8U)                                                /*!< USBHS0_HWTXBUF.TXADD Position           */
#define USBHS_HWTXBUF_TXADD(x)                   (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< USBHS0_HWTXBUF.TXADD Field              */
#define USBHS_HWTXBUF_TXCHANADD_MASK             (0xFF0000U)                                         /*!< USBHS0_HWTXBUF.TXCHANADD Mask           */
#define USBHS_HWTXBUF_TXCHANADD_SHIFT            (16U)                                               /*!< USBHS0_HWTXBUF.TXCHANADD Position       */
#define USBHS_HWTXBUF_TXCHANADD(x)               (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< USBHS0_HWTXBUF.TXCHANADD Field          */
#define USBHS_HWTXBUF_TXLC_MASK                  (0x80000000U)                                       /*!< USBHS0_HWTXBUF.TXLC Mask                */
#define USBHS_HWTXBUF_TXLC_SHIFT                 (31U)                                               /*!< USBHS0_HWTXBUF.TXLC Position            */
#define USBHS_HWTXBUF_TXLC(x)                    (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< USBHS0_HWTXBUF.TXLC Field               */
/* ------- HWRXBUF Bit Fields                       ------ */
#define USBHS_HWRXBUF_RXBURST_MASK               (0xFFU)                                             /*!< USBHS0_HWRXBUF.RXBURST Mask             */
#define USBHS_HWRXBUF_RXBURST_SHIFT              (0U)                                                /*!< USBHS0_HWRXBUF.RXBURST Position         */
#define USBHS_HWRXBUF_RXBURST(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< USBHS0_HWRXBUF.RXBURST Field            */
#define USBHS_HWRXBUF_RXADD_MASK                 (0xFF00U)                                           /*!< USBHS0_HWRXBUF.RXADD Mask               */
#define USBHS_HWRXBUF_RXADD_SHIFT                (8U)                                                /*!< USBHS0_HWRXBUF.RXADD Position           */
#define USBHS_HWRXBUF_RXADD(x)                   (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< USBHS0_HWRXBUF.RXADD Field              */
/* ------- GPTIMER0LD Bit Fields                    ------ */
#define USBHS_GPTIMER0LD_GPTLD_MASK              (0xFFFFFFU)                                         /*!< USBHS0_GPTIMER0LD.GPTLD Mask            */
#define USBHS_GPTIMER0LD_GPTLD_SHIFT             (0U)                                                /*!< USBHS0_GPTIMER0LD.GPTLD Position        */
#define USBHS_GPTIMER0LD_GPTLD(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFUL)      /*!< USBHS0_GPTIMER0LD.GPTLD Field           */
/* ------- GPTIMER0CTL Bit Fields                   ------ */
#define USBHS_GPTIMER0CTL_GPTCNT_MASK            (0xFFFFFFU)                                         /*!< USBHS0_GPTIMER0CTL.GPTCNT Mask          */
#define USBHS_GPTIMER0CTL_GPTCNT_SHIFT           (0U)                                                /*!< USBHS0_GPTIMER0CTL.GPTCNT Position      */
#define USBHS_GPTIMER0CTL_GPTCNT(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFUL)      /*!< USBHS0_GPTIMER0CTL.GPTCNT Field         */
#define USBHS_GPTIMER0CTL_MODE_MASK              (0x1000000U)                                        /*!< USBHS0_GPTIMER0CTL.MODE Mask            */
#define USBHS_GPTIMER0CTL_MODE_SHIFT             (24U)                                               /*!< USBHS0_GPTIMER0CTL.MODE Position        */
#define USBHS_GPTIMER0CTL_MODE(x)                (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< USBHS0_GPTIMER0CTL.MODE Field           */
#define USBHS_GPTIMER0CTL_RST_MASK               (0x40000000U)                                       /*!< USBHS0_GPTIMER0CTL.RST Mask             */
#define USBHS_GPTIMER0CTL_RST_SHIFT              (30U)                                               /*!< USBHS0_GPTIMER0CTL.RST Position         */
#define USBHS_GPTIMER0CTL_RST(x)                 (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< USBHS0_GPTIMER0CTL.RST Field            */
#define USBHS_GPTIMER0CTL_RUN_MASK               (0x80000000U)                                       /*!< USBHS0_GPTIMER0CTL.RUN Mask             */
#define USBHS_GPTIMER0CTL_RUN_SHIFT              (31U)                                               /*!< USBHS0_GPTIMER0CTL.RUN Position         */
#define USBHS_GPTIMER0CTL_RUN(x)                 (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< USBHS0_GPTIMER0CTL.RUN Field            */
/* ------- GPTIMER1LD Bit Fields                    ------ */
#define USBHS_GPTIMER1LD_GPTLD_MASK              (0xFFFFFFU)                                         /*!< USBHS0_GPTIMER1LD.GPTLD Mask            */
#define USBHS_GPTIMER1LD_GPTLD_SHIFT             (0U)                                                /*!< USBHS0_GPTIMER1LD.GPTLD Position        */
#define USBHS_GPTIMER1LD_GPTLD(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFUL)      /*!< USBHS0_GPTIMER1LD.GPTLD Field           */
/* ------- GPTIMER1CTL Bit Fields                   ------ */
#define USBHS_GPTIMER1CTL_GPTCNT_MASK            (0xFFFFFFU)                                         /*!< USBHS0_GPTIMER1CTL.GPTCNT Mask          */
#define USBHS_GPTIMER1CTL_GPTCNT_SHIFT           (0U)                                                /*!< USBHS0_GPTIMER1CTL.GPTCNT Position      */
#define USBHS_GPTIMER1CTL_GPTCNT(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFUL)      /*!< USBHS0_GPTIMER1CTL.GPTCNT Field         */
#define USBHS_GPTIMER1CTL_MODE_MASK              (0x1000000U)                                        /*!< USBHS0_GPTIMER1CTL.MODE Mask            */
#define USBHS_GPTIMER1CTL_MODE_SHIFT             (24U)                                               /*!< USBHS0_GPTIMER1CTL.MODE Position        */
#define USBHS_GPTIMER1CTL_MODE(x)                (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< USBHS0_GPTIMER1CTL.MODE Field           */
#define USBHS_GPTIMER1CTL_RST_MASK               (0x40000000U)                                       /*!< USBHS0_GPTIMER1CTL.RST Mask             */
#define USBHS_GPTIMER1CTL_RST_SHIFT              (30U)                                               /*!< USBHS0_GPTIMER1CTL.RST Position         */
#define USBHS_GPTIMER1CTL_RST(x)                 (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< USBHS0_GPTIMER1CTL.RST Field            */
#define USBHS_GPTIMER1CTL_RUN_MASK               (0x80000000U)                                       /*!< USBHS0_GPTIMER1CTL.RUN Mask             */
#define USBHS_GPTIMER1CTL_RUN_SHIFT              (31U)                                               /*!< USBHS0_GPTIMER1CTL.RUN Position         */
#define USBHS_GPTIMER1CTL_RUN(x)                 (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< USBHS0_GPTIMER1CTL.RUN Field            */
/* ------- USB_SBUSCFG Bit Fields                   ------ */
#define USBHS_USB_SBUSCFG_BURSTMODE_MASK         (0x7U)                                              /*!< USBHS0_USB_SBUSCFG.BURSTMODE Mask       */
#define USBHS_USB_SBUSCFG_BURSTMODE_SHIFT        (0U)                                                /*!< USBHS0_USB_SBUSCFG.BURSTMODE Position   */
#define USBHS_USB_SBUSCFG_BURSTMODE(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< USBHS0_USB_SBUSCFG.BURSTMODE Field      */
/* ------- HCIVERSION Bit Fields                    ------ */
#define USBHS_HCIVERSION_CAPLENGTH_MASK          (0xFFU)                                             /*!< USBHS0_HCIVERSION.CAPLENGTH Mask        */
#define USBHS_HCIVERSION_CAPLENGTH_SHIFT         (0U)                                                /*!< USBHS0_HCIVERSION.CAPLENGTH Position    */
#define USBHS_HCIVERSION_CAPLENGTH(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< USBHS0_HCIVERSION.CAPLENGTH Field       */
#define USBHS_HCIVERSION_HCIVERSION_MASK         (0xFFFF0000U)                                       /*!< USBHS0_HCIVERSION.HCIVERSION Mask       */
#define USBHS_HCIVERSION_HCIVERSION_SHIFT        (16U)                                               /*!< USBHS0_HCIVERSION.HCIVERSION Position   */
#define USBHS_HCIVERSION_HCIVERSION(x)           (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< USBHS0_HCIVERSION.HCIVERSION Field      */
/* ------- HCSPARAMS Bit Fields                     ------ */
#define USBHS_HCSPARAMS_N_PORTS_MASK             (0xFU)                                              /*!< USBHS0_HCSPARAMS.N_PORTS Mask           */
#define USBHS_HCSPARAMS_N_PORTS_SHIFT            (0U)                                                /*!< USBHS0_HCSPARAMS.N_PORTS Position       */
#define USBHS_HCSPARAMS_N_PORTS(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< USBHS0_HCSPARAMS.N_PORTS Field          */
#define USBHS_HCSPARAMS_PPC_MASK                 (0x10U)                                             /*!< USBHS0_HCSPARAMS.PPC Mask               */
#define USBHS_HCSPARAMS_PPC_SHIFT                (4U)                                                /*!< USBHS0_HCSPARAMS.PPC Position           */
#define USBHS_HCSPARAMS_PPC(x)                   (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< USBHS0_HCSPARAMS.PPC Field              */
#define USBHS_HCSPARAMS_N_PCC_MASK               (0xF00U)                                            /*!< USBHS0_HCSPARAMS.N_PCC Mask             */
#define USBHS_HCSPARAMS_N_PCC_SHIFT              (8U)                                                /*!< USBHS0_HCSPARAMS.N_PCC Position         */
#define USBHS_HCSPARAMS_N_PCC(x)                 (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< USBHS0_HCSPARAMS.N_PCC Field            */
#define USBHS_HCSPARAMS_N_CC_MASK                (0xF000U)                                           /*!< USBHS0_HCSPARAMS.N_CC Mask              */
#define USBHS_HCSPARAMS_N_CC_SHIFT               (12U)                                               /*!< USBHS0_HCSPARAMS.N_CC Position          */
#define USBHS_HCSPARAMS_N_CC(x)                  (((uint32_t)(((uint32_t)(x))<<12U))&0xF000UL)       /*!< USBHS0_HCSPARAMS.N_CC Field             */
#define USBHS_HCSPARAMS_PI_MASK                  (0x10000U)                                          /*!< USBHS0_HCSPARAMS.PI Mask                */
#define USBHS_HCSPARAMS_PI_SHIFT                 (16U)                                               /*!< USBHS0_HCSPARAMS.PI Position            */
#define USBHS_HCSPARAMS_PI(x)                    (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< USBHS0_HCSPARAMS.PI Field               */
#define USBHS_HCSPARAMS_N_PTT_MASK               (0xF00000U)                                         /*!< USBHS0_HCSPARAMS.N_PTT Mask             */
#define USBHS_HCSPARAMS_N_PTT_SHIFT              (20U)                                               /*!< USBHS0_HCSPARAMS.N_PTT Position         */
#define USBHS_HCSPARAMS_N_PTT(x)                 (((uint32_t)(((uint32_t)(x))<<20U))&0xF00000UL)     /*!< USBHS0_HCSPARAMS.N_PTT Field            */
#define USBHS_HCSPARAMS_N_TT_MASK                (0xF000000U)                                        /*!< USBHS0_HCSPARAMS.N_TT Mask              */
#define USBHS_HCSPARAMS_N_TT_SHIFT               (24U)                                               /*!< USBHS0_HCSPARAMS.N_TT Position          */
#define USBHS_HCSPARAMS_N_TT(x)                  (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< USBHS0_HCSPARAMS.N_TT Field             */
/* ------- HCCPARAMS Bit Fields                     ------ */
#define USBHS_HCCPARAMS_ADC_MASK                 (0x1U)                                              /*!< USBHS0_HCCPARAMS.ADC Mask               */
#define USBHS_HCCPARAMS_ADC_SHIFT                (0U)                                                /*!< USBHS0_HCCPARAMS.ADC Position           */
#define USBHS_HCCPARAMS_ADC(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBHS0_HCCPARAMS.ADC Field              */
#define USBHS_HCCPARAMS_PFL_MASK                 (0x2U)                                              /*!< USBHS0_HCCPARAMS.PFL Mask               */
#define USBHS_HCCPARAMS_PFL_SHIFT                (1U)                                                /*!< USBHS0_HCCPARAMS.PFL Position           */
#define USBHS_HCCPARAMS_PFL(x)                   (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< USBHS0_HCCPARAMS.PFL Field              */
#define USBHS_HCCPARAMS_ASP_MASK                 (0x4U)                                              /*!< USBHS0_HCCPARAMS.ASP Mask               */
#define USBHS_HCCPARAMS_ASP_SHIFT                (2U)                                                /*!< USBHS0_HCCPARAMS.ASP Position           */
#define USBHS_HCCPARAMS_ASP(x)                   (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< USBHS0_HCCPARAMS.ASP Field              */
#define USBHS_HCCPARAMS_IST_MASK                 (0xF0U)                                             /*!< USBHS0_HCCPARAMS.IST Mask               */
#define USBHS_HCCPARAMS_IST_SHIFT                (4U)                                                /*!< USBHS0_HCCPARAMS.IST Position           */
#define USBHS_HCCPARAMS_IST(x)                   (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< USBHS0_HCCPARAMS.IST Field              */
#define USBHS_HCCPARAMS_EECP_MASK                (0xFF00U)                                           /*!< USBHS0_HCCPARAMS.EECP Mask              */
#define USBHS_HCCPARAMS_EECP_SHIFT               (8U)                                                /*!< USBHS0_HCCPARAMS.EECP Position          */
#define USBHS_HCCPARAMS_EECP(x)                  (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< USBHS0_HCCPARAMS.EECP Field             */
/* ------- DCIVERSION Bit Fields                    ------ */
#define USBHS_DCIVERSION_DCIVERSION_MASK         (0xFFFFU)                                           /*!< USBHS0_DCIVERSION.DCIVERSION Mask       */
#define USBHS_DCIVERSION_DCIVERSION_SHIFT        (0U)                                                /*!< USBHS0_DCIVERSION.DCIVERSION Position   */
#define USBHS_DCIVERSION_DCIVERSION(x)           (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< USBHS0_DCIVERSION.DCIVERSION Field      */
/* ------- DCCPARAMS Bit Fields                     ------ */
#define USBHS_DCCPARAMS_DEN_MASK                 (0x1FU)                                             /*!< USBHS0_DCCPARAMS.DEN Mask               */
#define USBHS_DCCPARAMS_DEN_SHIFT                (0U)                                                /*!< USBHS0_DCCPARAMS.DEN Position           */
#define USBHS_DCCPARAMS_DEN(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x1FUL)          /*!< USBHS0_DCCPARAMS.DEN Field              */
#define USBHS_DCCPARAMS_DC_MASK                  (0x80U)                                             /*!< USBHS0_DCCPARAMS.DC Mask                */
#define USBHS_DCCPARAMS_DC_SHIFT                 (7U)                                                /*!< USBHS0_DCCPARAMS.DC Position            */
#define USBHS_DCCPARAMS_DC(x)                    (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< USBHS0_DCCPARAMS.DC Field               */
#define USBHS_DCCPARAMS_HC_MASK                  (0x100U)                                            /*!< USBHS0_DCCPARAMS.HC Mask                */
#define USBHS_DCCPARAMS_HC_SHIFT                 (8U)                                                /*!< USBHS0_DCCPARAMS.HC Position            */
#define USBHS_DCCPARAMS_HC(x)                    (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< USBHS0_DCCPARAMS.HC Field               */
/* ------- USBCMD Bit Fields                        ------ */
#define USBHS_USBCMD_RS_MASK                     (0x1U)                                              /*!< USBHS0_USBCMD.RS Mask                   */
#define USBHS_USBCMD_RS_SHIFT                    (0U)                                                /*!< USBHS0_USBCMD.RS Position               */
#define USBHS_USBCMD_RS(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBHS0_USBCMD.RS Field                  */
#define USBHS_USBCMD_RST_MASK                    (0x2U)                                              /*!< USBHS0_USBCMD.RST Mask                  */
#define USBHS_USBCMD_RST_SHIFT                   (1U)                                                /*!< USBHS0_USBCMD.RST Position              */
#define USBHS_USBCMD_RST(x)                      (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< USBHS0_USBCMD.RST Field                 */
