podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define USBHS_USBCMD_FS_MASK                     (0xCU)                                              /*!< USBHS0_USBCMD.FS Mask                   */
#define USBHS_USBCMD_FS_SHIFT                    (2U)                                                /*!< USBHS0_USBCMD.FS Position               */
#define USBHS_USBCMD_FS(x)                       (((uint32_t)(((uint32_t)(x))<<2U))&0xCUL)           /*!< USBHS0_USBCMD.FS Field                  */
#define USBHS_USBCMD_PSE_MASK                    (0x10U)                                             /*!< USBHS0_USBCMD.PSE Mask                  */
#define USBHS_USBCMD_PSE_SHIFT                   (4U)                                                /*!< USBHS0_USBCMD.PSE Position              */
#define USBHS_USBCMD_PSE(x)                      (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< USBHS0_USBCMD.PSE Field                 */
#define USBHS_USBCMD_ASE_MASK                    (0x20U)                                             /*!< USBHS0_USBCMD.ASE Mask                  */
#define USBHS_USBCMD_ASE_SHIFT                   (5U)                                                /*!< USBHS0_USBCMD.ASE Position              */
#define USBHS_USBCMD_ASE(x)                      (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< USBHS0_USBCMD.ASE Field                 */
#define USBHS_USBCMD_IAA_MASK                    (0x40U)                                             /*!< USBHS0_USBCMD.IAA Mask                  */
#define USBHS_USBCMD_IAA_SHIFT                   (6U)                                                /*!< USBHS0_USBCMD.IAA Position              */
#define USBHS_USBCMD_IAA(x)                      (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< USBHS0_USBCMD.IAA Field                 */
#define USBHS_USBCMD_ASP_MASK                    (0x300U)                                            /*!< USBHS0_USBCMD.ASP Mask                  */
#define USBHS_USBCMD_ASP_SHIFT                   (8U)                                                /*!< USBHS0_USBCMD.ASP Position              */
#define USBHS_USBCMD_ASP(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x300UL)         /*!< USBHS0_USBCMD.ASP Field                 */
#define USBHS_USBCMD_ASPE_MASK                   (0x800U)                                            /*!< USBHS0_USBCMD.ASPE Mask                 */
#define USBHS_USBCMD_ASPE_SHIFT                  (11U)                                               /*!< USBHS0_USBCMD.ASPE Position             */
#define USBHS_USBCMD_ASPE(x)                     (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< USBHS0_USBCMD.ASPE Field                */
#define USBHS_USBCMD_SUTW_MASK                   (0x2000U)                                           /*!< USBHS0_USBCMD.SUTW Mask                 */
#define USBHS_USBCMD_SUTW_SHIFT                  (13U)                                               /*!< USBHS0_USBCMD.SUTW Position             */
#define USBHS_USBCMD_SUTW(x)                     (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< USBHS0_USBCMD.SUTW Field                */
#define USBHS_USBCMD_ATDTW_MASK                  (0x4000U)                                           /*!< USBHS0_USBCMD.ATDTW Mask                */
#define USBHS_USBCMD_ATDTW_SHIFT                 (14U)                                               /*!< USBHS0_USBCMD.ATDTW Position            */
#define USBHS_USBCMD_ATDTW(x)                    (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< USBHS0_USBCMD.ATDTW Field               */
#define USBHS_USBCMD_FS2_MASK                    (0x8000U)                                           /*!< USBHS0_USBCMD.FS2 Mask                  */
#define USBHS_USBCMD_FS2_SHIFT                   (15U)                                               /*!< USBHS0_USBCMD.FS2 Position              */
#define USBHS_USBCMD_FS2(x)                      (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< USBHS0_USBCMD.FS2 Field                 */
#define USBHS_USBCMD_ITC_MASK                    (0xFF0000U)                                         /*!< USBHS0_USBCMD.ITC Mask                  */
#define USBHS_USBCMD_ITC_SHIFT                   (16U)                                               /*!< USBHS0_USBCMD.ITC Position              */
#define USBHS_USBCMD_ITC(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< USBHS0_USBCMD.ITC Field                 */
/* ------- USBSTS Bit Fields                        ------ */
#define USBHS_USBSTS_UI_MASK                     (0x1U)                                              /*!< USBHS0_USBSTS.UI Mask                   */
#define USBHS_USBSTS_UI_SHIFT                    (0U)                                                /*!< USBHS0_USBSTS.UI Position               */
#define USBHS_USBSTS_UI(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBHS0_USBSTS.UI Field                  */
#define USBHS_USBSTS_UEI_MASK                    (0x2U)                                              /*!< USBHS0_USBSTS.UEI Mask                  */
#define USBHS_USBSTS_UEI_SHIFT                   (1U)                                                /*!< USBHS0_USBSTS.UEI Position              */
#define USBHS_USBSTS_UEI(x)                      (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< USBHS0_USBSTS.UEI Field                 */
#define USBHS_USBSTS_PCI_MASK                    (0x4U)                                              /*!< USBHS0_USBSTS.PCI Mask                  */
#define USBHS_USBSTS_PCI_SHIFT                   (2U)                                                /*!< USBHS0_USBSTS.PCI Position              */
#define USBHS_USBSTS_PCI(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< USBHS0_USBSTS.PCI Field                 */
#define USBHS_USBSTS_FRI_MASK                    (0x8U)                                              /*!< USBHS0_USBSTS.FRI Mask                  */
#define USBHS_USBSTS_FRI_SHIFT                   (3U)                                                /*!< USBHS0_USBSTS.FRI Position              */
#define USBHS_USBSTS_FRI(x)                      (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< USBHS0_USBSTS.FRI Field                 */
#define USBHS_USBSTS_SEI_MASK                    (0x10U)                                             /*!< USBHS0_USBSTS.SEI Mask                  */
#define USBHS_USBSTS_SEI_SHIFT                   (4U)                                                /*!< USBHS0_USBSTS.SEI Position              */
#define USBHS_USBSTS_SEI(x)                      (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< USBHS0_USBSTS.SEI Field                 */
#define USBHS_USBSTS_AAI_MASK                    (0x20U)                                             /*!< USBHS0_USBSTS.AAI Mask                  */
#define USBHS_USBSTS_AAI_SHIFT                   (5U)                                                /*!< USBHS0_USBSTS.AAI Position              */
#define USBHS_USBSTS_AAI(x)                      (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< USBHS0_USBSTS.AAI Field                 */
#define USBHS_USBSTS_URI_MASK                    (0x40U)                                             /*!< USBHS0_USBSTS.URI Mask                  */
#define USBHS_USBSTS_URI_SHIFT                   (6U)                                                /*!< USBHS0_USBSTS.URI Position              */
#define USBHS_USBSTS_URI(x)                      (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< USBHS0_USBSTS.URI Field                 */
#define USBHS_USBSTS_SRI_MASK                    (0x80U)                                             /*!< USBHS0_USBSTS.SRI Mask                  */
#define USBHS_USBSTS_SRI_SHIFT                   (7U)                                                /*!< USBHS0_USBSTS.SRI Position              */
#define USBHS_USBSTS_SRI(x)                      (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< USBHS0_USBSTS.SRI Field                 */
#define USBHS_USBSTS_SLI_MASK                    (0x100U)                                            /*!< USBHS0_USBSTS.SLI Mask                  */
#define USBHS_USBSTS_SLI_SHIFT                   (8U)                                                /*!< USBHS0_USBSTS.SLI Position              */
#define USBHS_USBSTS_SLI(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< USBHS0_USBSTS.SLI Field                 */
#define USBHS_USBSTS_ULPII_MASK                  (0x400U)                                            /*!< USBHS0_USBSTS.ULPII Mask                */
#define USBHS_USBSTS_ULPII_SHIFT                 (10U)                                               /*!< USBHS0_USBSTS.ULPII Position            */
#define USBHS_USBSTS_ULPII(x)                    (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< USBHS0_USBSTS.ULPII Field               */
#define USBHS_USBSTS_HCH_MASK                    (0x1000U)                                           /*!< USBHS0_USBSTS.HCH Mask                  */
#define USBHS_USBSTS_HCH_SHIFT                   (12U)                                               /*!< USBHS0_USBSTS.HCH Position              */
#define USBHS_USBSTS_HCH(x)                      (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< USBHS0_USBSTS.HCH Field                 */
#define USBHS_USBSTS_RCL_MASK                    (0x2000U)                                           /*!< USBHS0_USBSTS.RCL Mask                  */
#define USBHS_USBSTS_RCL_SHIFT                   (13U)                                               /*!< USBHS0_USBSTS.RCL Position              */
#define USBHS_USBSTS_RCL(x)                      (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< USBHS0_USBSTS.RCL Field                 */
#define USBHS_USBSTS_PS_MASK                     (0x4000U)                                           /*!< USBHS0_USBSTS.PS Mask                   */
#define USBHS_USBSTS_PS_SHIFT                    (14U)                                               /*!< USBHS0_USBSTS.PS Position               */
#define USBHS_USBSTS_PS(x)                       (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< USBHS0_USBSTS.PS Field                  */
#define USBHS_USBSTS_AS_MASK                     (0x8000U)                                           /*!< USBHS0_USBSTS.AS Mask                   */
#define USBHS_USBSTS_AS_SHIFT                    (15U)                                               /*!< USBHS0_USBSTS.AS Position               */
#define USBHS_USBSTS_AS(x)                       (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< USBHS0_USBSTS.AS Field                  */
#define USBHS_USBSTS_NAKI_MASK                   (0x10000U)                                          /*!< USBHS0_USBSTS.NAKI Mask                 */
#define USBHS_USBSTS_NAKI_SHIFT                  (16U)                                               /*!< USBHS0_USBSTS.NAKI Position             */
#define USBHS_USBSTS_NAKI(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< USBHS0_USBSTS.NAKI Field                */
#define USBHS_USBSTS_UAI_MASK                    (0x40000U)                                          /*!< USBHS0_USBSTS.UAI Mask                  */
#define USBHS_USBSTS_UAI_SHIFT                   (18U)                                               /*!< USBHS0_USBSTS.UAI Position              */
#define USBHS_USBSTS_UAI(x)                      (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< USBHS0_USBSTS.UAI Field                 */
#define USBHS_USBSTS_UPI_MASK                    (0x80000U)                                          /*!< USBHS0_USBSTS.UPI Mask                  */
#define USBHS_USBSTS_UPI_SHIFT                   (19U)                                               /*!< USBHS0_USBSTS.UPI Position              */
#define USBHS_USBSTS_UPI(x)                      (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< USBHS0_USBSTS.UPI Field                 */
#define USBHS_USBSTS_TI0_MASK                    (0x1000000U)                                        /*!< USBHS0_USBSTS.TI0 Mask                  */
#define USBHS_USBSTS_TI0_SHIFT                   (24U)                                               /*!< USBHS0_USBSTS.TI0 Position              */
#define USBHS_USBSTS_TI0(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< USBHS0_USBSTS.TI0 Field                 */
#define USBHS_USBSTS_TI1_MASK                    (0x2000000U)                                        /*!< USBHS0_USBSTS.TI1 Mask                  */
#define USBHS_USBSTS_TI1_SHIFT                   (25U)                                               /*!< USBHS0_USBSTS.TI1 Position              */
#define USBHS_USBSTS_TI1(x)                      (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< USBHS0_USBSTS.TI1 Field                 */
/* ------- USBINTR Bit Fields                       ------ */
#define USBHS_USBINTR_UE_MASK                    (0x1U)                                              /*!< USBHS0_USBINTR.UE Mask                  */
#define USBHS_USBINTR_UE_SHIFT                   (0U)                                                /*!< USBHS0_USBINTR.UE Position              */
#define USBHS_USBINTR_UE(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBHS0_USBINTR.UE Field                 */
#define USBHS_USBINTR_UEE_MASK                   (0x2U)                                              /*!< USBHS0_USBINTR.UEE Mask                 */
#define USBHS_USBINTR_UEE_SHIFT                  (1U)                                                /*!< USBHS0_USBINTR.UEE Position             */
#define USBHS_USBINTR_UEE(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< USBHS0_USBINTR.UEE Field                */
#define USBHS_USBINTR_PCE_MASK                   (0x4U)                                              /*!< USBHS0_USBINTR.PCE Mask                 */
#define USBHS_USBINTR_PCE_SHIFT                  (2U)                                                /*!< USBHS0_USBINTR.PCE Position             */
#define USBHS_USBINTR_PCE(x)                     (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< USBHS0_USBINTR.PCE Field                */
#define USBHS_USBINTR_FRE_MASK                   (0x8U)                                              /*!< USBHS0_USBINTR.FRE Mask                 */
#define USBHS_USBINTR_FRE_SHIFT                  (3U)                                                /*!< USBHS0_USBINTR.FRE Position             */
#define USBHS_USBINTR_FRE(x)                     (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< USBHS0_USBINTR.FRE Field                */
#define USBHS_USBINTR_SEE_MASK                   (0x10U)                                             /*!< USBHS0_USBINTR.SEE Mask                 */
#define USBHS_USBINTR_SEE_SHIFT                  (4U)                                                /*!< USBHS0_USBINTR.SEE Position             */
#define USBHS_USBINTR_SEE(x)                     (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< USBHS0_USBINTR.SEE Field                */
#define USBHS_USBINTR_AAE_MASK                   (0x20U)                                             /*!< USBHS0_USBINTR.AAE Mask                 */
#define USBHS_USBINTR_AAE_SHIFT                  (5U)                                                /*!< USBHS0_USBINTR.AAE Position             */
#define USBHS_USBINTR_AAE(x)                     (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< USBHS0_USBINTR.AAE Field                */
#define USBHS_USBINTR_URE_MASK                   (0x40U)                                             /*!< USBHS0_USBINTR.URE Mask                 */
#define USBHS_USBINTR_URE_SHIFT                  (6U)                                                /*!< USBHS0_USBINTR.URE Position             */
#define USBHS_USBINTR_URE(x)                     (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< USBHS0_USBINTR.URE Field                */
#define USBHS_USBINTR_SRE_MASK                   (0x80U)                                             /*!< USBHS0_USBINTR.SRE Mask                 */
#define USBHS_USBINTR_SRE_SHIFT                  (7U)                                                /*!< USBHS0_USBINTR.SRE Position             */
#define USBHS_USBINTR_SRE(x)                     (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< USBHS0_USBINTR.SRE Field                */
#define USBHS_USBINTR_SLE_MASK                   (0x100U)                                            /*!< USBHS0_USBINTR.SLE Mask                 */
#define USBHS_USBINTR_SLE_SHIFT                  (8U)                                                /*!< USBHS0_USBINTR.SLE Position             */
#define USBHS_USBINTR_SLE(x)                     (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< USBHS0_USBINTR.SLE Field                */
#define USBHS_USBINTR_ULPIE_MASK                 (0x400U)                                            /*!< USBHS0_USBINTR.ULPIE Mask               */
#define USBHS_USBINTR_ULPIE_SHIFT                (10U)                                               /*!< USBHS0_USBINTR.ULPIE Position           */
#define USBHS_USBINTR_ULPIE(x)                   (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< USBHS0_USBINTR.ULPIE Field              */
#define USBHS_USBINTR_NAKE_MASK                  (0x10000U)                                          /*!< USBHS0_USBINTR.NAKE Mask                */
#define USBHS_USBINTR_NAKE_SHIFT                 (16U)                                               /*!< USBHS0_USBINTR.NAKE Position            */
#define USBHS_USBINTR_NAKE(x)                    (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< USBHS0_USBINTR.NAKE Field               */
#define USBHS_USBINTR_UAIE_MASK                  (0x40000U)                                          /*!< USBHS0_USBINTR.UAIE Mask                */
#define USBHS_USBINTR_UAIE_SHIFT                 (18U)                                               /*!< USBHS0_USBINTR.UAIE Position            */
#define USBHS_USBINTR_UAIE(x)                    (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< USBHS0_USBINTR.UAIE Field               */
#define USBHS_USBINTR_UPIE_MASK                  (0x80000U)                                          /*!< USBHS0_USBINTR.UPIE Mask                */
#define USBHS_USBINTR_UPIE_SHIFT                 (19U)                                               /*!< USBHS0_USBINTR.UPIE Position            */
#define USBHS_USBINTR_UPIE(x)                    (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< USBHS0_USBINTR.UPIE Field               */
#define USBHS_USBINTR_TIE0_MASK                  (0x1000000U)                                        /*!< USBHS0_USBINTR.TIE0 Mask                */
#define USBHS_USBINTR_TIE0_SHIFT                 (24U)                                               /*!< USBHS0_USBINTR.TIE0 Position            */
#define USBHS_USBINTR_TIE0(x)                    (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< USBHS0_USBINTR.TIE0 Field               */
#define USBHS_USBINTR_TIE1_MASK                  (0x2000000U)                                        /*!< USBHS0_USBINTR.TIE1 Mask                */
#define USBHS_USBINTR_TIE1_SHIFT                 (25U)                                               /*!< USBHS0_USBINTR.TIE1 Position            */
#define USBHS_USBINTR_TIE1(x)                    (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< USBHS0_USBINTR.TIE1 Field               */
/* ------- FRINDEX Bit Fields                       ------ */
#define USBHS_FRINDEX_FRINDEX_MASK               (0x3FFFU)                                           /*!< USBHS0_FRINDEX.FRINDEX Mask             */
#define USBHS_FRINDEX_FRINDEX_SHIFT              (0U)                                                /*!< USBHS0_FRINDEX.FRINDEX Position         */
#define USBHS_FRINDEX_FRINDEX(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0x3FFFUL)        /*!< USBHS0_FRINDEX.FRINDEX Field            */
#define USBHS_FRINDEX_Reserved_MASK              (0xFFFFC000U)                                       /*!< USBHS0_FRINDEX.Reserved Mask            */
#define USBHS_FRINDEX_Reserved_SHIFT             (14U)                                               /*!< USBHS0_FRINDEX.Reserved Position        */
#define USBHS_FRINDEX_Reserved(x)                (((uint32_t)(((uint32_t)(x))<<14U))&0xFFFFC000UL)   /*!< USBHS0_FRINDEX.Reserved Field           */
/* ------- DEVICEADDR Bit Fields                    ------ */
#define USBHS_DEVICEADDR_USBADRA_MASK            (0x1000000U)                                        /*!< USBHS0_DEVICEADDR.USBADRA Mask          */
#define USBHS_DEVICEADDR_USBADRA_SHIFT           (24U)                                               /*!< USBHS0_DEVICEADDR.USBADRA Position      */
#define USBHS_DEVICEADDR_USBADRA(x)              (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< USBHS0_DEVICEADDR.USBADRA Field         */
#define USBHS_DEVICEADDR_USBADR_MASK             (0xFE000000U)                                       /*!< USBHS0_DEVICEADDR.USBADR Mask           */
#define USBHS_DEVICEADDR_USBADR_SHIFT            (25U)                                               /*!< USBHS0_DEVICEADDR.USBADR Position       */
#define USBHS_DEVICEADDR_USBADR(x)               (((uint32_t)(((uint32_t)(x))<<25U))&0xFE000000UL)   /*!< USBHS0_DEVICEADDR.USBADR Field          */
/* ------- PERIODICLISTBASE Bit Fields              ------ */
#define USBHS_PERIODICLISTBASE_PERBASE_MASK      (0xFFFFF000U)                                       /*!< USBHS0_PERIODICLISTBASE.PERBASE Mask    */
#define USBHS_PERIODICLISTBASE_PERBASE_SHIFT     (12U)                                               /*!< USBHS0_PERIODICLISTBASE.PERBASE Position*/
#define USBHS_PERIODICLISTBASE_PERBASE(x)        (((uint32_t)(((uint32_t)(x))<<12U))&0xFFFFF000UL)   /*!< USBHS0_PERIODICLISTBASE.PERBASE Field   */
/* ------- ASYNCLISTADDR Bit Fields                 ------ */
#define USBHS_ASYNCLISTADDR_ASYBASE_MASK         (0xFFFFFFE0U)                                       /*!< USBHS0_ASYNCLISTADDR.ASYBASE Mask       */
#define USBHS_ASYNCLISTADDR_ASYBASE_SHIFT        (5U)                                                /*!< USBHS0_ASYNCLISTADDR.ASYBASE Position   */
#define USBHS_ASYNCLISTADDR_ASYBASE(x)           (((uint32_t)(((uint32_t)(x))<<5U))&0xFFFFFFE0UL)    /*!< USBHS0_ASYNCLISTADDR.ASYBASE Field      */
/* ------- EPLISTADDR Bit Fields                    ------ */
#define USBHS_EPLISTADDR_EPBASE_MASK             (0xFFFFF800U)                                       /*!< USBHS0_EPLISTADDR.EPBASE Mask           */
#define USBHS_EPLISTADDR_EPBASE_SHIFT            (11U)                                               /*!< USBHS0_EPLISTADDR.EPBASE Position       */
#define USBHS_EPLISTADDR_EPBASE(x)               (((uint32_t)(((uint32_t)(x))<<11U))&0xFFFFF800UL)   /*!< USBHS0_EPLISTADDR.EPBASE Field          */
/* ------- TTCTRL Bit Fields                        ------ */
#define USBHS_TTCTRL_TTHA_MASK                   (0x7F000000U)                                       /*!< USBHS0_TTCTRL.TTHA Mask                 */
#define USBHS_TTCTRL_TTHA_SHIFT                  (24U)                                               /*!< USBHS0_TTCTRL.TTHA Position             */
#define USBHS_TTCTRL_TTHA(x)                     (((uint32_t)(((uint32_t)(x))<<24U))&0x7F000000UL)   /*!< USBHS0_TTCTRL.TTHA Field                */
#define USBHS_TTCTRL_Reserved_MASK               (0x80000000U)                                       /*!< USBHS0_TTCTRL.Reserved Mask             */
