podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define USBHS_TTCTRL_Reserved_SHIFT              (31U)                                               /*!< USBHS0_TTCTRL.Reserved Position         */
#define USBHS_TTCTRL_Reserved(x)                 (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< USBHS0_TTCTRL.Reserved Field            */
/* ------- BURSTSIZE Bit Fields                     ------ */
#define USBHS_BURSTSIZE_RXPBURST_MASK            (0xFFU)                                             /*!< USBHS0_BURSTSIZE.RXPBURST Mask          */
#define USBHS_BURSTSIZE_RXPBURST_SHIFT           (0U)                                                /*!< USBHS0_BURSTSIZE.RXPBURST Position      */
#define USBHS_BURSTSIZE_RXPBURST(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< USBHS0_BURSTSIZE.RXPBURST Field         */
#define USBHS_BURSTSIZE_TXPBURST_MASK            (0xFF00U)                                           /*!< USBHS0_BURSTSIZE.TXPBURST Mask          */
#define USBHS_BURSTSIZE_TXPBURST_SHIFT           (8U)                                                /*!< USBHS0_BURSTSIZE.TXPBURST Position      */
#define USBHS_BURSTSIZE_TXPBURST(x)              (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< USBHS0_BURSTSIZE.TXPBURST Field         */
/* ------- TXFILLTUNING Bit Fields                  ------ */
#define USBHS_TXFILLTUNING_TXSCHOH_MASK          (0x7FU)                                             /*!< USBHS0_TXFILLTUNING.TXSCHOH Mask        */
#define USBHS_TXFILLTUNING_TXSCHOH_SHIFT         (0U)                                                /*!< USBHS0_TXFILLTUNING.TXSCHOH Position    */
#define USBHS_TXFILLTUNING_TXSCHOH(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0x7FUL)          /*!< USBHS0_TXFILLTUNING.TXSCHOH Field       */
#define USBHS_TXFILLTUNING_TXSCHHEALTH_MASK      (0x1F00U)                                           /*!< USBHS0_TXFILLTUNING.TXSCHHEALTH Mask    */
#define USBHS_TXFILLTUNING_TXSCHHEALTH_SHIFT     (8U)                                                /*!< USBHS0_TXFILLTUNING.TXSCHHEALTH Position*/
#define USBHS_TXFILLTUNING_TXSCHHEALTH(x)        (((uint32_t)(((uint32_t)(x))<<8U))&0x1F00UL)        /*!< USBHS0_TXFILLTUNING.TXSCHHEALTH Field   */
#define USBHS_TXFILLTUNING_TXFIFOTHRES_MASK      (0x3F0000U)                                         /*!< USBHS0_TXFILLTUNING.TXFIFOTHRES Mask    */
#define USBHS_TXFILLTUNING_TXFIFOTHRES_SHIFT     (16U)                                               /*!< USBHS0_TXFILLTUNING.TXFIFOTHRES Position*/
#define USBHS_TXFILLTUNING_TXFIFOTHRES(x)        (((uint32_t)(((uint32_t)(x))<<16U))&0x3F0000UL)     /*!< USBHS0_TXFILLTUNING.TXFIFOTHRES Field   */
/* ------- ULPI_VIEWPORT Bit Fields                 ------ */
#define USBHS_ULPI_VIEWPORT_ULPI_DATWR_MASK      (0xFFU)                                             /*!< USBHS0_ULPI_VIEWPORT.ULPI_DATWR Mask    */
#define USBHS_ULPI_VIEWPORT_ULPI_DATWR_SHIFT     (0U)                                                /*!< USBHS0_ULPI_VIEWPORT.ULPI_DATWR Position*/
#define USBHS_ULPI_VIEWPORT_ULPI_DATWR(x)        (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< USBHS0_ULPI_VIEWPORT.ULPI_DATWR Field   */
#define USBHS_ULPI_VIEWPORT_ULPI_DATRD_MASK      (0xFF00U)                                           /*!< USBHS0_ULPI_VIEWPORT.ULPI_DATRD Mask    */
#define USBHS_ULPI_VIEWPORT_ULPI_DATRD_SHIFT     (8U)                                                /*!< USBHS0_ULPI_VIEWPORT.ULPI_DATRD Position*/
#define USBHS_ULPI_VIEWPORT_ULPI_DATRD(x)        (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< USBHS0_ULPI_VIEWPORT.ULPI_DATRD Field   */
#define USBHS_ULPI_VIEWPORT_ULPI_ADDR_MASK       (0xFF0000U)                                         /*!< USBHS0_ULPI_VIEWPORT.ULPI_ADDR Mask     */
#define USBHS_ULPI_VIEWPORT_ULPI_ADDR_SHIFT      (16U)                                               /*!< USBHS0_ULPI_VIEWPORT.ULPI_ADDR Position */
#define USBHS_ULPI_VIEWPORT_ULPI_ADDR(x)         (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< USBHS0_ULPI_VIEWPORT.ULPI_ADDR Field    */
#define USBHS_ULPI_VIEWPORT_ULPI_PORT_MASK       (0x7000000U)                                        /*!< USBHS0_ULPI_VIEWPORT.ULPI_PORT Mask     */
#define USBHS_ULPI_VIEWPORT_ULPI_PORT_SHIFT      (24U)                                               /*!< USBHS0_ULPI_VIEWPORT.ULPI_PORT Position */
#define USBHS_ULPI_VIEWPORT_ULPI_PORT(x)         (((uint32_t)(((uint32_t)(x))<<24U))&0x7000000UL)    /*!< USBHS0_ULPI_VIEWPORT.ULPI_PORT Field    */
#define USBHS_ULPI_VIEWPORT_ULPI_SS_MASK         (0x8000000U)                                        /*!< USBHS0_ULPI_VIEWPORT.ULPI_SS Mask       */
#define USBHS_ULPI_VIEWPORT_ULPI_SS_SHIFT        (27U)                                               /*!< USBHS0_ULPI_VIEWPORT.ULPI_SS Position   */
#define USBHS_ULPI_VIEWPORT_ULPI_SS(x)           (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< USBHS0_ULPI_VIEWPORT.ULPI_SS Field      */
#define USBHS_ULPI_VIEWPORT_ULPI_RW_MASK         (0x20000000U)                                       /*!< USBHS0_ULPI_VIEWPORT.ULPI_RW Mask       */
#define USBHS_ULPI_VIEWPORT_ULPI_RW_SHIFT        (29U)                                               /*!< USBHS0_ULPI_VIEWPORT.ULPI_RW Position   */
#define USBHS_ULPI_VIEWPORT_ULPI_RW(x)           (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< USBHS0_ULPI_VIEWPORT.ULPI_RW Field      */
#define USBHS_ULPI_VIEWPORT_ULPI_RUN_MASK        (0x40000000U)                                       /*!< USBHS0_ULPI_VIEWPORT.ULPI_RUN Mask      */
#define USBHS_ULPI_VIEWPORT_ULPI_RUN_SHIFT       (30U)                                               /*!< USBHS0_ULPI_VIEWPORT.ULPI_RUN Position  */
#define USBHS_ULPI_VIEWPORT_ULPI_RUN(x)          (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< USBHS0_ULPI_VIEWPORT.ULPI_RUN Field     */
#define USBHS_ULPI_VIEWPORT_ULPI_WU_MASK         (0x80000000U)                                       /*!< USBHS0_ULPI_VIEWPORT.ULPI_WU Mask       */
#define USBHS_ULPI_VIEWPORT_ULPI_WU_SHIFT        (31U)                                               /*!< USBHS0_ULPI_VIEWPORT.ULPI_WU Position   */
#define USBHS_ULPI_VIEWPORT_ULPI_WU(x)           (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< USBHS0_ULPI_VIEWPORT.ULPI_WU Field      */
/* ------- ENDPTNAK Bit Fields                      ------ */
#define USBHS_ENDPTNAK_EPRN_MASK                 (0xFU)                                              /*!< USBHS0_ENDPTNAK.EPRN Mask               */
#define USBHS_ENDPTNAK_EPRN_SHIFT                (0U)                                                /*!< USBHS0_ENDPTNAK.EPRN Position           */
#define USBHS_ENDPTNAK_EPRN(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< USBHS0_ENDPTNAK.EPRN Field              */
#define USBHS_ENDPTNAK_EPTN_MASK                 (0xF0000U)                                          /*!< USBHS0_ENDPTNAK.EPTN Mask               */
#define USBHS_ENDPTNAK_EPTN_SHIFT                (16U)                                               /*!< USBHS0_ENDPTNAK.EPTN Position           */
#define USBHS_ENDPTNAK_EPTN(x)                   (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< USBHS0_ENDPTNAK.EPTN Field              */
/* ------- ENDPTNAKEN Bit Fields                    ------ */
#define USBHS_ENDPTNAKEN_EPRNE_MASK              (0xFU)                                              /*!< USBHS0_ENDPTNAKEN.EPRNE Mask            */
#define USBHS_ENDPTNAKEN_EPRNE_SHIFT             (0U)                                                /*!< USBHS0_ENDPTNAKEN.EPRNE Position        */
#define USBHS_ENDPTNAKEN_EPRNE(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< USBHS0_ENDPTNAKEN.EPRNE Field           */
#define USBHS_ENDPTNAKEN_EPTNE_MASK              (0xF0000U)                                          /*!< USBHS0_ENDPTNAKEN.EPTNE Mask            */
#define USBHS_ENDPTNAKEN_EPTNE_SHIFT             (16U)                                               /*!< USBHS0_ENDPTNAKEN.EPTNE Position        */
#define USBHS_ENDPTNAKEN_EPTNE(x)                (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< USBHS0_ENDPTNAKEN.EPTNE Field           */
/* ------- CONFIGFLAG Bit Fields                    ------ */
/* ------- PORTSC1 Bit Fields                       ------ */
#define USBHS_PORTSC1_CCS_MASK                   (0x1U)                                              /*!< USBHS0_PORTSC1.CCS Mask                 */
#define USBHS_PORTSC1_CCS_SHIFT                  (0U)                                                /*!< USBHS0_PORTSC1.CCS Position             */
#define USBHS_PORTSC1_CCS(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBHS0_PORTSC1.CCS Field                */
#define USBHS_PORTSC1_CSC_MASK                   (0x2U)                                              /*!< USBHS0_PORTSC1.CSC Mask                 */
#define USBHS_PORTSC1_CSC_SHIFT                  (1U)                                                /*!< USBHS0_PORTSC1.CSC Position             */
#define USBHS_PORTSC1_CSC(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< USBHS0_PORTSC1.CSC Field                */
#define USBHS_PORTSC1_PE_MASK                    (0x4U)                                              /*!< USBHS0_PORTSC1.PE Mask                  */
#define USBHS_PORTSC1_PE_SHIFT                   (2U)                                                /*!< USBHS0_PORTSC1.PE Position              */
#define USBHS_PORTSC1_PE(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< USBHS0_PORTSC1.PE Field                 */
#define USBHS_PORTSC1_PEC_MASK                   (0x8U)                                              /*!< USBHS0_PORTSC1.PEC Mask                 */
#define USBHS_PORTSC1_PEC_SHIFT                  (3U)                                                /*!< USBHS0_PORTSC1.PEC Position             */
#define USBHS_PORTSC1_PEC(x)                     (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< USBHS0_PORTSC1.PEC Field                */
#define USBHS_PORTSC1_OCA_MASK                   (0x10U)                                             /*!< USBHS0_PORTSC1.OCA Mask                 */
#define USBHS_PORTSC1_OCA_SHIFT                  (4U)                                                /*!< USBHS0_PORTSC1.OCA Position             */
#define USBHS_PORTSC1_OCA(x)                     (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< USBHS0_PORTSC1.OCA Field                */
#define USBHS_PORTSC1_OCC_MASK                   (0x20U)                                             /*!< USBHS0_PORTSC1.OCC Mask                 */
#define USBHS_PORTSC1_OCC_SHIFT                  (5U)                                                /*!< USBHS0_PORTSC1.OCC Position             */
#define USBHS_PORTSC1_OCC(x)                     (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< USBHS0_PORTSC1.OCC Field                */
#define USBHS_PORTSC1_FPR_MASK                   (0x40U)                                             /*!< USBHS0_PORTSC1.FPR Mask                 */
#define USBHS_PORTSC1_FPR_SHIFT                  (6U)                                                /*!< USBHS0_PORTSC1.FPR Position             */
#define USBHS_PORTSC1_FPR(x)                     (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< USBHS0_PORTSC1.FPR Field                */
#define USBHS_PORTSC1_SUSP_MASK                  (0x80U)                                             /*!< USBHS0_PORTSC1.SUSP Mask                */
#define USBHS_PORTSC1_SUSP_SHIFT                 (7U)                                                /*!< USBHS0_PORTSC1.SUSP Position            */
#define USBHS_PORTSC1_SUSP(x)                    (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< USBHS0_PORTSC1.SUSP Field               */
#define USBHS_PORTSC1_PR_MASK                    (0x100U)                                            /*!< USBHS0_PORTSC1.PR Mask                  */
#define USBHS_PORTSC1_PR_SHIFT                   (8U)                                                /*!< USBHS0_PORTSC1.PR Position              */
#define USBHS_PORTSC1_PR(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< USBHS0_PORTSC1.PR Field                 */
#define USBHS_PORTSC1_HSP_MASK                   (0x200U)                                            /*!< USBHS0_PORTSC1.HSP Mask                 */
#define USBHS_PORTSC1_HSP_SHIFT                  (9U)                                                /*!< USBHS0_PORTSC1.HSP Position             */
#define USBHS_PORTSC1_HSP(x)                     (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< USBHS0_PORTSC1.HSP Field                */
#define USBHS_PORTSC1_LS_MASK                    (0xC00U)                                            /*!< USBHS0_PORTSC1.LS Mask                  */
#define USBHS_PORTSC1_LS_SHIFT                   (10U)                                               /*!< USBHS0_PORTSC1.LS Position              */
#define USBHS_PORTSC1_LS(x)                      (((uint32_t)(((uint32_t)(x))<<10U))&0xC00UL)        /*!< USBHS0_PORTSC1.LS Field                 */
#define USBHS_PORTSC1_PP_MASK                    (0x1000U)                                           /*!< USBHS0_PORTSC1.PP Mask                  */
#define USBHS_PORTSC1_PP_SHIFT                   (12U)                                               /*!< USBHS0_PORTSC1.PP Position              */
#define USBHS_PORTSC1_PP(x)                      (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< USBHS0_PORTSC1.PP Field                 */
#define USBHS_PORTSC1_PO_MASK                    (0x2000U)                                           /*!< USBHS0_PORTSC1.PO Mask                  */
#define USBHS_PORTSC1_PO_SHIFT                   (13U)                                               /*!< USBHS0_PORTSC1.PO Position              */
#define USBHS_PORTSC1_PO(x)                      (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< USBHS0_PORTSC1.PO Field                 */
#define USBHS_PORTSC1_PIC_MASK                   (0xC000U)                                           /*!< USBHS0_PORTSC1.PIC Mask                 */
#define USBHS_PORTSC1_PIC_SHIFT                  (14U)                                               /*!< USBHS0_PORTSC1.PIC Position             */
#define USBHS_PORTSC1_PIC(x)                     (((uint32_t)(((uint32_t)(x))<<14U))&0xC000UL)       /*!< USBHS0_PORTSC1.PIC Field                */
#define USBHS_PORTSC1_PTC_MASK                   (0xF0000U)                                          /*!< USBHS0_PORTSC1.PTC Mask                 */
#define USBHS_PORTSC1_PTC_SHIFT                  (16U)                                               /*!< USBHS0_PORTSC1.PTC Position             */
#define USBHS_PORTSC1_PTC(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< USBHS0_PORTSC1.PTC Field                */
#define USBHS_PORTSC1_WKCN_MASK                  (0x100000U)                                         /*!< USBHS0_PORTSC1.WKCN Mask                */
#define USBHS_PORTSC1_WKCN_SHIFT                 (20U)                                               /*!< USBHS0_PORTSC1.WKCN Position            */
#define USBHS_PORTSC1_WKCN(x)                    (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< USBHS0_PORTSC1.WKCN Field               */
#define USBHS_PORTSC1_WKDS_MASK                  (0x200000U)                                         /*!< USBHS0_PORTSC1.WKDS Mask                */
#define USBHS_PORTSC1_WKDS_SHIFT                 (21U)                                               /*!< USBHS0_PORTSC1.WKDS Position            */
#define USBHS_PORTSC1_WKDS(x)                    (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< USBHS0_PORTSC1.WKDS Field               */
#define USBHS_PORTSC1_WKOC_MASK                  (0x400000U)                                         /*!< USBHS0_PORTSC1.WKOC Mask                */
#define USBHS_PORTSC1_WKOC_SHIFT                 (22U)                                               /*!< USBHS0_PORTSC1.WKOC Position            */
#define USBHS_PORTSC1_WKOC(x)                    (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< USBHS0_PORTSC1.WKOC Field               */
#define USBHS_PORTSC1_PHCD_MASK                  (0x800000U)                                         /*!< USBHS0_PORTSC1.PHCD Mask                */
#define USBHS_PORTSC1_PHCD_SHIFT                 (23U)                                               /*!< USBHS0_PORTSC1.PHCD Position            */
#define USBHS_PORTSC1_PHCD(x)                    (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< USBHS0_PORTSC1.PHCD Field               */
#define USBHS_PORTSC1_PFSC_MASK                  (0x1000000U)                                        /*!< USBHS0_PORTSC1.PFSC Mask                */
#define USBHS_PORTSC1_PFSC_SHIFT                 (24U)                                               /*!< USBHS0_PORTSC1.PFSC Position            */
#define USBHS_PORTSC1_PFSC(x)                    (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< USBHS0_PORTSC1.PFSC Field               */
#define USBHS_PORTSC1_PSPD_MASK                  (0xC000000U)                                        /*!< USBHS0_PORTSC1.PSPD Mask                */
#define USBHS_PORTSC1_PSPD_SHIFT                 (26U)                                               /*!< USBHS0_PORTSC1.PSPD Position            */
#define USBHS_PORTSC1_PSPD(x)                    (((uint32_t)(((uint32_t)(x))<<26U))&0xC000000UL)    /*!< USBHS0_PORTSC1.PSPD Field               */
#define USBHS_PORTSC1_PTS_MASK                   (0xC0000000U)                                       /*!< USBHS0_PORTSC1.PTS Mask                 */
#define USBHS_PORTSC1_PTS_SHIFT                  (30U)                                               /*!< USBHS0_PORTSC1.PTS Position             */
#define USBHS_PORTSC1_PTS(x)                     (((uint32_t)(((uint32_t)(x))<<30U))&0xC0000000UL)   /*!< USBHS0_PORTSC1.PTS Field                */
/* ------- OTGSC Bit Fields                         ------ */
#define USBHS_OTGSC_VD_MASK                      (0x1U)                                              /*!< USBHS0_OTGSC.VD Mask                    */
#define USBHS_OTGSC_VD_SHIFT                     (0U)                                                /*!< USBHS0_OTGSC.VD Position                */
#define USBHS_OTGSC_VD(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBHS0_OTGSC.VD Field                   */
#define USBHS_OTGSC_VC_MASK                      (0x2U)                                              /*!< USBHS0_OTGSC.VC Mask                    */
#define USBHS_OTGSC_VC_SHIFT                     (1U)                                                /*!< USBHS0_OTGSC.VC Position                */
#define USBHS_OTGSC_VC(x)                        (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< USBHS0_OTGSC.VC Field                   */
#define USBHS_OTGSC_HAAR_MASK                    (0x4U)                                              /*!< USBHS0_OTGSC.HAAR Mask                  */
#define USBHS_OTGSC_HAAR_SHIFT                   (2U)                                                /*!< USBHS0_OTGSC.HAAR Position              */
#define USBHS_OTGSC_HAAR(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< USBHS0_OTGSC.HAAR Field                 */
#define USBHS_OTGSC_OT_MASK                      (0x8U)                                              /*!< USBHS0_OTGSC.OT Mask                    */
#define USBHS_OTGSC_OT_SHIFT                     (3U)                                                /*!< USBHS0_OTGSC.OT Position                */
#define USBHS_OTGSC_OT(x)                        (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< USBHS0_OTGSC.OT Field                   */
#define USBHS_OTGSC_DP_MASK                      (0x10U)                                             /*!< USBHS0_OTGSC.DP Mask                    */
#define USBHS_OTGSC_DP_SHIFT                     (4U)                                                /*!< USBHS0_OTGSC.DP Position                */
#define USBHS_OTGSC_DP(x)                        (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< USBHS0_OTGSC.DP Field                   */
#define USBHS_OTGSC_IDPU_MASK                    (0x20U)                                             /*!< USBHS0_OTGSC.IDPU Mask                  */
#define USBHS_OTGSC_IDPU_SHIFT                   (5U)                                                /*!< USBHS0_OTGSC.IDPU Position              */
#define USBHS_OTGSC_IDPU(x)                      (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< USBHS0_OTGSC.IDPU Field                 */
#define USBHS_OTGSC_HABA_MASK                    (0x80U)                                             /*!< USBHS0_OTGSC.HABA Mask                  */
#define USBHS_OTGSC_HABA_SHIFT                   (7U)                                                /*!< USBHS0_OTGSC.HABA Position              */
#define USBHS_OTGSC_HABA(x)                      (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< USBHS0_OTGSC.HABA Field                 */
#define USBHS_OTGSC_ID_MASK                      (0x100U)                                            /*!< USBHS0_OTGSC.ID Mask                    */
#define USBHS_OTGSC_ID_SHIFT                     (8U)                                                /*!< USBHS0_OTGSC.ID Position                */
#define USBHS_OTGSC_ID(x)                        (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< USBHS0_OTGSC.ID Field                   */
#define USBHS_OTGSC_AVV_MASK                     (0x200U)                                            /*!< USBHS0_OTGSC.AVV Mask                   */
#define USBHS_OTGSC_AVV_SHIFT                    (9U)                                                /*!< USBHS0_OTGSC.AVV Position               */
#define USBHS_OTGSC_AVV(x)                       (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< USBHS0_OTGSC.AVV Field                  */
#define USBHS_OTGSC_ASV_MASK                     (0x400U)                                            /*!< USBHS0_OTGSC.ASV Mask                   */
#define USBHS_OTGSC_ASV_SHIFT                    (10U)                                               /*!< USBHS0_OTGSC.ASV Position               */
#define USBHS_OTGSC_ASV(x)                       (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< USBHS0_OTGSC.ASV Field                  */
#define USBHS_OTGSC_BSV_MASK                     (0x800U)                                            /*!< USBHS0_OTGSC.BSV Mask                   */
#define USBHS_OTGSC_BSV_SHIFT                    (11U)                                               /*!< USBHS0_OTGSC.BSV Position               */
#define USBHS_OTGSC_BSV(x)                       (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< USBHS0_OTGSC.BSV Field                  */
#define USBHS_OTGSC_BSE_MASK                     (0x1000U)                                           /*!< USBHS0_OTGSC.BSE Mask                   */
#define USBHS_OTGSC_BSE_SHIFT                    (12U)                                               /*!< USBHS0_OTGSC.BSE Position               */
#define USBHS_OTGSC_BSE(x)                       (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< USBHS0_OTGSC.BSE Field                  */
#define USBHS_OTGSC_MST_MASK                     (0x2000U)                                           /*!< USBHS0_OTGSC.MST Mask                   */
#define USBHS_OTGSC_MST_SHIFT                    (13U)                                               /*!< USBHS0_OTGSC.MST Position               */
