podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK70F15WS.h
#define USBHS_OTGSC_MST(x)                       (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< USBHS0_OTGSC.MST Field                  */
#define USBHS_OTGSC_DPS_MASK                     (0x4000U)                                           /*!< USBHS0_OTGSC.DPS Mask                   */
#define USBHS_OTGSC_DPS_SHIFT                    (14U)                                               /*!< USBHS0_OTGSC.DPS Position               */
#define USBHS_OTGSC_DPS(x)                       (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< USBHS0_OTGSC.DPS Field                  */
#define USBHS_OTGSC_IDIS_MASK                    (0x10000U)                                          /*!< USBHS0_OTGSC.IDIS Mask                  */
#define USBHS_OTGSC_IDIS_SHIFT                   (16U)                                               /*!< USBHS0_OTGSC.IDIS Position              */
#define USBHS_OTGSC_IDIS(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< USBHS0_OTGSC.IDIS Field                 */
#define USBHS_OTGSC_AVVIS_MASK                   (0x20000U)                                          /*!< USBHS0_OTGSC.AVVIS Mask                 */
#define USBHS_OTGSC_AVVIS_SHIFT                  (17U)                                               /*!< USBHS0_OTGSC.AVVIS Position             */
#define USBHS_OTGSC_AVVIS(x)                     (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< USBHS0_OTGSC.AVVIS Field                */
#define USBHS_OTGSC_ASVIS_MASK                   (0x40000U)                                          /*!< USBHS0_OTGSC.ASVIS Mask                 */
#define USBHS_OTGSC_ASVIS_SHIFT                  (18U)                                               /*!< USBHS0_OTGSC.ASVIS Position             */
#define USBHS_OTGSC_ASVIS(x)                     (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< USBHS0_OTGSC.ASVIS Field                */
#define USBHS_OTGSC_BSVIS_MASK                   (0x80000U)                                          /*!< USBHS0_OTGSC.BSVIS Mask                 */
#define USBHS_OTGSC_BSVIS_SHIFT                  (19U)                                               /*!< USBHS0_OTGSC.BSVIS Position             */
#define USBHS_OTGSC_BSVIS(x)                     (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< USBHS0_OTGSC.BSVIS Field                */
#define USBHS_OTGSC_BSEIS_MASK                   (0x100000U)                                         /*!< USBHS0_OTGSC.BSEIS Mask                 */
#define USBHS_OTGSC_BSEIS_SHIFT                  (20U)                                               /*!< USBHS0_OTGSC.BSEIS Position             */
#define USBHS_OTGSC_BSEIS(x)                     (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< USBHS0_OTGSC.BSEIS Field                */
#define USBHS_OTGSC_MSS_MASK                     (0x200000U)                                         /*!< USBHS0_OTGSC.MSS Mask                   */
#define USBHS_OTGSC_MSS_SHIFT                    (21U)                                               /*!< USBHS0_OTGSC.MSS Position               */
#define USBHS_OTGSC_MSS(x)                       (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< USBHS0_OTGSC.MSS Field                  */
#define USBHS_OTGSC_DPIS_MASK                    (0x400000U)                                         /*!< USBHS0_OTGSC.DPIS Mask                  */
#define USBHS_OTGSC_DPIS_SHIFT                   (22U)                                               /*!< USBHS0_OTGSC.DPIS Position              */
#define USBHS_OTGSC_DPIS(x)                      (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< USBHS0_OTGSC.DPIS Field                 */
#define USBHS_OTGSC_IDIE_MASK                    (0x1000000U)                                        /*!< USBHS0_OTGSC.IDIE Mask                  */
#define USBHS_OTGSC_IDIE_SHIFT                   (24U)                                               /*!< USBHS0_OTGSC.IDIE Position              */
#define USBHS_OTGSC_IDIE(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< USBHS0_OTGSC.IDIE Field                 */
#define USBHS_OTGSC_AVVIE_MASK                   (0x2000000U)                                        /*!< USBHS0_OTGSC.AVVIE Mask                 */
#define USBHS_OTGSC_AVVIE_SHIFT                  (25U)                                               /*!< USBHS0_OTGSC.AVVIE Position             */
#define USBHS_OTGSC_AVVIE(x)                     (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< USBHS0_OTGSC.AVVIE Field                */
#define USBHS_OTGSC_ASVIE_MASK                   (0x4000000U)                                        /*!< USBHS0_OTGSC.ASVIE Mask                 */
#define USBHS_OTGSC_ASVIE_SHIFT                  (26U)                                               /*!< USBHS0_OTGSC.ASVIE Position             */
#define USBHS_OTGSC_ASVIE(x)                     (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< USBHS0_OTGSC.ASVIE Field                */
#define USBHS_OTGSC_BSVIE_MASK                   (0x8000000U)                                        /*!< USBHS0_OTGSC.BSVIE Mask                 */
#define USBHS_OTGSC_BSVIE_SHIFT                  (27U)                                               /*!< USBHS0_OTGSC.BSVIE Position             */
#define USBHS_OTGSC_BSVIE(x)                     (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< USBHS0_OTGSC.BSVIE Field                */
#define USBHS_OTGSC_BSEIE_MASK                   (0x10000000U)                                       /*!< USBHS0_OTGSC.BSEIE Mask                 */
#define USBHS_OTGSC_BSEIE_SHIFT                  (28U)                                               /*!< USBHS0_OTGSC.BSEIE Position             */
#define USBHS_OTGSC_BSEIE(x)                     (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< USBHS0_OTGSC.BSEIE Field                */
#define USBHS_OTGSC_MSE_MASK                     (0x20000000U)                                       /*!< USBHS0_OTGSC.MSE Mask                   */
#define USBHS_OTGSC_MSE_SHIFT                    (29U)                                               /*!< USBHS0_OTGSC.MSE Position               */
#define USBHS_OTGSC_MSE(x)                       (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< USBHS0_OTGSC.MSE Field                  */
#define USBHS_OTGSC_DPIE_MASK                    (0x40000000U)                                       /*!< USBHS0_OTGSC.DPIE Mask                  */
#define USBHS_OTGSC_DPIE_SHIFT                   (30U)                                               /*!< USBHS0_OTGSC.DPIE Position              */
#define USBHS_OTGSC_DPIE(x)                      (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< USBHS0_OTGSC.DPIE Field                 */
/* ------- USBMODE Bit Fields                       ------ */
#define USBHS_USBMODE_CM_MASK                    (0x3U)                                              /*!< USBHS0_USBMODE.CM Mask                  */
#define USBHS_USBMODE_CM_SHIFT                   (0U)                                                /*!< USBHS0_USBMODE.CM Position              */
#define USBHS_USBMODE_CM(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< USBHS0_USBMODE.CM Field                 */
#define USBHS_USBMODE_ES_MASK                    (0x4U)                                              /*!< USBHS0_USBMODE.ES Mask                  */
#define USBHS_USBMODE_ES_SHIFT                   (2U)                                                /*!< USBHS0_USBMODE.ES Position              */
#define USBHS_USBMODE_ES(x)                      (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< USBHS0_USBMODE.ES Field                 */
#define USBHS_USBMODE_SLOM_MASK                  (0x8U)                                              /*!< USBHS0_USBMODE.SLOM Mask                */
#define USBHS_USBMODE_SLOM_SHIFT                 (3U)                                                /*!< USBHS0_USBMODE.SLOM Position            */
#define USBHS_USBMODE_SLOM(x)                    (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< USBHS0_USBMODE.SLOM Field               */
#define USBHS_USBMODE_SDIS_MASK                  (0x10U)                                             /*!< USBHS0_USBMODE.SDIS Mask                */
#define USBHS_USBMODE_SDIS_SHIFT                 (4U)                                                /*!< USBHS0_USBMODE.SDIS Position            */
#define USBHS_USBMODE_SDIS(x)                    (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< USBHS0_USBMODE.SDIS Field               */
#define USBHS_USBMODE_TXHSD_MASK                 (0x7000U)                                           /*!< USBHS0_USBMODE.TXHSD Mask               */
#define USBHS_USBMODE_TXHSD_SHIFT                (12U)                                               /*!< USBHS0_USBMODE.TXHSD Position           */
#define USBHS_USBMODE_TXHSD(x)                   (((uint32_t)(((uint32_t)(x))<<12U))&0x7000UL)       /*!< USBHS0_USBMODE.TXHSD Field              */
/* ------- EPSETUPSR Bit Fields                     ------ */
#define USBHS_EPSETUPSR_EPSETUPSTAT_MASK         (0xFU)                                              /*!< USBHS0_EPSETUPSR.EPSETUPSTAT Mask       */
#define USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT        (0U)                                                /*!< USBHS0_EPSETUPSR.EPSETUPSTAT Position   */
#define USBHS_EPSETUPSR_EPSETUPSTAT(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< USBHS0_EPSETUPSR.EPSETUPSTAT Field      */
/* ------- EPPRIME Bit Fields                       ------ */
#define USBHS_EPPRIME_PERB_MASK                  (0xFU)                                              /*!< USBHS0_EPPRIME.PERB Mask                */
#define USBHS_EPPRIME_PERB_SHIFT                 (0U)                                                /*!< USBHS0_EPPRIME.PERB Position            */
#define USBHS_EPPRIME_PERB(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< USBHS0_EPPRIME.PERB Field               */
#define USBHS_EPPRIME_PETB_MASK                  (0xF0000U)                                          /*!< USBHS0_EPPRIME.PETB Mask                */
#define USBHS_EPPRIME_PETB_SHIFT                 (16U)                                               /*!< USBHS0_EPPRIME.PETB Position            */
#define USBHS_EPPRIME_PETB(x)                    (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< USBHS0_EPPRIME.PETB Field               */
/* ------- EPFLUSH Bit Fields                       ------ */
#define USBHS_EPFLUSH_FERB_MASK                  (0xFU)                                              /*!< USBHS0_EPFLUSH.FERB Mask                */
#define USBHS_EPFLUSH_FERB_SHIFT                 (0U)                                                /*!< USBHS0_EPFLUSH.FERB Position            */
#define USBHS_EPFLUSH_FERB(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< USBHS0_EPFLUSH.FERB Field               */
#define USBHS_EPFLUSH_FETB_MASK                  (0xF0000U)                                          /*!< USBHS0_EPFLUSH.FETB Mask                */
#define USBHS_EPFLUSH_FETB_SHIFT                 (16U)                                               /*!< USBHS0_EPFLUSH.FETB Position            */
#define USBHS_EPFLUSH_FETB(x)                    (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< USBHS0_EPFLUSH.FETB Field               */
/* ------- EPSR Bit Fields                          ------ */
#define USBHS_EPSR_ERBR_MASK                     (0xFU)                                              /*!< USBHS0_EPSR.ERBR Mask                   */
#define USBHS_EPSR_ERBR_SHIFT                    (0U)                                                /*!< USBHS0_EPSR.ERBR Position               */
#define USBHS_EPSR_ERBR(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< USBHS0_EPSR.ERBR Field                  */
#define USBHS_EPSR_ETBR_MASK                     (0xF0000U)                                          /*!< USBHS0_EPSR.ETBR Mask                   */
#define USBHS_EPSR_ETBR_SHIFT                    (16U)                                               /*!< USBHS0_EPSR.ETBR Position               */
#define USBHS_EPSR_ETBR(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< USBHS0_EPSR.ETBR Field                  */
/* ------- EPCOMPLETE Bit Fields                    ------ */
#define USBHS_EPCOMPLETE_ERCE_MASK               (0xFU)                                              /*!< USBHS0_EPCOMPLETE.ERCE Mask             */
#define USBHS_EPCOMPLETE_ERCE_SHIFT              (0U)                                                /*!< USBHS0_EPCOMPLETE.ERCE Position         */
#define USBHS_EPCOMPLETE_ERCE(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< USBHS0_EPCOMPLETE.ERCE Field            */
#define USBHS_EPCOMPLETE_ETCE_MASK               (0xF0000U)                                          /*!< USBHS0_EPCOMPLETE.ETCE Mask             */
#define USBHS_EPCOMPLETE_ETCE_SHIFT              (16U)                                               /*!< USBHS0_EPCOMPLETE.ETCE Position         */
#define USBHS_EPCOMPLETE_ETCE(x)                 (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< USBHS0_EPCOMPLETE.ETCE Field            */
/* ------- EPCR0 Bit Fields                         ------ */
#define USBHS_EPCR0_RXS_MASK                     (0x1U)                                              /*!< USBHS0_EPCR0.RXS Mask                   */
#define USBHS_EPCR0_RXS_SHIFT                    (0U)                                                /*!< USBHS0_EPCR0.RXS Position               */
#define USBHS_EPCR0_RXS(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBHS0_EPCR0.RXS Field                  */
#define USBHS_EPCR0_RXT_MASK                     (0xCU)                                              /*!< USBHS0_EPCR0.RXT Mask                   */
#define USBHS_EPCR0_RXT_SHIFT                    (2U)                                                /*!< USBHS0_EPCR0.RXT Position               */
#define USBHS_EPCR0_RXT(x)                       (((uint32_t)(((uint32_t)(x))<<2U))&0xCUL)           /*!< USBHS0_EPCR0.RXT Field                  */
#define USBHS_EPCR0_RXE_MASK                     (0x80U)                                             /*!< USBHS0_EPCR0.RXE Mask                   */
#define USBHS_EPCR0_RXE_SHIFT                    (7U)                                                /*!< USBHS0_EPCR0.RXE Position               */
#define USBHS_EPCR0_RXE(x)                       (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< USBHS0_EPCR0.RXE Field                  */
#define USBHS_EPCR0_TXS_MASK                     (0x10000U)                                          /*!< USBHS0_EPCR0.TXS Mask                   */
#define USBHS_EPCR0_TXS_SHIFT                    (16U)                                               /*!< USBHS0_EPCR0.TXS Position               */
#define USBHS_EPCR0_TXS(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< USBHS0_EPCR0.TXS Field                  */
#define USBHS_EPCR0_TXT_MASK                     (0xC0000U)                                          /*!< USBHS0_EPCR0.TXT Mask                   */
#define USBHS_EPCR0_TXT_SHIFT                    (18U)                                               /*!< USBHS0_EPCR0.TXT Position               */
#define USBHS_EPCR0_TXT(x)                       (((uint32_t)(((uint32_t)(x))<<18U))&0xC0000UL)      /*!< USBHS0_EPCR0.TXT Field                  */
#define USBHS_EPCR0_TXE_MASK                     (0x800000U)                                         /*!< USBHS0_EPCR0.TXE Mask                   */
#define USBHS_EPCR0_TXE_SHIFT                    (23U)                                               /*!< USBHS0_EPCR0.TXE Position               */
#define USBHS_EPCR0_TXE(x)                       (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< USBHS0_EPCR0.TXE Field                  */
/* ------- EPCR Bit Fields                          ------ */
#define USBHS_EPCR_RXS_MASK                      (0x1U)                                              /*!< USBHS0_EPCR.RXS Mask                    */
#define USBHS_EPCR_RXS_SHIFT                     (0U)                                                /*!< USBHS0_EPCR.RXS Position                */
#define USBHS_EPCR_RXS(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBHS0_EPCR.RXS Field                   */
#define USBHS_EPCR_RXD_MASK                      (0x2U)                                              /*!< USBHS0_EPCR.RXD Mask                    */
#define USBHS_EPCR_RXD_SHIFT                     (1U)                                                /*!< USBHS0_EPCR.RXD Position                */
#define USBHS_EPCR_RXD(x)                        (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< USBHS0_EPCR.RXD Field                   */
#define USBHS_EPCR_RXT_MASK                      (0xCU)                                              /*!< USBHS0_EPCR.RXT Mask                    */
#define USBHS_EPCR_RXT_SHIFT                     (2U)                                                /*!< USBHS0_EPCR.RXT Position                */
#define USBHS_EPCR_RXT(x)                        (((uint32_t)(((uint32_t)(x))<<2U))&0xCUL)           /*!< USBHS0_EPCR.RXT Field                   */
#define USBHS_EPCR_RXI_MASK                      (0x20U)                                             /*!< USBHS0_EPCR.RXI Mask                    */
#define USBHS_EPCR_RXI_SHIFT                     (5U)                                                /*!< USBHS0_EPCR.RXI Position                */
#define USBHS_EPCR_RXI(x)                        (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< USBHS0_EPCR.RXI Field                   */
#define USBHS_EPCR_RXR_MASK                      (0x40U)                                             /*!< USBHS0_EPCR.RXR Mask                    */
#define USBHS_EPCR_RXR_SHIFT                     (6U)                                                /*!< USBHS0_EPCR.RXR Position                */
#define USBHS_EPCR_RXR(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< USBHS0_EPCR.RXR Field                   */
#define USBHS_EPCR_RXE_MASK                      (0x80U)                                             /*!< USBHS0_EPCR.RXE Mask                    */
#define USBHS_EPCR_RXE_SHIFT                     (7U)                                                /*!< USBHS0_EPCR.RXE Position                */
#define USBHS_EPCR_RXE(x)                        (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< USBHS0_EPCR.RXE Field                   */
#define USBHS_EPCR_TXS_MASK                      (0x10000U)                                          /*!< USBHS0_EPCR.TXS Mask                    */
#define USBHS_EPCR_TXS_SHIFT                     (16U)                                               /*!< USBHS0_EPCR.TXS Position                */
#define USBHS_EPCR_TXS(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< USBHS0_EPCR.TXS Field                   */
#define USBHS_EPCR_TXD_MASK                      (0x20000U)                                          /*!< USBHS0_EPCR.TXD Mask                    */
#define USBHS_EPCR_TXD_SHIFT                     (17U)                                               /*!< USBHS0_EPCR.TXD Position                */
#define USBHS_EPCR_TXD(x)                        (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< USBHS0_EPCR.TXD Field                   */
#define USBHS_EPCR_TXT_MASK                      (0xC0000U)                                          /*!< USBHS0_EPCR.TXT Mask                    */
#define USBHS_EPCR_TXT_SHIFT                     (18U)                                               /*!< USBHS0_EPCR.TXT Position                */
#define USBHS_EPCR_TXT(x)                        (((uint32_t)(((uint32_t)(x))<<18U))&0xC0000UL)      /*!< USBHS0_EPCR.TXT Field                   */
#define USBHS_EPCR_TXI_MASK                      (0x200000U)                                         /*!< USBHS0_EPCR.TXI Mask                    */
#define USBHS_EPCR_TXI_SHIFT                     (21U)                                               /*!< USBHS0_EPCR.TXI Position                */
#define USBHS_EPCR_TXI(x)                        (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< USBHS0_EPCR.TXI Field                   */
#define USBHS_EPCR_TXR_MASK                      (0x400000U)                                         /*!< USBHS0_EPCR.TXR Mask                    */
#define USBHS_EPCR_TXR_SHIFT                     (22U)                                               /*!< USBHS0_EPCR.TXR Position                */
#define USBHS_EPCR_TXR(x)                        (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< USBHS0_EPCR.TXR Field                   */
#define USBHS_EPCR_TXE_MASK                      (0x800000U)                                         /*!< USBHS0_EPCR.TXE Mask                    */
#define USBHS_EPCR_TXE_SHIFT                     (23U)                                               /*!< USBHS0_EPCR.TXE Position                */
#define USBHS_EPCR_TXE(x)                        (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< USBHS0_EPCR.TXE Field                   */
/* ------- USBGENCTRL Bit Fields                    ------ */
#define USBHS_USBGENCTRL_WU_IE_MASK              (0x1U)                                              /*!< USBHS0_USBGENCTRL.WU_IE Mask            */
#define USBHS_USBGENCTRL_WU_IE_SHIFT             (0U)                                                /*!< USBHS0_USBGENCTRL.WU_IE Position        */
#define USBHS_USBGENCTRL_WU_IE(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< USBHS0_USBGENCTRL.WU_IE Field           */
#define USBHS_USBGENCTRL_WU_ULPI_EN_MASK         (0x2U)                                              /*!< USBHS0_USBGENCTRL.WU_ULPI_EN Mask       */
#define USBHS_USBGENCTRL_WU_ULPI_EN_SHIFT        (1U)                                                /*!< USBHS0_USBGENCTRL.WU_ULPI_EN Position   */
#define USBHS_USBGENCTRL_WU_ULPI_EN(x)           (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< USBHS0_USBGENCTRL.WU_ULPI_EN Field      */
#define USBHS_USBGENCTRL_WU_INT_CLR_MASK         (0x20U)                                             /*!< USBHS0_USBGENCTRL.WU_INT_CLR Mask       */
#define USBHS_USBGENCTRL_WU_INT_CLR_SHIFT        (5U)                                                /*!< USBHS0_USBGENCTRL.WU_INT_CLR Position   */
#define USBHS_USBGENCTRL_WU_INT_CLR(x)           (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< USBHS0_USBGENCTRL.WU_INT_CLR Field      */
/**
 * @} */ /* End group USBHS0_Register_Masks_GROUP 
 */

/* USBHS0 - Peripheral instance base addresses */
#define USBHS0_BasePtr                 0x40034000UL //!< Peripheral base address
#define USBHS0                         ((USBHS_Type *) USBHS0_BasePtr) //!< Freescale base pointer
#define USBHS0_BASE_PTR                (USBHS0) //!< Freescale style base pointer
#define USBHS0_IRQS { USBHS_IRQn,  }

/**
 * @} */ /* End group USBHS0_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup VREF_Peripheral_access_layer_GROUP VREF Peripheral Access Layer
* @brief C Struct for VREF
* @{
*/

/* ================================================================================ */
/* ================           VREF (file:VREF_A)                   ================ */
/* ================================================================================ */

